[{"body": "It's so magical.", "score": 2},{"body": "Developed at SUNY Stonybrook", "score": 1},{"body": "[What is it?](http://cdn.pophangover.com/wp-content/uploads/2013/12/brad+pitt+seven+gif.gif)", "score": 5},{"body": "You and your kid are totes presh! Congrats!", "score": 1},{"body": "back into the engine with you.", "score": 3},{"body": "Good idea.  It will probably only work with light utensils like the wooden one you're using unless you use a heavier pot.", "score": 1},{"body": "Fuck Vegans in general. ", "score": 1},{"body": "Oh my god, he's gorgeous ", "score": 1},{"body": "Thankfully you included a banana. ", "score": 1},{"body": "At least you went to a bowl game. I can empathize by looking at our last two football seasons as a whole.", "score": 1},{"body": "And yet, you always beat us :/", "score": 1},{"body": "When I was in the Carribean for my honeymoon, there were a ton of places like this. My favorite was the \"Best Buy\" with a wooden blue sign that sold used washing machines. ", "score": 1},{"body": "That's what I was thinking.  I've never been to a wedding where the bridesmaids enthusiastically fought for the bouquet.  ", "score": 2},{"body": "How come you weren't a bridesmaid?", "score": 1},{"body": "At the risk of m'ladying, there seems to be an inverse relationship at work there.", "score": 1},{"body": "Money", "score": 2},{"body": "Are you a woman or a gay homosexual?", "score": 1},{"body": "I watched it with my brother and girlfriend, and the whole time I was trying to defend it while they gave it crap.\n\nBut when that ending came I had to admit that it was the most awful thing I had seen in quite some time.  No way to save face after that.", "score": 1},{"body": "What movie ?", "score": 2},{"body": "Thanks not Kenny.", "score": 1},{"body": "I'm from Des Moines, and now I live in Cedar Rapids where it smells like freshly baked shit.", "score": 6},{"body": "*against", "score": 2},{"body": "Derelict!", "score": 1},{"body": "I like your style.  ", "score": 1},{"body": "Whoa whoa whoa. Are you paying with a card or cash?", "score": 3},{"body": "She looks like Jenny Slate.", "score": 1},{"body": "No one on here listens to the Mike O'Meara podcast, cause I swear that is Oscar Santana's girlfriend Shannon.   I could be mistaken though.", "score": 1},{"body": "I'm learning Thai for.. things.", "score": 1},{"body": "Sexy as fuck ", "score": 2},{"body": "I know this lady! Not very well, but I'm sure I could get a contact number if there is genuine interest. ", "score": 1},{"body": "It's really like Christmas for me.\n\nI could give two shits about the rest of the season. If Cyclones beat the Hawkeyes, it's been a good year.", "score": 1},{"body": "[example](http://rationalfaiths.com/wp-content/uploads/2012/06/macuahuitllm5.jpg)", "score": 4},{"body": "Keys to something", "score": 1},{"body": "Your priority is maintaining an aloof air of superiority instead of enjoying yourself with your friends taking part in a humorous cultural tradition that no one takes seriously. Did I get that right?", "score": 4},{"body": "&gt;400 unmatched baby socks.\n\nWell maybe if you quit fucking hoarding you wouldn't have that many.", "score": -1},{"body": "Here in the suburbs it's just slush, and currently the temperature is lower than it is in Chicago.\n\nMust bundle up and go into the city tomorrow!", "score": 0},{"body": "When he left me I was so heartbroken that I seriously, seriously considered suicide.  I was physically and emotionally bankrupt.  In the moment, all that held me back was my cat purring up against me.  I couldn't bear to hurt myself when I would leave such a loving creature behind with no one to care for her.", "score": 2},{"body": "Narated by Gordon Freeman", "score": -2},{"body": "Yeah, that one too.  :D  ", "score": 3},{"body": "Pfff, what a tryhard.", "score": 2},{"body": "Obviously I did.", "score": 1},{"body": "LOL. If only you knew.\n\nTry 190 pounds you stereotyping dickhead.\n\nJust because I commented something like this, doesn't mean I'm a loser behind the keyboard.\n\nBut, comments that you made, well, they show your true colours. Goodluck with life.", "score": 0},{"body": "Nipple", "score": 1},{"body": "They both learned. That's perfect", "score": 1},{"body": "http://i.imgur.com/mEcoa6w.jpg", "score": 2},{"body": "The devil horns of God. ", "score": 1},{"body": "This is why we can't have nice things.", "score": 1},{"body": "Jewelry?\n", "score": 0},{"body": "Honestly I'm not single and feel this way. You just need the perfect partner in crime.", "score": 1},{"body": "&gt; Majestic ass fuck\n\nftfy", "score": 1},{"body": "Silver. ", "score": 1},{"body": "Anything but bullshit.", "score": 1},{"body": "This, many times this", "score": -4},{"body": "I was thinking of [this scene from WW](https://www.youtube.com/watch?v=NF2KwYLEmro) but thanks for the couple downvotes everyone! I'll be here all week. ", "score": 1},{"body": "A used fleshlight insert and some regrets. ", "score": 1},{"body": "Narrowed down to the maximum!", "score": 1},{"body": "it would be more accurate for the picture to show the rhino to be cutting the guy's finger/toe nails", "score": 0},{"body": "Holy cow, yeah it does look like that! It's much less creepy in real life though :)", "score": 1},{"body": "http://youtu.be/Q3LE15AyT5g", "score": 2},{"body": "My great great uncle was a prison guard in ww2.  A German pow hid the blade in his crutch, but upon arrival in America was shocked to be treated well by the Americans and gave the blade to my uncle because he didn't want to get in trouble for it, or for it to be used on any of the guards who treated him like a human being.  My uncle made the handle after the fact.", "score": 3},{"body": ":(", "score": 1},{"body": "A watch", "score": 1},{"body": "It needs to be at least... Three times bigger.\n", "score": 2},{"body": "Just rocking a different coloured dress like a boss as well.", "score": 1},{"body": "Two for one, eh. Well done. ", "score": 2},{"body": "Wow, there's a lot of bullshit in this thread.\n\nOP, just admit that either you found this picture on the internet and made a thread around it, or you were fucking around with a de-commissioned MRI.", "score": 1},{"body": "Wait... Alex Gordon??? ", "score": 1},{"body": "Wine-drinkin lady has a ring on, though? SMILE it's a wedding! &gt;.&gt;", "score": 1},{"body": "She's all about the D.", "score": 2},{"body": "As long as I don't have to eat the protein blocks. One of very few things from a movie that I can think about that will make me straight up puke.", "score": 4},{"body": "Ima take my bra off....BAST MU NIPS!", "score": 1},{"body": "Air.  Pm me for postal address", "score": 1},{"body": "hey ", "score": 1},{"body": "Ser Davos: the Onion Knight.", "score": 1},{"body": "This might help.\n\nhttp://i.imgur.com/4Ew1xyE.jpg", "score": 2},{"body": "When RAGBRAI went through Cedar Rapids a couple years ago that was my thought as well.", "score": 3},{"body": "Three more words. Big fucking mess. ", "score": 1},{"body": "please go back to instagram with this inane shit.", "score": 1},{"body": "To be honest I always look for a dude in reddit posts.", "score": 1},{"body": "My type of girl. Where do i sign up", "score": 1},{"body": "Her nose is majorly shopped. ", "score": 1},{"body": "i always give fake internet point to feminism.", "score": -1},{"body": "She always looks so heart broken when Robin yells at her.", "score": 1},{"body": "Just to be clear, I'm not a professional quote maker, I'm just a shitty redditor who greatly values copypasta and fake internet points over any silly biologist quote written a year ago.  This being said, I am open to any and all upvotes.\n\n\"In this moment, I am euphoric. Not because of any banned user's quotes.  But because, I am enlightened by my intelligence.\" - BullsLawDan\n\nEh?", "score": 1},{"body": "Yes perhaps you're right but I lack the patience and skill. This is a job for a grandma!", "score": 1},{"body": "So many thirsty ass broads. \n\nYou too OP. ", "score": 1},{"body": "My cousin is getting married next week. Will you be my +1?", "score": 1},{"body": "Now that this ExpertZoologist reinforced the previous post I definitely feel more inclined to believe it. Here is a fake internet point unid... I mean ExpertZoologist. ", "score": 1},{"body": "Ipod.", "score": 1},{"body": "I've had Maid Rite and I'm not even sure what it is.", "score": 2},{"body": "Tried to load this several times before I read you cropped the bottom half ", "score": 1},{"body": "I'm talking about the comments. If you haven't gotten any that make you regret posting it, then that's great, maybe reddit's moving on up. ...personally, though, I still wouldn't put my kid up on a site that hosts the shit this one hosts. It's your choice.", "score": 1},{"body": "Its like someone is holding  food up to a pack of labrador retriever's, with one cat. Looks like an expensive breed.\n\nMy long term GF (at the time) caught the bouquet at my best bros wedding at which I was the best man.\nLong story short, those labradors are wasting their slobber.", "score": 1},{"body": "Looks like an advertisement for Cougar Town. ", "score": 1},{"body": "Lick-Stroke-Contemplate", "score": 2},{"body": "Sorry /u/thatotherguy41 \n\n&gt;I. **No screenshots**, No pictures with added/superimposed text.\n\nAs seen on the sidebar.", "score": 3},{"body": "Yeah. You'd never be caught dead on reddit.", "score": 3},{"body": "Hello?", "score": 0},{"body": "GTA V graphics are getting better, just move the stick to flip it and take it to the shop. ", "score": 1},{"body": "Never. Say. These. Things. On. Reddit. Later inbox", "score": 1},{"body": "Except in Florida. My inlaws used to have lovely citrus trees, but the county came and cut them all down because of fear of blight. And it ended up eradication wasn't effective.  All that free healthy food - gone. ", "score": 1},{"body": "\"Fuck me. I'm single\" FTFY", "score": 1},{"body": "Nexus 4, priority mode", "score": 2},{"body": "i want to eat that", "score": 1},{"body": "amanda?", "score": 2},{"body": "And now you never have to clean it or scrape ice off it or anything.", "score": 1},{"body": "I am laughing and crying and can't quite explain to the Mrs. why...\n\nWe had to read that book in school. It knocked us all for a loop. Great, great book", "score": 2},{"body": "what the fuck?\n\nhow does a 2-yr redditor get that much karma??  holy shit balls....", "score": 1},{"body": "This either doesn't deserve a reply  or you've been living under a rock and don't know what tinder is", "score": -3},{"body": "&gt; Last i heard repairs were at almost $1.3 million!\n\nWhat. A fucking. Scam.\n\nAnd people wonder why medicine costs so much. Perhaps if douchebag financiers didn't gouge the hell out of the market it wouldn't be so damn expensive to HEAL yourself. SO many people suffering out there unnecessarily, all for the sake of profit.\n\n$1.3 million. Like the R&amp;D on MRI machines hasn't been paid and ROI realized ten times over already.\n\nThere should be a law against gouging.", "score": 1},{"body": "Thanks! Always saw it around, never knew what it could possibly mean/be", "score": 2},{"body": "RIP your inbox.", "score": 1},{"body": "&gt;Also after 15 minutes inside the bore you would walk at an angle for about 1/2 hour...\n\n\nWhy?", "score": 1},{"body": "[X] Wear a diaper\n\n[ ] Quit drinking\n", "score": 230},{"body": "Fascinating, thank you for the response. Interesting to see what the experience is like.\n\nDid you experience any phosphenes?\n\nI have personally seen 25T and 50T analytic magnets, but inside enclosures.\n\n", "score": 1},{"body": "Hands down the best wedding photo ever! Cheers to you fellow zero fucks given martini drinking friend! ", "score": 1},{"body": "Hey, some karmawhores have lives outside of reddit.\n\nThey have to.  I'll go insane if I know this is all I have.", "score": 1},{"body": "This reminds me of meter beaters. Every year at Christmas time a local business owner sends out employees to feed expired parking meters. They place advertisements on windshields of cars parked at expired meters that look exactly like parking tickets. I've felt that sweet relief like the relief these people probably feel \"Criminy my tires are slashed...wait a sec! Phew just Slash!\"", "score": 1},{"body": "Your shared interests lead me to believe that you are both huge pieces of shit.", "score": 1},{"body": "a cat?", "score": 1},{"body": "Snow piercer. It's on Netflix I think.", "score": 1},{"body": "I'm really really sorry for what you went through... and am glad you found an adorable pet in your time of need...\n\nBut I really can't stand the title of this post.  \n\nGood luck to you in all of your future ventures.", "score": 0},{"body": "What kind of stealth, F-117 style, B-2 style? F-117 type was pretty crude, hard to imagine it being more complex than a nuclear submarine, Apollo program, etc", "score": 1},{"body": "What dog? ", "score": 1},{"body": "You wouldn't want to ice skate on Lake Michigan.", "score": 1},{"body": "Was this in Lodi?", "score": 1},{"body": "Porque no los dos?", "score": 3},{"body": "Man, they sell all kinds of random shit at Walgreens. ", "score": 1},{"body": "An **awesome** example.", "score": 1},{"body": "It's looks like he did make some money out of the internet fame he received http://www.telegraph.co.uk/news/worldnews/asia/china/7897072/Chinese-tramp-Brother-Sharp-shoots-to-movie-fame.html", "score": 3},{"body": "Seems like the right choice.", "score": 54},{"body": "OHHH do me do me", "score": 1},{"body": "wait... I meant LS*D*", "score": 1},{"body": "/r/ofcoursethatsathing", "score": 1},{"body": "Love the Jordan tongue both the front girls are making.", "score": 1},{"body": "As if there's something wrong with that.", "score": 0},{"body": "That photo was taken from the best bar in the city. Or the restaurant, but either way, the views can't be beat. \n\nAnd damn, it's definitely cold here. ", "score": 1},{"body": "Lesson: DON'T PUT METAL IN THE FUCKING SCIENCE OVEN!", "score": 1},{"body": "To me this is more of a Rupert and Stewie situation...", "score": 1},{"body": "The silver foxes are not going to make that much better of pets; 50 years is a **fraction** of the time that it takes to truly breed good genes. Look at any recognized dog breeds, 50 years is **nothing**. They're still a fox, (a fox being a wild animal) you don't hear anyone saying 'domesticated dog' because they are practically an evolved species. A domesticated squirrel is still a fucking squirrel lol", "score": 1},{"body": "Write them a letter saying that you will find a diffrent bank that will let you use it. ", "score": 1},{"body": "http://youtu.be/eO4rPGFYBDk", "score": 1},{"body": "All I want to know is what in the hell are you looking at?", "score": 1},{"body": "I think I love you!", "score": 0},{"body": "I thought it simulated a huge ass vacuum and sucked it right in. ", "score": 1},{"body": "The hot one doesn't need to care about superstition to find a partner.", "score": 1},{"body": "Seriously, situate a pay to use toilet in an obvious place nearby and just prepare to rake in the cash. \n\nIf people have a reaction and get desperate, money will be made.", "score": 1},{"body": "virginia beach? ", "score": 1},{"body": "Premium is actually worse for cars that do not require it. It requires a more powerful spark to combust and if the car is not tuned for that some fuel will be unburnt, thus it being less efficient and actually dirtier than using 87 instead of premium octane.\n\n\nAlso: all gas sold at stations now is unleaded. This sign is stupid.", "score": 2},{"body": "/r/nottheonion did not appreciate [this post](http://www.reddit.com/r/nottheonion/comments/2rlo0k/worlds_largest_onion_weighing_18lb_smashes/)", "score": 1},{"body": "/r/TrollXChromosomes will love you.", "score": 2},{"body": "Please let it be a tiny safe. With no keys.", "score": 3},{"body": "Haha a non ugly girl on the front page, who would have known! She likes alcohol too! What a unique girl. Let's give her 6k upvotes and gild her twice for being so special. ", "score": 4},{"body": "Chihuahua punched you?", "score": 1},{"body": "Awkward moment when a bear has more game than you", "score": 1},{"body": "Classic Scherbatsky.", "score": 1},{"body": "ipad", "score": 1},{"body": "I'm a bit careless so I end up with lots of minor burns. ", "score": 2},{"body": "Snowpiercer", "score": 2},{"body": "But he still won't get an Oscar for it.", "score": 1},{"body": "a dick in a box", "score": 2},{"body": "I saw one of these in israel", "score": 1},{"body": "Are you saying this guy and his sonion are nazis?", "score": 1},{"body": "I took the same photograph! Only 6 months prior :)\nhttp://imgur.com/yjBtoR7", "score": 0},{"body": "That guy next to you was cooked", "score": 1},{"body": "Apologies for ignorance, but it is that ocean, lake etc and what is the name?", "score": 1},{"body": "Kindle fire", "score": 1},{"body": "Where in big bear is this?", "score": 1},{"body": "Gorgeous shot. ", "score": 2},{"body": "magic the gathering cards", "score": 1},{"body": "I always thought that's what they were there for.", "score": 3},{"body": "\"Misused\"", "score": 2},{"body": "Slut quench", "score": 1},{"body": "Cock carousel 2015 - that's where!!!", "score": 1},{"body": "That's me and my experience with weddings. One actually hit the floor right in front of me an landed at my feet. I just pretended not to notice it and walked off to the bar. I got lots of laughs and if I remember correctly one of the kids in attendance ran up and grabbed it.", "score": 1},{"body": "Ohhh.... You're just a baby. Class of 93 here. My dad taught at LC for 38 years (retired in '96 They named Hart field baseball diamond after him). Was Thew, Penrod, Yearout, &amp; Pierce still teaching in 2012? Can't remember when they retired... those guys are like my uncles. So many good memories.. My first house I bought as an adult was on the corner if 38th &amp; Arthur. Wish I still had it. I'm.all like sad &amp; nostalgic now.", "score": 2},{"body": "What in the zlatan?", "score": 1},{"body": "I like those odds.", "score": 2},{"body": "Lake Michigan ", "score": 1},{"body": "I wouldnt worry too much about it - this card just made it easy for cashiers to spot your inner neckbeard", "score": 0},{"body": "an xbox game", "score": 1},{"body": "sluuuuurp", "score": 1},{"body": "If that's true I don't want to know how they figured out that was a potential problem...", "score": 1},{"body": "It's empty, just like your promises!  :'(", "score": 2},{"body": "[Almost](http://www.weapons-universe.com/Brass_Knuckles_History.shtml)", "score": 1},{"body": "Let me guess, \"as a resident of this shit hole of a city\", you probably have visited Detroit a few times to go to a Red Wings game but afterward quickly run back to your cookie cutter Sterling Heights home.", "score": 0},{"body": "It would be cool if we could have a Milky Way for scale.", "score": 1},{"body": "White Persian?", "score": 1},{"body": "http://i.imgur.com/s5w4LQy.jpg", "score": 1},{"body": "And you've only listed your own personal experience. My point has been made yet you still seem to be unable or unwilling to read. Shall I do your homework for you an link relevant studies or perhaps I will spare myself the headache and move along.", "score": 1},{"body": "Hooray for the booze culture.", "score": 1},{"body": "oculus rift. send it over", "score": 1},{"body": "Honestly, it'd just be a really, really depressing movie that ends with a really depressing ending. Who'd want to watch that?", "score": 0},{"body": "Skudson", "score": 1},{"body": "Dinosaurs", "score": 1},{"body": "Aldo Raine: \"I hated Nazi's but the hell if I was gonna' let some Jerry fucker stab a man and risk cuttin' himself.\"", "score": 2},{"body": "You ever been to Pizza On Dubuque? Best pizza in the city. I went to school in West Branch for awhile :)", "score": 1},{"body": "Dang it. I knew it looked wrong. ", "score": 2},{"body": "Is your dog stuck in a stock Windows Wallpaper?", "score": 1},{"body": "I have come to talk to you again.", "score": 1},{"body": "Hm. So this is why protractors are used as assassination weapons.", "score": 1},{"body": "Could be a county thing, sheriff's volunteer deputy, no idea.", "score": 1},{"body": "We're just in and this year starts great!", "score": 2},{"body": "Could be worse.  You could be married.", "score": 1},{"body": "Thanks", "score": 1},{"body": "The copyright holder is a giant corporation that doesn't waste their legal resources on licensing intellectual property to individuals.", "score": 1},{"body": "What kind of aids?  Nurse's aids?  Teacher's aids?  Financial aids?  Military aids?\n\nYou need to be more specific.  You appear to lack depth when you don't specify what type of aid you're referring to.", "score": 3},{"body": "A Chinese-English dictionary that has an obscure mathematical formula scribbled in the margin on page 156 (right next to the entry for 歌).  The formula, when plugged into a 3D printer, produces a sculpture of a phallic object being thrust into the keyhole of a padlock.  The padlock doesn't actually open, it's another clue, and the answer is donkey (dong-key, get it?).  \n\nOn the bottom of the box is a three-by-three grid, with an animal in each section.  The section with the donkey in it (the upper right, in case you're wondering) can be peeled off.  Hidden underneath is an impossibly thin wad of folded-up tissue paper.  \n\nWhen the tissue paper is carefully unfolded, it shows dickbutt.  \n\nEDIT:  But wait, there's more!  A careful examination of the dickbutt drawing shows that the lines are actually lines of text.  The text reads like gibberish at first glance, but it's actually encrypted with a cypher.  The keyword to the cypher is, of course, \"donkey\".  When the text is decrypted, it becomes a URL to an [obscure corner of the web](https://www.youtube.com/watch?v=dQw4w9WgXcQ).  ", "score": 4},{"body": "best robin scherbatsky impersonator ever", "score": 1},{"body": "Pretty sure we've both established internal retardation. Unfortunately.", "score": 1},{"body": "Good memories! My grandma has four of those plants in her backyard, right next to the orange tree. Arizona is a neat place... I want to go back.", "score": 1},{"body": "I moved away when I was 8 too. I bounced around foster homes for awhile before getting adopted and moving to Iowa Falls with my parents :)", "score": 1},{"body": "Where do I start? The tilt? The fact that the bouquet is not even visible? The awkward expressions on many? The inclusion of the photo umbrella in the top right?", "score": 1},{"body": "Maid rites are the swizzle. When I was a kid they were .25\nHad 2 a couple weeks ago from Quincy,ill.\nSloppy joes minus the sloppy.\nAll nom nom.", "score": 1},{"body": "Admit it OP - you printed the picture, you taped the picture to your tire, you took a picture of the picture, and then you posted the picture to imgur, and then you posted the picture to reddit, and then you smiled, and then you wrote a clever title, and then you waited for the upvotes, and then you put a kettle on the stove", "score": 6},{"body": "You ever been to Pizza On Dubuque? Best pizza in the city. I went to school in West Branch for awhile :)", "score": 1},{"body": "Battletoads", "score": 1},{"body": "As an Australian this pisses me off to see our native fauna like this.  Kangaroo's are not domestic pets, its cruel to treat them like that.  ", "score": 3},{"body": "dawg what happened to your face and shirt? lmao", "score": 1},{"body": "The best kind of tomato ", "score": 1},{"body": "I cant tell if that's directed at me or drunkiemcgeech.", "score": 1},{"body": "That is definitely me", "score": 1},{"body": "It got autobot deleted :(", "score": 1},{"body": "Can confirm, have dated an Indian girl, a South Pacific Island girl, a Jewish girl, and a Mexican girl.  Hotness comes in all colors.", "score": 2},{"body": "A cat that is dead and alive?", "score": 2},{"body": "190 lbs? at 5' right?", "score": 2},{"body": "TIL Any basketball can be used indoor and outdoor.", "score": 2},{"body": "Actually, some have.  Specifically if you call out for the rights to be one time use, or non-transferable, or not for profit.  Yes, sometimes they do.", "score": 1},{"body": "It's the MRI equivalent of the mad hatter syndrome.", "score": 1},{"body": "It's a glacial lake: Lake Michigan", "score": 1},{"body": "Fayetteville checking in. ", "score": 0},{"body": "It really is fun to touch! A little slimy, and firmer than jello, but so good.", "score": 1},{"body": "I went to 6 weddings last summer with my gf. We got drunk at the open bar at all of them. You don't need to be single to take advantage of it!\n", "score": 1},{"body": "You kick ass!  Keep fighting and never lose hope.  My dad beat stage 4 this year by some miracle.  It's a dark dark road.  I hope you keep getting healthier!  If you ever just need to chat with a random redditor, I'm around.", "score": 1},{"body": "Wrong....again.\n\nTry 6' \"right\".", "score": 0},{"body": "I could always shoot a street ball better for some reason.", "score": 1},{"body": "I thought the white ceramic thing was airborne. ", "score": 1},{"body": "6200 upvotes and 2x gilded in 4 hours...", "score": 1},{"body": "Omg I haven't thought about RAGBRAI in years. It gets crazy when they come through your town lol. My dad ran a beer garden while I hosted 60+ bikers in our backyard.", "score": 1},{"body": "I think that they already made a movie about him. ", "score": 3},{"body": "&gt; As an actual parent of an actual human boy, this shit is offensive.\n\nTumblr is leaking, reddit is being triggered. Should write to OP to remind him to put trigger warnings next time for your special snowflake feelings.", "score": 1},{"body": "Did you get Stephen Root's autograph?", "score": 1},{"body": "Where's that Nathan fillian gif when you need it?", "score": 1},{"body": "Lush is a colloquial term for an alcoholic...a female alcoholic.", "score": 1},{"body": "It's not linked! I feel like I jumped into an empty swimming pool\n", "score": 2},{"body": "No love for [Under Dog and Sweet Poly Purebred?](http://assets.nydailynews.com/polopoly_fs/1.97826.1313905099!/img/httpImage/image.jpg_gen/derivatives/gallery_1200/gal-underdog9-jpg.jpg) \n\nThe cry goes up far near for Underdog! Speed of lightning, roar of thunder, Underdog!\n", "score": 2},{"body": "Matter. Don't PM that guy, PM me.", "score": 1},{"body": "it's an old ad, when you had a phone just as dumb", "score": 1},{"body": "I have been to Pizza on Dubuque, but having eaten at the Wedge for many years, I strongly dispute your assertion of best pizza in IC.", "score": 2},{"body": "GOODNIGHT, SEATTLE!", "score": 1},{"body": "M'lanta\n\nAm I doing this right", "score": 1},{"body": "I really shouldn't look at pictures like this when the windchill is -26 F and falling fast.", "score": 2},{"body": "In a box", "score": 1},{"body": "This. A thousand times. \n\nSigh. I'm at a bar... alone", "score": 1},{"body": "Who invited Kim Jong-un? Next to blue shirt guy.", "score": 1},{"body": "So is kitty.\n\nYou healed each other.", "score": 2},{"body": "Ohh ok, makes sense.", "score": 2},{"body": "Yeah she got me good!  Nipped my face, bit the sh*t out of my thumb.  I didn't let go though.  No freakin way at that point (11 days) I was committed to the cause : )", "score": 1},{"body": "You're welcome! I actually found the [song](https://www.youtube.com/watch?v=dQw4w9WgXcQ) in case you're interested!", "score": 6},{"body": "[Me](http://media.giphy.com/media/XISej88ijqdMc/giphy.gif) in the last garter toss wedding thing.", "score": 1},{"body": "St..stick...stick your penis into it...", "score": 1},{"body": "Kool Aid isn't THAT good.", "score": 1},{"body": "You'd fit in amazingly with my gf and her friends. ", "score": 1},{"body": "It is. In the US at least.", "score": 2},{"body": "So...you get pissed?", "score": 4},{"body": "Also one of the only things that can prey on sea turtles, through the shell and all. Those teeth are scary!", "score": 1},{"body": "That's what it's from, actually. ", "score": 3},{"body": "She was wrong.", "score": 1},{"body": "There's a picture from my wedding that's very similar, except its all the guys and none of them moving for the garter.", "score": 1},{"body": "He looks unkempt, possibly dirty, hungry and tired to me. :(  Poor guy :(", "score": 1},{"body": "[Just cite the parody law](http://en.wikipedia.org/wiki/Dumb_Starbucks)", "score": 1},{"body": "But to be fair there are very few other places in the world where gang rape is so prevalent that even tourists fall prey to it. Several years ago a ferry was sinking snd as a female journalist was trying to help people in the water she claimed they were groping and attempting to rape her, mid drown.  Their culture is shit.", "score": 1},{"body": "Those scars have gotten you laid haven't they?", "score": 1},{"body": "I live in China. For these sorts of events the boss brings in ringers- (professional models) for the cameras. They are the equivalent of car models. Lets get real- even in Asia girls who look like that do not flip burgers all day long.\n\nThe [Huffpost](http://www.huffingtonpost.com/2013/01/04/mcdonalds-uniforms_n_2402394.html) link show’s the real staff in costume. \n\nHere are some more pictures of typical Chinese McDonalds staff:\nhttp://www.mcdonalds.com.tw/content/dam/taiwan/site/news_room/2013/2013-03-18/3.jpg\n\nhttp://www.66163.com/upload_pic/201305/201305151651566093.jpg\n\nTaiwan has a lot more maid culture and in general is less filled with seething hatred for all things Japanese (except porn) than the Mainland.", "score": 1},{"body": "Suck it REAL Baxter! NO ONE WILL KNOW THE REAL YOU!!!", "score": 2},{"body": "Bowl", "score": 1},{"body": "\"You must be sooo cultured, please, tell me more, I insist, really.\"", "score": 1},{"body": "That actually makes a lot of sense.", "score": 1},{"body": "Dammit Nathan! ", "score": 1},{"body": "I don't think I'll ever look at jello the same again.", "score": 1},{"body": "She loves you!! I wish my cat would look at me with those cute eyes.. I think she is annoyed me of. XD but I have the coolest cat! She let me tease he all the time. And when there is no food, she would sleep on me... or sit on my lap if I were using computer..to get my attention.. that's how she asked for food ever since I had her when she was so little. It's cute.. OVERLOAD!", "score": 2},{"body": "Hmmmmm...Are you sure he is not a Chinese hipster?", "score": 1},{"body": "I've gone through depressive episodes my whole life, this is the first time I've gone through one since I got my cat. I would have never guessed how much better I'd feel having this little purr baby with me. I never knew cats could be so comforting. I always preferred dogs but I've definitely changed my mind.", "score": 1},{"body": "Oh man, I would love to eat onion rings that are big enough to be worn as a crown. In fact, I would wear one as a crown as I consumed the rest.", "score": 1},{"body": "Damn, stupid auto correct ", "score": 1},{"body": "To be fair he didn't say *how* they've used it.", "score": 1},{"body": "After four years of paradise, headed back for the foreseeable future in a week.  Not excited.", "score": 1},{"body": "The hot one takes a drink and says \"fuck it.\"", "score": 1},{"body": "Just like my college experience ", "score": 1},{"body": "Not entirely beaver poo, but beaver secretion from a mixture of the castor sacs and anal glands has been used for both raspberry and vanilla flavoring. Fun fact whenever somebody you know goes for vanilla ice cream ", "score": 1},{"body": "Could not be more envious.\n\nIt's currently 40ºC where I am in Australia, with bush fires raging all around. ", "score": 1},{"body": "(It's cause we get bad sunburn.)", "score": 1},{"body": "We use them for pool noodles", "score": 1},{"body": "&gt;[included the less obnoxious response, pre-edit:] The silver foxes are not going to make that much better of pets; 50 years is a fraction of the time that it takes to truly breed good genes. They're still a fox, (a fox being a wild animal) you don't hear anyone saying 'domesticated dog' because they are practically an evolved species. \n\n\n\nConjecture.\n\nLook further into the experiment. It's an interesting read.", "score": 1},{"body": "RIP your inbox. ", "score": 1},{"body": "Why does appreciating an attractive lady make you lonely?  I'm actually quite enjoying being single.  But shes cute as hell, plain and simple.", "score": 1},{"body": "Just another reason to drink. ", "score": 1},{"body": "A little early, no?", "score": 1},{"body": "I see two upvotes.  Your thin plot can only go so far.", "score": 1},{"body": "[Relevant](https://www.youtube.com/watch?v=1GncYQHBJIw)", "score": 1},{"body": "Shadow from her own hand, maybe?", "score": 1},{"body": "I was actually looking for a specific photo of a guy holding up a dead sea turtle with a perfectly clean bite taken out of it but I couldn't find it.", "score": 1},{"body": "Da fuk r u talking about u crackhead", "score": 1},{"body": "They've got mine!\n\n(Second row up, fourth from the left.)", "score": 1},{"body": "Get Fox Television on the horn.", "score": 1},{"body": "I think he means vanilla flavouring.\n\nThe artificial version comes from the glands that are located close to the beaver's bum.", "score": 1},{"body": "I moved to Texas for a few years for my husband's job. I missed the white Christmas thing and was sad my kids didn't get to spend time in the snow but I did not miss driving in the craziness. Now we live in West Virginia and I'm having to relearn winter driving haha. ", "score": 1},{"body": "See your way to hell femhater", "score": 1},{"body": "No metal in the MRI room you guys! ", "score": 1},{"body": "that' just it tho -- there's no way you can sense the lack of oxygen\n\nthat's how carbon monoxide kills so easily -- you just pass out and that's it\n\nexperiments for using nitrogen as a lethal process say it's a good way to go -- the lack of O2 makes you giddy for a bit\n\nhttp://en.wikipedia.org/wiki/Inert_gas_asphyxiation", "score": 1},{"body": "Number? ", "score": 1},{"body": "City of five smells ", "score": 1},{"body": "What a shame that after all of that work and mtn dewing you're going to wreck it on your first flight... :/", "score": 1},{"body": "My friend: \"The keg is okay.\"", "score": 1},{"body": "tumblr is leaking its diarrhea-level comments", "score": 1},{"body": "Anyone care to comment on the George Lucas?", "score": 1},{"body": "Colorful boats of Malta looks superb.", "score": 1},{"body": "I love this picture. Even with the images your mind literally cannot comprehend that kind of size. ", "score": 1},{"body": "This is the first I've seen of it and it's the dumbest thing I've read today already.", "score": 1},{"body": "I feel like we're losing the metaphor a little bit here...", "score": 1},{"body": "True, a lot of it seems misplaced, and people seem to think us asians are younger than we look. Then again, they don't have big breasts.", "score": 1},{"body": "When I was small, I lived down the street from a kid everyone called \"rat boy\" because he would bring his rat to the park. I used to play with it all the time though, and this totally just reminded me about that era of my life ", "score": 1},{"body": "Is it just me or is this not viewable on mobile?", "score": 1},{"body": "but shit, it was 99 cents!", "score": 1},{"body": "http://i.imgur.com/IyqjQc3.png", "score": 1},{"body": "As a cartoonist, I'm thankful a giant bank can't sell products using my unlicensed work without fearing civil liability.", "score": 1},{"body": "We have like 5 real towns so it's pretty easy for us all to relate to each other", "score": 1},{"body": "What?? This isn't his pic?? ", "score": 1},{"body": "I watched a documentary about poor teen boys in India who dug up muck from sewer drains to sell to people who refine the gold out of it.", "score": 1},{"body": "I like they have the fast wheelchair guy and not sad sitting back wheelchair guy.", "score": 1},{"body": "Bullshit. I've had aloe juice plenty of times.", "score": 1},{"body": "For once it /u/GallowBoob, he probably reposted it from somewhere else though.", "score": 1},{"body": "You should invest in a higher resolution dog.", "score": 1},{"body": "Iunno, what's your sigma on that finding?", "score": 1},{"body": "God I remember attending band camp at UNI in middle school. I was such an awkward preteen.", "score": 1},{"body": "Try cooking with them. They're like onions, just better for almost anything you pan-fry.", "score": 1},{"body": "You should have hacked it so I couldn't downvote. Now look what you've done. \n", "score": 1},{"body": "How can you turn a magnet on and off? Wouldn't it always be magnetic?", "score": 1},{"body": "Isn't that from the Fiat debut commercials?", "score": 1},{"body": "FEED THE BEAST", "score": 1},{"body": "Holy shit I think hes actually a super hero", "score": 1},{"body": "I did-- it's a laughable experiment compared to the practices of dog breeding", "score": 1},{"body": "A dick?", "score": 1},{"body": "You're so quirky ", "score": 1},{"body": "It's in the top bar at the back of the lodge!", "score": 1},{"body": "This is the part of the wedding when i slide tackle my girlfriend, every single time", "score": 1},{"body": "I wish I was a fly on the wall when you came up with that, just to see you feverously stuff those things on your dog, smiling and laughing all the way to the bank in the face of Father Winter and his cold bite.", "score": 1},{"body": "It looks like someone just took a budding twig and stuck it in a pot.", "score": 1},{"body": "[Yea but you'll feel oxygen deprived.](http://en.wikipedia.org/wiki/Hypoxia_%28medical%29) ", "score": 1},{"body": "Oh Craig ™", "score": 1},{"body": "also, \"~ my grandfather\" seems to be an approximation", "score": 1},{"body": "You remind me of robin in how I met your mother... Lol.. Seems like something she would do.", "score": 1},{"body": "So cute!!", "score": 1},{"body": "Did we learn nothing from all those fancy jails for magneto in the X-Men movies?!", "score": 1},{"body": "Not really. For sunburns and minor abrasions the best thing to do is to hydrate the skin and aloe is a great moisturizer without having perfumes and other crap in it which can irritate burned skin.  Also, as it dries on your skin it provides a cooling effect which is very soothing.  Not a placebo at all. ", "score": 1},{"body": "Lorelai Gilmore/Robin Scherbatsky/Liz Lemon", "score": 1},{"body": "World's* tiniest\n\n    worlds = more than one world\n\nLearn this.", "score": 1},{"body": "No, no it's not.", "score": 1},{"body": "oh I get it it's the cars in the middle can't get out unless one of the cars from either side gets out, please explain yourself, reddit is  not a game. ", "score": 1},{"body": "My grandma lives in Waterloo! \n\nBut uh... Is my link broken? It's just some guy ", "score": 1},{"body": "I too have seen the gif with that text overlayed", "score": 1},{"body": "http://9gag.tv/p/aKWZaQ/australian-hurdler-michelle-jenneke-starts-2015-off-with-sexy-workout-video\n\nFor proof.", "score": 1},{"body": "Honestly, I like this", "score": 1},{"body": "I feel for you, man.  A few years back I went to the ER when the front retaining pin on a MAC-11/9 came loose and two rounds of 9mm went off about a couple inches from my right hand. That was an unpleasant afternoon. Though mechanical things do fail. But yeah, I get you.  \n\nI personally think they shoot like crap. For me, anyway.  And that mag floorplate design is beyond stupid. \n\n&gt; My next purchase will be a sig, still torn on what model. I had for less than 24 hours a Scorpion Carry and LOVED it, but the day after I picked it up my wife gave birth to my daughter wgo went immediately into NICU so my financial situation took a drastic hit. But that 226....\n\nI feel you again. Hobbies come second. You're going to hate me but probably favorite handgun I own (and its among a C96 Mauser, a S&amp;W M1917, P220, 1960's Colt Detective Special, 1911s, etc) is my P226. It just doesn't want to miss the target or not fire. Thousands and thousands of rounds through it (it's *well* past due for springs, and possibly a barrel) and it just keeps going. \n\nAnyway, I was walking out of my gun club a few years back and notice a \"20% off all Sigs\" sale sign. I had in my hand a 15% off store credit. And I had just bought some NFA things, so the guy was willing to give me an additional discount. Brand new plain old P226 $525 out the door, including tax. I couldn't pass that up, even though I was in the virtual poorhouse for a bit.\n\nI've been sorta/kinda looking for a West German Sig P220 in 9mm. Though a P227 is calling me...", "score": 1},{"body": "You keep saying this word, and...it's awesome", "score": 1},{"body": "No, you would much rather have 40C.\n\n&gt;THE WIND CHILL WARNING IS NOW IN EFFECT UNTIL 8 AM CST WEDNESDAY.\n\n&gt;WIND CHILL VALUES... 35 TO 40 DEGREES BELOW ZERO.\n\n&gt;TIMING... THE COLDEST CONDITIONS WILL BE AROUND SUNRISE.\n\n&gt;PRECAUTIONARY/PREPAREDNESS ACTIONS...\n\n&gt;A WIND CHILL WARNING MEANS THE COMBINATION OF VERY COLD AIR AND STRONG WINDS WILL CREATE DANGEROUSLY LOW WIND CHILL VALUES. THIS WILL RESULT IN FROSTBITE AND LEAD TO HYPOTHERMIA OR DEATH IF PRECAUTIONS ARE NOT TAKEN.", "score": 1},{"body": "Looks like your fridge is a portal to the Twilight Zone.", "score": 1},{"body": "Miss you in the saddest fashion", "score": 1},{"body": "My 7 year old niece is still on Christmas vacation...", "score": 1},{"body": "Happy in a relationship and even I want to marry you now. Haha.", "score": 1},{"body": "Looks like the edge of the world. Very cool!", "score": 1},{"body": "/r/Pic is a hundred times better than /r/pics. Instead of making OP feel bad for posting this, just subscribe there instead. ", "score": 1},{"body": "In your work.", "score": 1},{"body": "This is my game", "score": 1},{"body": "Shadow doesn't line up exactly with yellow dotted line.  This kills the perfectionist.", "score": 1},{"body": "Alright cool. I thought so.", "score": 1},{"body": "Yo-yo", "score": 1},{"body": "I was using the plant itself. I had chicken box when I was about 12 and the dermatologist told my mom that putting the raw aloe vera sap on the scabs would lessen future scars. I remember perfectly having to rub that on my face. Some of the spots where I had to put it where way too close to my nose. ", "score": 1},{"body": "Did those gays sometimes have intercourse in public?", "score": 1},{"body": "I hope you meet someone that has unconditional love for you. You have been down now its time for your up. I had only my dog going thru the trouble times. I know how you feel. I wish you the best.", "score": 1},{"body": "haha yeah i'v been thinkin the same thing, I have a simulator and a little electric foam plane i'v been practicing with so hopefully it will last more then one flight.", "score": 1},{"body": "She'd probably hurdle your dick amirite lol", "score": 1},{"body": "Just because someone is willing to get drunk doesn't make them a drunk/alcoholic. ", "score": 1},{"body": "Couldn't really find any photo proof, a lot of links I found said they could, and you can't lie on the internet, so there's that. [Since dead turtles are a bit sad here's a video of how turtles stop themselves from being dead.](https://www.youtube.com/watch?v=1Smd9pOlsNk)", "score": 1},{"body": "Classic Liz Lemon", "score": 1},{"body": "Let's not conflate the two. Apples and oranges.", "score": 1},{"body": "Then the construction workers had an \"accident\" in the parking lot.", "score": 1},{"body": "I honestly believed that I was the only woman who did this at weddings. Fantastic. ", "score": 1},{"body": "ssshh, nobody tell him.. see if he figures it out himself", "score": 1},{"body": "As I get older, it's nice to see other women in the world who aren't so tied to tradition and just do what they do.  Honestly, I appreciate this picture tons. Besides the fact that it is funny, it's also quite meaningful. As a women in this day and age, I hold onto certain traditions that are near and dear to me, but there just are some that I could give a shit about. Wedding traditions are in the bucket of traditional shit I personally do not care for. I would rather spend my time getting to know people, toasting, dancing, and enjoying the wedding with everyone there. I also just love meeting and seeing other classy, bad ass bitches.  No hate. They know who they are.", "score": 1},{"body": "I haven't seen one water color tattoo that I like. I just don't like the art style. ", "score": 1},{"body": "They completely shredded that tire. ", "score": 1},{"body": "Who you callin' a pussy. ", "score": 1},{"body": "http://i.imgur.com/hmkUrQt.jpg", "score": 1},{"body": "probably not viewable. the website runs java, I believe. Apologies.", "score": 1},{"body": "I care...for science", "score": 1},{"body": "I wish more ladies had this outlook. I like this type and there aren't enough to go around. Alas, at least rum never turns me down.", "score": 1},{"body": "I just get blank screen. Maybe it's trying to pull down a 4.3gb image file haha", "score": 1},{"body": "Not just you. Maybe the post, but most likely Effin AB.  I can't even see it in safari. ", "score": 1},{"body": "Yup beek isn't right ", "score": 1},{"body": "I know. I'm Aussie too", "score": 1},{"body": "Looking at it made me make a satisfied \"ooooohhhh\" noise.", "score": 1},{"body": "Cocaine too?", "score": 1},{"body": "until you see him in the same pants for 3 months then it gets sad", "score": 1},{"body": "actually looks like you're a drunk or were drunk and rather drink then participate in the festivities. ", "score": 1},{"body": "Do you realize that you are weird as fuck man?", "score": 1},{"body": "Were the screws not made of titanium or another surgical metal?", "score": 1},{"body": "I like how the fat blonde has her elbow blocking the Vulcan blonde's arm.", "score": 1},{"body": "Wow. Such regret. Sorry you had kids.", "score": 1},{"body": "Now you know.", "score": 1},{"body": "I held it together until I saw the tear in the boy's eye. Now I'm sobbing like a baby. ", "score": 1},{"body": "Probably a bike path.", "score": 1},{"body": "i hope you savor your tea of lies! your brew of iniquity!", "score": 1},{"body": "She looks like she's about to cut this bitch up.", "score": 1},{"body": "Don't care where they are, who they work for, or what this pic is about.\n\nFour DAMN fine looking girls!\n\nEnd Quote.", "score": 1},{"body": "You have a look that says \"if that lands on me I swear to god, Becky\".", "score": 1},{"body": "#drunklife", "score": 1},{"body": "I'd hope you're static, you've got about 6\" of fender to tire gap :P", "score": 1},{"body": "I am you and you are me", "score": 1},{"body": "Fuck that man, I'm going to Cabo. ", "score": 1},{"body": "Good news /u/The_Pecking_Order...I finally like one of your posts.\n\nBut an upvote? I dunno man.", "score": 1},{"body": "I never get this. Is it funny to them because they think they are being obvious or they don't care? \n\nI am a fairly heavy pot smoker, but I would never walk around with pot leaves and \"letz blaz3 dawg\" tee shirts or something because that is asking to be looked at. Wtf?", "score": 1},{"body": "There are 3 resorts lol. ", "score": 1},{"body": "Future Darwin Award recipient. ", "score": 1},{"body": "Lol men, amirite? ", "score": 1},{"body": "I'd like to see the original without that photoshop filter.", "score": 1},{"body": "YEAAAAAHHH!! BLRGHBKRGHBLRG", "score": 1},{"body": "At my wedding we had only 40 guests. Most were military who all knew each other...other chunk were my college friends who all knew each other. Most were male..but I did include 3 of my old sorority sisters who promptly got shitfaced and hooked up with everyone. One of them (3 guys in a 3 day wknd..go Army) didnt wear underwear..danced looow....was genuinely a hot mess the entire wknd. At the end of the wedding said to me..fuck it...not like ill see any of these people again. Except Jen..ya kinda will. These are the only 40  people i care most about in the world and it's a small overlapping group. Her \"fuck it\" attitude was hilarious and awesome..but severely misguided. Jen rules. ", "score": 1},{"body": "https://www.youtube.com/watch?v=vlRFul216LM#t=1m30s", "score": 1},{"body": "Fun fact : in Australia we do not do this because we are not morons. ", "score": 1},{"body": "I work at a liquor store, my manager did this in a SUV with me standing there he says \"you need to clean this up\". I hate my job", "score": 1},{"body": "Everything is a warning in hospitals. It gets to a point where it would be easy to assume something is safe.", "score": 1},{"body": "She's the prettiest girl in the room,  Fuck does she care about a bunch of wilted flowers? ", "score": 1},{"body": "Heh.", "score": 1},{"body": "FTFY  http://i.imgur.com/ZMutOKX.png . ", "score": 1},{"body": "27% of people on Reddit are white american men under the age of 30.  It's good to get stories and experiences out of that demographic especially as all of those young men have to grow older at some point.", "score": 1},{"body": "McGraw?", "score": 1},{"body": "This looks like the C.W. Post mansion", "score": 1},{"body": "What's to explain? Youth = sexy. Is that not how it works in your country? Also, I don't know about you, but I don't know many juvenile maids.", "score": 1},{"body": "Where can I get one?", "score": 1},{"body": "I've tried the new ones. I have very large hands (I special order work gloves) and the grip just isn't right. And the external mag floorplate is one of the worst design ideas ever. It never fails to pinch my palm. I do it, then 6 months forget, try a Glock and do it again. My fault, but still annoying.\n\nI put Hogue finger-groove wrapaounds on my P226 (double stack) and it's just about perfect. A bit fatter wouldn't be unwelcome. I use the \"+2\" 20 round mags and my pinky fits perfectly on the extended plastic bit.", "score": 1},{"body": "http://i.dailymail.co.uk/i/pix/2012/05/12/article-2143372-130D8FA4000005DC-218_634x387.jpg", "score": 1},{"body": "Not quite yet. It was 2005, but it was a summer release. \n\nBut holy shit I'm getting old. ", "score": 1},{"body": "as in, she'd be running and jumping away so fast? yeah", "score": 1},{"body": "Taiwan isn't even a real country", "score": 1},{"body": "You're the most attractive person there.", "score": 1},{"body": "Now do me!", "score": 1},{"body": "The only sane woman in the group.", "score": 1},{"body": "Might be an age group thing. ", "score": 1},{"body": "No.", "score": 1},{"body": "Her only love is wine and she is fine with that", "score": 1},{"body": "No, I can read perfectly well. If open carrying makes someone look hyper-aggressive, then maybe drinking a beer makes me look like an alcoholic. Your concerns are founded, as there are plenty of people who are dipshits about open carrying, but open carrying is not wrong. ", "score": 1},{"body": "1.3 million just for a quench? No, either that number is made up or something else was irreparably damaged.  Or downtime is gonna cost you a million in lost revenue over a month or something. Quenches are like 40-80k for a 1.5T.", "score": 1},{"body": "Doesn't look misused to me", "score": 1},{"body": "But it's still home, for now.", "score": 1},{"body": "Good old main in cedar falls, uni student here", "score": 1},{"body": "I have seen this exact photo here on reddit like three times in the last six months", "score": 1},{"body": "I'm guessing signature room at the Hancock. \n\nhttp://www.signatureroom.com\n", "score": 1},{"body": "Nigs famous.  Well, I will be a monkey's uncle.", "score": 1},{"body": "Is this *really* the ending?\n", "score": 1},{"body": "That's very cool. Wish him our regards!", "score": 1},{"body": "You'd be surprised how all cheesy things appeal to you when you realize you could lose your life.  So I'm sorry if it seems cheesy but it makes me feel better and I wanted to share that ray of happiness with people.", "score": 1},{"body": "Get your logic out of here!", "score": 1},{"body": "He's certainly going to figure out some... things.. after studying Thai culture. ", "score": 1},{"body": "Not only would I be swigging my drink but I'd be walking away, but I'm a dude so maybe I'm lying because why would I try and catch a bouquet?", "score": 1},{"body": "San Diego? Oceanside?", "score": 1},{"body": "Hey, I have two ureters from my right kidney to my bladder; if it were possible to donate a ureter to your little green bean I totally would. ", "score": 1},{"body": "not sure if generally but I'm pretty sure it's a health violation for them to be in the store like any non-support animal.", "score": 1},{"body": "That's my soul mate. I did the exact same thing for the men's version of this. ", "score": 1},{"body": "A spider.", "score": 1},{"body": "Ah, here's the Frasier. ", "score": 1},{"body": "Hop on, we'll go grab some.", "score": 1},{"body": "Ah, Boring Oregon.", "score": 1},{"body": "Why does everything try to kill you in Australia?", "score": 1},{"body": "He was in a technical school for electronic and mechanical design. ", "score": 1},{"body": "Thanks! ", "score": 1},{"body": "I did that with my significant other....", "score": 1},{"body": "Didn't even need that second option to be honest", "score": 1},{"body": "Your Geordi talk is making me moist. ", "score": 1},{"body": "I appreciate your interpretation ", "score": 1},{"body": "He's not trying to kill, he's just hot like the rest of us", "score": 1},{"body": "oh beauty", "score": 1},{"body": "this picture fucking scares me. im 25 only getting older, and dating women my age is going to be a hassle in a couple years once those clocks start ticking and this is all they think about. i never want to get married let alone have kids. gives me the heebeejeebees ", "score": 1},{"body": "Kidney. ", "score": 1},{"body": "Proper visual definition of shit faced.", "score": 1},{"body": "Are you black or blond?", "score": 1},{"body": "hmm good question, when you peel the clear part off the leftover peel is quite slippery", "score": 1},{"body": "I can't tell if the look on her face is rage, or the look one gives to something they're about to fuck up. ", "score": 1},{"body": "Those paws....", "score": 1},{"body": "it really bothers me that \"it\" didn't get a solid spoonful, then doesn't even get any in \"its\" mouth.", "score": 1},{"body": "Are you at a wedding with Dee Reynolds? (Kaitlin olsen? )", "score": 1},{"body": "Yeah look like a halfassed coverup ", "score": 1},{"body": "Wow the looks on those faces.  You are *so* sane compared to your friends there.", "score": 1},{"body": "I want one...what is it???", "score": 1},{"body": "local breeders or shelters I'd say ", "score": 1},{"body": "Absolutely. I don't think it's worth criticizing the dad, especially at a time like this, but the community had a right to express what they want to see on the front page. There is nothing wrong with down voting this post, it doesn't make you a cruel person. ", "score": 1},{"body": "A watch. ", "score": 1},{"body": "As long as your mom isn't in the truck...sure.", "score": 1},{"body": "You can't reply to a comment like that and not give the guy gold.", "score": 1},{"body": "Nah, that's: ≈", "score": 1},{"body": "A pile of your own fecal matter.", "score": 1},{"body": "I tried out this line on my wife.  Came in handy.", "score": 1},{"body": "all i see is basic b...", "score": 1},{"body": "I wish that baby luck that his fatass father doesnt eat him", "score": 1},{"body": "&gt; Stupidity is a liability for public safety.\n\nYes, but intelligent cops are a liability for oligarchal safety.", "score": 1},{"body": "Was looking for men staring at asses, but them I found you!", "score": 1},{"body": "It's funny cause you're the most attractive girl in the picture.", "score": 1},{"body": "Link to [psbattles](http://www.reddit.com/r/photoshopbattles/comments/2rl7bv/_/) ", "score": 1},{"body": "Yes, this is exactly why I love Reddit as well.", "score": 1},{"body": "Same here but I had it covered up by a pro a few years back, can't believe I waited so long", "score": 1},{"body": "Disclamer: Do not try to [cage](http://wac.450f.edgecastcdn.net/80450F/thefw.com/files/2012/06/Nicolas-Cage-Cats.jpg) wild animals", "score": 1},{"body": "Thought those were headphones around his neck.", "score": 1},{"body": "Definitely should have kept it bro. ", "score": 1},{"body": "He said American hero, not Bostonian hero", "score": 1},{"body": "Dude, I'm sitting right next to an aloe plant right now. I cut one of the leaves. It doesn't smell. I licked it. I got sunburnt on my face last summer and rubbed plant jizz on it multiple times a day for a week. I swear, that plant doesn't smell. ", "score": 1},{"body": "Never understood the fish thing.", "score": 1},{"body": "Not a tree, actually a grass.", "score": 1},{"body": "I'm in a similar situation, although it's not cancer. I hope you can hang in there and find some people who don't need your constant happiness to be your friend. ", "score": 1},{"body": "The light from it would.", "score": 1},{"body": "You're awesome and you should feel awesome. Just remember, alcohol will always be there for you even when you don't want it. 🍷 🍻 🍺 🍶 🍹😜 ", "score": 1},{"body": "rekt", "score": 1},{"body": "way deep down south\n\nyo we play this game\n\nit's them c. robbins toys and\n\nyo we call it pooh train", "score": 1},{"body": "Gorton firsherman you say??", "score": 1},{"body": "I admit, I can't end it. I'm just too curious to see how far you will take this. It's quite obvious you are an obsessive control freak who can't stand when she can't get the last word. either that or you are in to scat. Sorry, doesn't do it for me. Although, if you keep crawling back to me, I may show some pity and shit on your chest if that's your thing.", "score": 1},{"body": "That's what she said!", "score": 1},{"body": "Obligatory \"That's what she said.\" -Michael Scott", "score": 1},{"body": "With a shit attitude like that, no wonder you're single.", "score": 1},{"body": "Is that a baby Karl Pilkington?", "score": 1},{"body": "Glorious", "score": 1},{"body": "100% confirmed. If I use Walgreens Aloe stuff.. I get itchy and crap. I grew up in Florida, where aloe plants are plentiful. I would simply rip off a small leaf, and peel it up like a bag of chips. Give it a little slip n slide on your leg or whatever. Boom.. feels great too. fuck those drinks with aloe though.. that she's the devil. worse than those bubble teas. ", "score": 1},{"body": "Not at all narcissistic. ", "score": 1},{"body": "I like my humor like I like my burn victims...dark", "score": 1},{"body": "My eye is twitching right now.", "score": 1},{"body": "In my sleepy droopy ways I read Australian murderer and got excited to see some son of Sam type YouTube video. \n\nI'm a chick, but I will use this pic as motivation to get my ass back into gear! ", "score": 1},{"body": "This reminded me of Robin from How i met your mother ", "score": 1},{"body": "Nobody has guessed it yet, but when I see the right answer, I will PM the user and ask for their shipping address, then ship it to them.", "score": 1},{"body": "Agreed, one is a wild animal, one is not. 50 years of breeding can't change that", "score": 1},{"body": "Trader Joe's man.", "score": 1},{"body": "Your face is glorious. \n\nEDIT: No seriously. It is. Thanks for the comment!", "score": 1},{"body": "It probably thought your face was a pile of doodoo.\n\nLike I did.\n\nDoodoo face.", "score": 1},{"body": "This is a community site, meaning that we, the users, decide what we want to see on the frontpage. Down voting a post doesn't make you a bad person, it just means you're putting in your vote to express what you want to see and what you don't care for. ", "score": 1},{"body": "Sure, I'll get right on that.", "score": 1},{"body": "I'll take 1 marijuana please.", "score": 1},{"body": "Mild at best, I asked about the strange patterns I was seeing when I looked directly into a light source but I didn't get much in response. I experienced 3 and 7T, so a magnitude greater is far beyond me. Sounds like vomit city to me.", "score": 1},{"body": "Or a branch stuck in dirt?", "score": 1},{"body": "Wow. You're talking some major shit", "score": 1},{"body": "You appear to be a keeper. I see 1 woman surrounded by a bunch of folks chasing a mainstream maybe", "score": 1},{"body": "The only reason I knew that is because of final fantasy XIV.", "score": 1},{"body": "there is a demon beast in your bed", "score": 1},{"body": "You clearly do not get that [reference](https://www.youtube.com/watch?v=_-agl0pOQfs).\n\nAnd you should provide a citation for your fantastic [copy/paste job](http://www.howmagnetswork.com/).", "score": 1},{"body": "Aaanndd if you ever want to sell, I too would buy it based on this wall. Probably. As long as you know it's a normal house and stuff. And in a good neighborhood. ", "score": 1},{"body": "It tends to completely bomb at every wedding I've been to. Australia.", "score": 1},{"body": "I'm pretty sure he took it off Facebook. Saw that exact title with that picture on Facebook earlier. ", "score": 1},{"body": "\"My sonion\" ", "score": 1},{"body": "The fuck dude? \n\nJust use a pad.", "score": 1},{"body": "Who the hell goes to a Fox sanctuary at 6 am. ", "score": 1},{"body": "They had to make it tiny to fit in between the parking lots. ", "score": 1},{"body": "&gt;_&lt; CHINESE TAIPAI!!!", "score": 1},{"body": "The middle lady is SO hot. ", "score": 1},{"body": "Mowie. ", "score": 1},{"body": "Good times apparently [**here**](http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/615/img/photos/2013/09/09/84/d3/manlove.jpg) too if you're so inclined. ", "score": 1},{"body": "This is me....", "score": 1},{"body": "Getting piss drunk - the meaning of life.", "score": 1},{"body": "What camera and lens set was this shot with?", "score": 1},{"body": "Sorry you have no idea what you're talking about, sorry you don't have children to understand.", "score": 1},{"body": "Arnold constantly complained about EVERYTHING. Wanda was in everybody's grill giving them all kinds of shit 24/7. I'd rather have been friends with Carlos. That shit was hilarious.", "score": 1},{"body": "you should solve the problem, and change the dog", "score": 1},{"body": "Fetish anyone?", "score": 1},{"body": "Bear mountain, my bad.", "score": 1},{"body": "I am going to go try it at my local hospital. That is not my home.", "score": 1},{"body": "Jelly. Hiked up one once...gorgeous", "score": 1},{"body": "What is that filter? The impressionistic part.", "score": 1},{"body": "Look at those two girls in the front trying to act like MJ.", "score": 1},{"body": "http://www.youtube.com/watch?v=6BBx8BwLhqg", "score": 1},{"body": "\"Fuck it, I'm a whore.\" FTFY", "score": 1},{"body": "I've seen grown women tackle 5 year old girls for the bouquet. It's terrifying.", "score": 1},{"body": "Your priorities were with that glass of wine.  ", "score": 1},{"body": "wow... that ball got a lot nicer than when you bought it", "score": 1},{"body": "Just when I'm trying to tell my gf what Reddit is...", "score": 1},{"body": "All in all, if a girl knows about *leaky penis* during the 'dating' stage and still decides to stick around, she's definitely a keeper. Good on you OP.", "score": 1},{"body": "Was Chairman Meow already taken?", "score": 1},{"body": "That is possible too. I just felt that it was a huge difference from weddings my parents took me to when I was a kid.", "score": 1},{"body": "I love wandering my hometown during a fresh snowfall. I only wish I had your eye so I could share it with the world! Great shots! ", "score": 1},{"body": "I love it. Carpenter: I hope you don't mind but I will put in in my book of cool things I could build for my clients. Thank you. If I ever get some one to build it I will send you a check. \n", "score": 1},{"body": "It's too fat to be a Blue Jay.", "score": 1},{"body": "Claudio Sanchez? Yes he does. ", "score": 1},{"body": "Oh I was joking. I figured you didn't want to give out your exact location", "score": 1},{"body": "why?", "score": 1},{"body": "You're a good man.", "score": 1},{"body": "Well, that's nice and all, but I'm pro-E", "score": 1},{"body": "Goddammit now I have a frozen fetish!  Way to go", "score": 1},{"body": "You guys must have some other strain of aloe plant. The ones I have don't smell or taste bad. In the summer when I inevitably get sun burnt I put that shit all over me like a plant bukkake without any foul odor whatsoever. ", "score": 1},{"body": "Same thing at the wedding I just attended with the corset toss. I had a glass of wine in one hand and a beer in the other.\n\nAin't nobody got time for that, Sorry", "score": 1},{"body": "Holy shit that's 10 years ago? And I've never even seen the thing.", "score": 1},{"body": "with the wife that gave him the diaper?", "score": 1},{"body": "Whats the number of the awesome chick not giving a shit. I want to marry her", "score": 1},{"body": "who's the girl drinking the wine/OP?", "score": 1},{"body": "It's vargas. There's literally nothing you could tag him as that would surprise me.", "score": 1},{"body": "Weed", "score": 1},{"body": "Not really SJWs. The lead ranger is the white ranger and he is a male and he is standing above the coloured rangers. ", "score": 1},{"body": "/r/confusedboners\n", "score": 1},{"body": "If it means anything, Kursk was one of the backbreaking victories on the front.", "score": 1},{"body": "She's almost hot in a big eyebrows/hairy butthole kinda way.", "score": 1},{"body": "I am married, so no. ", "score": 1},{"body": "well, he seems a little fruity then", "score": 1},{"body": "There's nothing wrong with posting it, and there's nothing wrong with casting your vote about the post, regardless of whether it's positive or negative. This is a community. We collectively decide on what is front page material. Down voting isn't a malicious thing, it's your contribution to what this site becomes. ", "score": 1},{"body": "Vargas is a reddit celeb, you'll do well to learn the username. ", "score": 1},{"body": "1 out of 2 redditors is a basement dwelling neckbeard.... I'm not... So therefore YOU ARE", "score": 1},{"body": "some reason all I can think of is inception. ", "score": 1},{"body": "Livin' that bachelor life.", "score": 1},{"body": "When the clock strikes twelve, they all blow up...", "score": 1},{"body": "Twist: someone threw a canister of ale in the air.", "score": 1},{"body": "My first thought was *why isn't this on ps battles?*", "score": 1},{"body": "If you make an album this should be the cover. Has to have rap music about hating married bitches and how awesome getting drunk and being single is.", "score": 1},{"body": "I'm not that guy, but I thought it was ok... Mostly a lot of killing. Nothing to write home about.", "score": 1},{"body": "Then you make a half-hearted grab for it as if you just have really slow reflexes, right?", "score": 1},{"body": "Your priorities seem to lie in being pretty good looking.", "score": 1},{"body": "John Mayer *would* say that...", "score": 1},{"body": "Welp, its just past midnight here [US-WI], so you might be right, OP. But there's a lot of day ahead of me to prove otherwise. ", "score": 1},{"body": "Anyone else see the impression of a hand going across the lady on the rights chest? weird.... eerie?", "score": 1},{"body": "Oh man.  I'd still like to get married someday, you know, in a happy way...", "score": 1},{"body": "Yes along with Alec Baldwin lol ", "score": 1},{"body": "Not if she is 57 years. ", "score": 1},{"body": "Hello Diego Jones the Fourth.", "score": 1},{"body": "DAE le vargas!?! xD!! \n\n(he's a famous reddit celebrity from /r/redditarmie btw!! only redditors will get these references! xd)", "score": 1},{"body": "Unions are like a democracy, majority wins. Unions don't push anything that a majority of its members don't want. Of course you can't please 100% of everyone all the time. But in a union you have a voice and you can use it.\n", "score": 1},{"body": "Whoaaa! Nice photo!", "score": 1},{"body": "This could be the movie poster for an upcoming Kristen Wiig chick-flick or something", "score": 1},{"body": "Of course", "score": 1},{"body": "ugh someone cover the whore up its fucking disgusting. wtf is wrong with wearing clothes like a civilized person? fucking savages", "score": 1},{"body": "Nobody asked you ya bish", "score": 1},{"body": "is the throwing of the bouquet of flowers symbolic for something?", "score": 1},{"body": "except your balls smell like piss", "score": 1},{"body": "Prove it", "score": 1},{"body": "If I ever get a 3D printer I'll add a temperature sensor and a red blinking warning light. Should be easy with Arduino. :D", "score": 1},{"body": "Most likely. I worked for a gas station at one point. One day we ran out of 87 octane. The manager's response? *shrug* \"Put signs on the pumps saying we're out of 87.\"\n\nNo fucks were given.", "score": 1},{"body": "zero fucks given\n", "score": 1},{"body": "Woohoo!!! So awesome! :D So many happy couples that finally have the right to be legally recognized &lt;3", "score": 1},{"body": "....Renee?", "score": 1},{"body": "This made me smile so hard", "score": 1},{"body": "This is the part I hate about reddit. Jesus Christ people, a halfway decent looking gal posts something mildly funny and everybody lines up to brown nose. This is what's the top post by a large margin?? ", "score": 1},{"body": "Did someone say [Hindenberg?](http://i.imgur.com/icLy9uj.jpg?1)\n\n(Perhaps too subtle?)", "score": 1},{"body": "You're too hot to be posting on reddit", "score": 1},{"body": "One kind of pure love - Baldrick and turnip. ", "score": 1},{"body": "i worked in a beverage mart in a new york college town for 3 years. can't tell you the number of times a had to \"strongly encourage\" that the frat boy i was assisting didnt want to place the keg on end after i had it securely in place.", "score": 1},{"body": "But is he actually homeless? He's got a shopping bag under his arm...? Maybe this is just the guy's style ", "score": 1},{"body": "Meh, you can never change the title after it's been posted. Lame, but sometimes typos will get you more attention. ", "score": 1},{"body": "One built, two projects currently under construction:\n\n[Heydar Aliyev Center] (http://garakami.com/wp-content/uploads/2013/07/1heydar1.jpg)\n\n[Saadiyat Performing Arts Center] ( http://www.designboom.com/wp-content/uploads/2007/01/performing-arts-centre-saadiyat-island-01.jpg)\n\n[Nuragic and Contemporary Art Museum] (http://static.blerds.atlantablackstar.com/wp-content/uploads/sites/2/2014/11/0012-1250_nurag_rend_0176.jpg)\n\nGet rekt archinoob.\n\n\n\n\n\n", "score": 1},{"body": "I just passed a field sobriety test. As in ten minutes ago. [X] quit drinking", "score": 1},{"body": "Don't you forget it bitches", "score": 1},{"body": "Robin Sparkles? ", "score": 1},{"body": "His tears break my heart :'(", "score": 1},{"body": "STORY TIME!!", "score": 1},{"body": "Tomorrow: that was my GF, then I die alone when she dumps me and I die alone. ", "score": 1},{"body": "I love you?", "score": 1},{"body": "Yeah! Bettendorf here.", "score": 1},{"body": "It's not that people want to steal his Internet points, it's that they are voting against seeing this kind of post. ", "score": 1},{"body": "I thought clan tartans were just something made up so americans would buy stuff.", "score": 1},{"body": "He can ride that noble steed into battle!", "score": 1},{"body": "&gt;There are so many myths about European heritage it's crazy.\n\nThat's why I'm glad I'm a North American. No misdirection in our history. Explorers came here and made friends with the natives. Squanto showed us how to grow corn so we had had thanksgiving and it all worked out great for everybody involved!\n\n**THE END!**", "score": 1},{"body": "This is the best thing I've seen all week.", "score": 1},{"body": "Thus ensuring the single status maintains even after the wedding.", "score": 1},{"body": "Nope. It's an onion, or so says the article. ", "score": 1},{"body": "Klingon bat'leth - Hawaiian version.", "score": 1},{"body": "The caption ruins it. Just let the image speak for itself, shit. ", "score": 1},{"body": "Wouldn't it make more sense to put the teeth on the other side.. so that the user grasps the weapon on the flat side", "score": 1},{"body": "My in-laws' in-laws own Vic's over in Waterloo.  I've enjoyed Cedar Falls every time I come to visit.", "score": 1},{"body": "Hahaha. My kind of woman", "score": 1},{"body": "I was worried", "score": 1},{"body": "This is what I came here to see. Now back to browsing.", "score": 1},{"body": "I need to do this with so many subs... I don't know why I can't bring myself to unsub from most of the defaults.", "score": 1},{"body": "That correct answer is actually the wrong answer. ", "score": 1},{"body": "Some variants of the aloe plant smell like onion, mine does and I got it from IKEA", "score": 1},{"body": "IPod classic", "score": 1},{"body": "God. Fucking. Dammit.\n\nEvery time.\n\n*-upvote-*", "score": 1},{"body": "&gt;and no one was none the wiser. \n\nThis part hurt my brain.\n", "score": 1},{"body": "So, im not sure if im mistaking, but...they have dicks, right?", "score": 1},{"body": "One ring to rule them all.  ", "score": 1},{"body": "hey no worries, if you aren't used to being burnt by satan's spicy sphincter, you don't really see aloe a lot.  I had a buddy text me a screenshot from Far Cry 3 because the plant is a crafting material in the game, asking how someone could use the leaves without any fruit present.", "score": 1},{"body": "Yeah, very fair call man. Between the choice of bushfires and wind chill, nobody is really winning right now.", "score": 1},{"body": "So 99% chance of nothing...", "score": 1},{"body": "Oakland county isn't listed in the top 100 richest counties in America as of the 2010 Census. It is listed as 61st in the 2000 census, but now doesn't even make the list.\n\nAnd having a rich area close to the shitty area isn't a way to say \"But we are nice too!\" and try and downplay the bad.  Maybe you are from Detroit/Michigan and think have streets abandoned in cities is some normal thing. It isn't. \n\nhttp://en.wikipedia.org/wiki/List_of_highest-income_counties_in_the_United_States\n\nEdit: and I realize Detroit does have some nice areas, but the bad areas are what people from the outside care about. Every city has nice areas, the nice areas in Detroit aren't good enough to outweigh the bad.", "score": 1},{"body": "Ahh, but don't forget the encabulating Frenzel fields. They can linger for quite a while...death by plangistation is no fun. The more you know!", "score": 1},{"body": "Holy Tina Fey look-a-like.", "score": 1},{"body": "ok.", "score": 1},{"body": "The girl looks like Amanda Peet. This looks like a movie scene. ", "score": 1},{"body": "To be fair it did turn off the power, and it said emergency stop or something, not coolant ejection if my memory serves. \n", "score": 1},{"body": "If he cut it... What would he cry for? ", "score": 1},{"body": "Blaaaarg", "score": 1},{"body": "Any limit to how many times we can guess?", "score": 1},{"body": "That is one good looking komrade!", "score": 1},{"body": "Fuckin a, man. That's quaint. ", "score": 1},{"body": "There's a difference?", "score": 1},{"body": "The magnets in MRIs are \"always on.\"", "score": 1},{"body": "Got your nose!", "score": 1},{"body": "[For the apparently 3 people like me that haven't watched HIMYM](http://images5.fanpop.com/image/photos/24600000/Robin-Scherbatsky-robin-scherbatsky-24645396-1707-2560.jpg)", "score": 1},{"body": "I stay I stay I clean I clean", "score": 1},{"body": "Hot girl, take my upvote.", "score": 1},{"body": "This happened to me here in Canada. ", "score": 1},{"body": "They are all men, I\nGuarantee it", "score": 1},{"body": "the cards against humanity bullshit?", "score": 1},{"body": "Not like a cited source anywhere, but I've been there when a female op replies to these kinds of comments on several occasions. I get annoyed with it cuz it's such a neck beard thing to say. \n\n\n\"Scuse me fair maiden, but do tell me how inundated your inbox gets from all the fellow gents around here\". \n\n\nI sometimes feel like they think this will somehow spark up a conversation with op and before you know it Amelie 2 is born. ", "score": 1},{"body": "BEES?", "score": 1},{"body": "You're an alcoholic. ", "score": 1},{"body": "IE? /facepalm", "score": 1},{"body": "Because comments like this are so much better! HAY TELL US IF YOU GOT DICK PICS HUR HUR.  I bet you the rate that this happens is less than the amount of comments stating that she's gonna regret revealing that it's an attractive female account. ", "score": 1},{"body": "Okay judge judy ;)", "score": 1},{"body": "It's like a little person!", "score": 1},{"body": "My McDonalds has a really cool guy who is awesome cuz he has the perfect drive thru voice. Sadly he works at mcdonalds...", "score": 1},{"body": "Not a dry eye in the house.", "score": 1},{"body": "/r/thingsforants", "score": 1},{"body": "I too hate the smell of Aloe Vera. ", "score": 1},{"body": "I've got a condition called \"shit mouth\".\n\nWhen I drink enough, all sorts of crazy shit comes out of my mouth, often resulting in it getting punched or slapped by someone else (sometimes strangers, sometimes cohorts).\n\nThat whole \"words can't hurt me\" thing... complete and total bullshit.\n\nMy diaper equivalent involves drinking alone.", "score": 1},{"body": "Can confirm, this man is British.  I saw him featured once on a science-y show about people who grow the worlds largest vegetables.  He holds several world records for root veggies and onions.  I've forgotten the show I saw it on, and, subsequently, his name.", "score": 1},{"body": "Nice :)", "score": 1},{"body": "Center-right cloud looks like a dead hamster ghost.\n\ncenter (most-right) looks like a dead sad moon crescent.\n\ncenter-left (sticking out of the huge thing on the left) looks like a rock with eyebrows, nose, pointed head, and a beard.\n\n Above that head figurine, looks like there's a hand casting magic to supernova a star.", "score": 1},{"body": "Context should not matter in a subreddit devoted to pictures ", "score": 1},{"body": "I'm waiting until this post is 24hours old...", "score": 1},{"body": "You're not even the only one who thought they'd be the only one. I thought I was crazy that Robin is the first one I thought of. Turns out I was wrong about that.", "score": 1},{"body": "I bought a few bottles of it once from a Asian old grocery store, I thought it was pretty good and sweet but still not sure of the healthiness of it, sugar content, etc", "score": 1},{"body": "Guess again asshole.  As I mentioned somewhere else in this thread I live minutes from the center of downtown in an area nice enough to go outside during the day but still close enough to hear car alarms screaming sirens and the occasional gun shot at night.\n\nBTW, Fuck Hockey.", "score": 1},{"body": "Yup. Gotta hate this town, can't find good bud for the life of me, but meth and pills flow like water. ", "score": 1},{"body": "/r/mildlyinfuriating/", "score": 1},{"body": "Wait, you're upset with her for leaving you the best part?", "score": 1},{"body": "A card. [Or...](http://i.imgur.com/DVDfO5V.gif) ", "score": 1},{"body": "Worlds *cutest* flowering tree.  ", "score": 1},{"body": "Too much cranberry in that Cosmo, if that's what it is. ", "score": 1},{"body": "https://en.wikipedia.org/wiki/Bile_bear", "score": 1},{"body": "You're actually the most attractive one... at least from that angle. I think you just realized you don't need to actually try like the other girls.", "score": 1},{"body": "Yeah, that wasn't planned. At all. \n\nSuper spur of the moment, candid shot, right?", "score": 1},{"body": "Zone 5B... I can't. It lasts a couple seasons and then just doesn't come back. ", "score": 1},{"body": "I was Carlos as a kid, 10/10, would be a kid again.", "score": 1},{"body": "How can one be man's best friend if there's no man?", "score": 1},{"body": "The aim is uncanny.", "score": 1},{"body": "the only thing worse than your irrelevant boring ass town is the shitty self-promoting watermark in the bottom corner. ", "score": 1},{"body": "What do you mean apparently not? It looks like the early start of a bonsai tree. By early I mean the first few years maybe, judging by it's size.", "score": 1},{"body": "What if the car was chained to the guardrail and we're looking at a bike accident?", "score": 1},{"body": "That is really neat, seriously usually I make a sarcastic remark but this is very pleasant.", "score": 1},{"body": "ha. ok.", "score": 1},{"body": "That is why \"bride or groom?\" is the universal wedding conversation starter.", "score": 1},{"body": "Straight at you my man", "score": 1},{"body": "pulses the water stream", "score": 1},{"body": "drinking - non-optional \n\nthe indignity of wearing a diaper to avoid pissing ones self while drinking - completely optional. ", "score": 1},{"body": "Oldboy. Jk lol", "score": 1},{"body": "Don't say \"ones.\" Just a tip.", "score": 1},{"body": "I give them two years before they start plotting to kill each other.", "score": 1},{"body": "This post will hit the front page of /r/pics, at the very least. I'm calling it.", "score": 1},{"body": "You need a man.", "score": 1},{"body": "Good peeps!", "score": 1},{"body": "Reactions to this post:\n\n1. Fuck marriage. Drink booze! And you are cool for it.\n\n2. I think this picture is funny.\n\n3. I think this picture is funny. And I want talk shit about your friends.\n\n2. You should be proud that I find you attractive. I have already ranked you and your friends based on fuckability and see no reason why I shouldn't let you know this as I assume it's a compliment.\n\n3. For some inexplicable reason I am *angry* that you think it is funny not to care about the bouquet and especially because you endeavored to show us. I will apply some kind of popular trope that I am already familiar with suggesting that everything you do is not authentic but actually a shallow cry for attention.\n\n4. Oh, I am so lonely.\n", "score": 1},{"body": "Indeed.  Fascinating photo.", "score": 1},{"body": "Only if you tell the joke again in the discussion thread.", "score": 1},{"body": "Who's your designated driver then?", "score": 1},{"body": "Just someone looking for attention. Like people who bring parrots with them to fast food stores.\n\n", "score": 1},{"body": "Bacon is morish the question with the answer being yes...yes I would like some bacon", "score": 1},{"body": "There's a gun in his hands,", "score": 1},{"body": "Good choice, those three sausages squeezed into black tubes will fight to the death for that bouquet.", "score": 1},{"body": "Yes, you're hot. ", "score": 1},{"body": "I thought you said pooping a blood vessel and got scared wondering if that's something that could happen to me...", "score": 1},{"body": "Her mum thinks she's special. FTFY", "score": 1},{"body": "Sorry to disappoint her...", "score": 1},{"body": "don't. it's horrible and slimy. ", "score": 1},{"body": "&gt; can complain to common friends if you give them an STD.\n\nunless you give them the incurable kind...", "score": 1},{"body": "That looks like a twig someone stuck in a pot of dirt. \n\nIs it really a root growing tree?", "score": 1},{"body": "OP, your girlfriend was wrong, bitch!", "score": 1},{"body": "It's odd how the logical solution involves time travel. ", "score": 1},{"body": "Oh boy, thanks for the link kind stranger. ", "score": 1},{"body": "Seriously. That and the potential for fMRIs to make tattoos tingle(/burn?)... \n\nApparently an x-ray would show if I was clear to go in there or not, but doctors only want to x-ray people for \"medically necessary\" reasons. Guess potentially having ice skate dust in my eyeballs doesn't qualify. ", "score": 1},{"body": "Be careful, I am bite-man", "score": 1},{"body": "implicit genetically enforced contract to avoid having kids if at all humanly possible.", "score": 1},{"body": "If that dog takes off that kids gonna be rattling like cans behind the car of a \"just married\" couple", "score": 1},{"body": "OP is 1. She needs to quit drinking and find a man.", "score": 1},{"body": "\"No Henry but don't you see the pen! The pen is mightier than the sword!\"", "score": 1},{"body": "That they did the math sub. ", "score": 1},{"body": "People who don't give a fuck are *edgy*! And the ironic thing is that most people almost *always* give a fuck, particularly whenever they say shit like, 'i have no fucks to give' or 'my fucks, i have none left.'\n\nThose are the people who freak out first all of the time, proving almost across the board that they give just as many (or more) fucks as anyone else in the world.", "score": 1},{"body": "As long as your home isn't in immediate harm from a fire. Extreme cold is hard to explain to those that have never experienced it. You go from comfortable to hating air itself in about 5 paces.", "score": 1},{"body": "Chinese kayne", "score": 1},{"body": "I feel like you should get points because it's your Cakeday, but this submission is getting a bunch of downvotes, probably because it doesn't really make sense. So I went and upvoted some of your other posts instead. Happy Cakeday!", "score": 1},{"body": "And now you have a [psBattle](https://www.reddit.com/r/photoshopbattles/comments/2rl7bv/psbattle_woman_who_has_a_totally_different/)!", "score": 1},{"body": "Wow. Thanks for introducing me to my new favorite subreddit.  I was just about to replace the ferrocore in my old VX-5 Compact, but I found a thread on how to re-calibrate them yourself with only two radial field loops.", "score": 1},{"body": "I disagree 100%.", "score": 1},{"body": "\"scissor me zerksis!\"", "score": 1},{"body": "three-or-more-some.", "score": 1},{"body": "I was playing Ping Pong in Ding Dang...", "score": 1},{"body": "What kind of equipment are you on, DC-8? ", "score": 1},{"body": "So make yourself remembered! Don't live to a quote, make a quote! ", "score": 1},{"body": "Not sure if 'Swag' or 'Garbage Bag'. \n\nEdit : It's ... *Garbage Swag*.", "score": 1},{"body": "Well thank god time travel isn't a thing (or at least I don't know about it yet) cause this was 3 days ago haha ", "score": 1},{"body": "This makes me smile", "score": 1},{"body": "Well shit", "score": 1},{"body": "TO TAIWAN!!", "score": 1},{"body": "1/3 of one.  Bring 2 friends.", "score": 1},{"body": "That's the idea.", "score": 1},{"body": "I think either cherry or quince.", "score": 1},{"body": "And probably smells like it too!", "score": 1},{"body": "&gt; directly correlates\n\nWouldn't it, and I'm drunk here, be inversely correlates?\n\nLike, the drunker you get, the slower your reaction speed is, right? So that's inversely related. I don't know, could be wrong. Don't care enough to google.", "score": 1},{"body": "https://www.youtube.com/watch?v=X__KQFofTUk", "score": 1},{"body": "Excuse me, sir, can you tell me where I might find Platform 9 3/4?", "score": 1},{"body": "\"wife\"... that's latin for \"designated driver\", right?", "score": 1},{"body": "Is this a wedding or a funeral?? Why is everyone in black??", "score": 1},{"body": "I forgot what I was going to order. ", "score": 1},{"body": "In the thumbnail, I thought the dog was a horse.", "score": 1},{"body": "My uncle used to work around these things.  He gets a call from his coworker one night, the coworker is stuck to the wall in the room behind the MRI machine.  Apparently the exit opposite the MRI was locked and this guy thought he could sneak a desktop tower past the area to the other exit if he placed his body between the tower and the MRI wall.  By the time my uncle got there the guy had managed to free himself, sans shirt, and to free the tower they used a series of ratchet straps that slowly pulled the tower away from the wall.  He said for a while there the tower was just floating in air.    ", "score": 1},{"body": "I realized it might have been taken days ago as I was posting my last comment. Sometimes I'm retarded", "score": 1},{"body": "Bonsai isn't a species of tree. It's just a word that applies to plants (not always trees) that are trimmed a certain way make them look mature yet be small.", "score": 1},{"body": "lmao ", "score": 1},{"body": "Nature's jello.", "score": 1},{"body": "[Unless...](http://media1.giphy.com/media/fW2C8tqGLg7UA/200.gif)", "score": 1},{"body": "Wasn't one of the more important parts of communism in Stalin's Russia to get rid of religion? Or was that Marxism?", "score": 1},{"body": "Such a touching photo considering the situation.", "score": 1},{"body": "Dayum. Awesome. I found my project for the next couple weeks.", "score": 1},{"body": "Delightfully geeky, I approve.", "score": 1},{"body": "In cop circles, this t-shirt is what they call \"probable cause\".", "score": 1},{"body": "You look similar to Lily Alridge (spelling?) in this picture! ", "score": 1},{"body": "no reason one can't wash/rinse off a little in a the big stall.", "score": 1},{"body": "Nice to see my clan propping it all up again :P", "score": 1},{"body": "An arrangement of protons, neutrons, and electrons.", "score": 1},{"body": "Inbox targeted.\n\nEmails written.\n\nATTACK!!!!!!", "score": 1},{"body": "Beads?", "score": 1},{"body": "It's a specific style of bonsai known as 'mame' which are meant to be kept this small.", "score": 1},{"body": "A 3ds?", "score": 1},{"body": "\"Hot girl posting = upvote no matter what.\"\n\n*-Every Neckbeard Redditor ever*", "score": 1},{"body": "Apparently, the plan at my wedding is a big-ass bouquet of raw, jagged quartz crystals, so if it gets tossed, you better believe someone REAL dedicated is going for the dive", "score": 1},{"body": "Honestly I am in a good relationship and that would still be my reaction", "score": 1},{"body": "OP, I think I love you.", "score": 1},{"body": "They didn't", "score": 1},{"body": "Am I the only one who thinks she looks oddly like Cobie Smulders?\n\nhttp://www.himym-fans.de/tl_files/images/content/promos/How-I-Met-Your-Mother-Season-6-Cast-Promotional-Photos-how-i-met-your-mother-15957291-1920-2560.jpg", "score": 1},{"body": "Robin Scherbatsky?", "score": 1},{"body": "I get MRIs every 6-12 months for MS. One time the tech told me she had a man who worked in a machine shop get a piece of metal ripped out of his shoulder. Apparently he didn't even know it was there and pop! Out it came. Pretty sure she said it wasn't a big deal and he finished with the MRI.", "score": 1},{"body": "Should've thought of that before getting arrested for selling meth", "score": 1},{"body": "Ah! the old [empty pool-eroo!](http://www.reddit.com/r/explainlikeimfive/comments/2rkv03/eli5_if_we_are_innocent_until_proven_guilty_then/cnh1mp4)", "score": 1},{"body": "[Gwyneth Paltrow?](http://www.florenz.co.uk/wp-content/uploads/2012/08/funny-brad-pitt-seven-box-scene.jpg)\n\n", "score": 1},{"body": "That stare, right in the feels *_*", "score": 1},{"body": "I'm throwing a Derelicte themed show on the 30th. ", "score": 1},{"body": "Fedora has officially been tipped, like so. ", "score": 1},{"body": "Agree.  I'm getting married this year, and I'm not doing the bouquet toss.  Hell no.", "score": 1},{"body": "Its too late, I've already seen everything. ", "score": 1},{"body": "Nice use of the interrobang", "score": 1},{"body": "So there *is* hope for me...", "score": 1},{"body": "Man, we're digging old shit up to repost now. Pretty soon we'll all be asking if we can haz cheezburger again.", "score": 1},{"body": "Vital Information for your everyday life.", "score": 1},{"body": "Kind of like reddit then. ", "score": 1},{"body": "Truth.", "score": 1},{"body": "That's why we all have a vote. No arguing needed. ", "score": 1},{"body": "Nothing a few diuretics and some beta blockers won't fix.", "score": 1},{"body": "I feel like someone put it in there and then slammed the hatch shut.", "score": 1},{"body": "/r/nottheonion", "score": 1},{"body": "I was looking at my hat stand thinking, \"I should buy a tree.\"", "score": 1},{"body": "You look like Robin from How I Met Your Mother...", "score": 1},{"body": "Kohl Mansion San Francisco area?", "score": 1},{"body": "Plot Twist: Its your Dad!", "score": 1},{"body": "Any one marry me I am still single.......", "score": 1},{"body": "Is it your dog? Or at least a dog you know? Why would it bit you?", "score": 1},{"body": "I'd watch this movie.", "score": 1},{"body": "https://www.youtube.com/watch?v=rfxlmC3Rojg", "score": 1},{"body": "1) maybe women would find football more interesting if it was played with a bouquet instead of a ball. Look at that concentration \n\n2) who throws a bouquet at a funeral?\n\nThat's it I'm out", "score": 1},{"body": "No tail markings, no crest... looks like a J that's blue more than it looks like a blue jay.", "score": 1},{"body": "Crush those drinks and see their bottles driven before you.", "score": 1},{"body": "I'm assuming the \"2 people\" are the pizza maker and the delivery guy?\nBecause...\npizza. ", "score": 1},{"body": "What's in the cup?", "score": 1},{"body": "Dorothy Anne - Insecure about her intelligence. She loses her books in one episode and goes nuts.\n\nPhoebe - Can't let go of the past. *Your new school has magic and shit, girl.*\n\nArnold - The complaining. *The constant complaining.*\n\nWanda - Pushy and in your face.\n\nKeesha - Ambitious.\n\nTim - Wicked smaht.\n\nRalphie - Cool, laid back.\n\nCarlos - Cool, funny.\n\nI know who I'd go on Rad-As-Fuck Magic Science Adventures with.", "score": 1},{"body": "And now you're here.  You've come a long way, buddy.  ", "score": 1},{"body": "This guy totally owns it, I hope he makes a ton of money from this meme.", "score": 1},{"body": "Thats exactly what I took that as. Shit may not be staged, but she's faking this aloof bullshit for the camera. Clearly she's better than all this wedding nonsense. ", "score": 1},{"body": "Ya that has to be Memphis TN badass building ", "score": 1},{"body": "Look at what you have started. It's gold. Funniest thing I have seen in a while. ", "score": 1},{"body": "This is a little unbearable.", "score": 1},{"body": "100% if you're into Anal.", "score": 1},{"body": "Yup. That one with Adam Sandler and Don Cheadle. ", "score": 1},{"body": "I'm from Arkansas too, and it seems like nearly every animal sanctuary/drive-thru has a bunch of kangaroos in my area.", "score": 1},{"body": "Right? This shit is fucking lame. Gilded twice??! Over 6000 upvotes? Jesus Christ reddit. ", "score": 1},{"body": "I would certainly disagree with you about it being a \"boring ass town.\" There's a lot going on here and even as a veteran world traveler, I still find a lot of pleasure coming home. As for my \"shitty self promoting watermark,\" it's the only tiny thing I can do as a professional photographer to have my work traced back to me. Yes, it can be obnoxious, but it's the one small thing we can do in the digital era to have a trail back to the author. I apologize if seeing it in the lower right corner was inconvenient to you.  ", "score": 1},{"body": "Girlfriend was wrong. shes stupid your stupid this post is stupid. idiot", "score": 1},{"body": "Attended any weddings in the NYC tri-state area?", "score": 1},{"body": "I mostly posted it as a joke... But it is true:\n\n[Fedor Bleov recalls people eating dogs in Ukraine and Caucusas under Stalin.](http://www.dailymail.co.uk/news/article-1038774/Holocaust-hunger-The-truth-Stalins-Great-Famine.html)\n\n[More of the same from many, many witnesses of Holodomor.](http://www.holodomorct.org/accounts.html)\n\n[Irena Grudzińska-Gross mentions eating dogs multiple times while under the Soviet regime of WWII in her memoir.](https://books.google.com/books?id=Gn9gcaNE09sC&amp;pg=PA48&amp;lpg=PA48&amp;dq=soviets+ate+dogs&amp;source=bl&amp;ots=x4HWCQvP88&amp;sig=4DmFUt1W7hYarylE0bk2CFh3LRs&amp;hl=en&amp;sa=X&amp;ei=PdCsVLfWO862oQSi04CYBw&amp;ved=0CD4Q6AEwBA#v=onepage&amp;q=soviets%20ate%20dogs&amp;f=false)\n\nOkay... Okay... Maybe you're still convinced that they didn't eat dogs after all those separate accounts and evidence. I mean, how beneath Soviet Communism when they could just as easily [eat each other!](https://suite.io/kerry-kubilius/ez6270) Now with pictures!\n\n[1 - During the famine of 1921.](http://i.imgur.com/lNywGd9.jpg)\n\n[2 - During the Winter War in March of 1942.](http://upload.wikimedia.org/wikipedia/commons/3/34/Russian_Ribs_-_Winter_War.jpg)\n\n[3 - During the Continuation War of December, 1942.](http://sa-kuva.fi/static/19/95/21995_r500.jpg)", "score": 1},{"body": "Welcome to the nether ", "score": 1},{"body": "I'm still confused, what did he say? ", "score": 1},{"body": "http://i.imgur.com/TM9PT.jpg", "score": 1},{"body": "It's part of the screening process before going into the MRI. Past surgeries and implants are taken into account to determine if you have any devices that would be unsafe to enter the magnetic field (e.g., pacemakers, pain pumps, insulin pumps).  Any type of metallic implants like screws are made of titanium (as cykloid said) which is safe to enter the magnetic field.", "score": 1},{"body": "Based on your lack of knowledge about CO2, it's clear that your \"service\" was not something that required intellectual ability.  Sure hope you got some college benefits out of it!", "score": 1},{"body": "Funny :D", "score": 1},{"body": "marry me. we have a lot in common.", "score": 1},{"body": "Are they catching ashes at a funeral?", "score": 1},{"body": "yup", "score": 1},{"body": "I used a Canon 5D MKIII and the new Sigma 50mm 1.4 Art (which I love enough to have sold my Canon 1.2L) and a Canon 24mm F1.4L", "score": 1},{"body": "It's a finite resource right? Get it as a by product of oil extraction?", "score": 1},{"body": "It's either a watch or rubix cube", "score": 1},{"body": "Perhaps a different [natural disaster?](http://i.imgur.com/CUKOKZA.jpg)\n\n(not my best work, but I've been imbibing like my liquor cabinet is that oft-mentioned open bar at the reception...)", "score": 1},{"body": "Theres...a difference?", "score": 1},{"body": "Came here to ask the same thing. I'd like to see a demo for DIYers to do this without the supports under them.", "score": 1},{"body": "I know, at least five miles.", "score": 1},{"body": "Looks like Ajay Ghale", "score": 1},{"body": "We all can't be winners. That's why there is reddit. ", "score": 1},{"body": "This is why you married her right? Lucky man ", "score": 1},{"body": "#REKT\n\n\n[#SPOOKYSKEELINTON](http://i.imgur.com/CAbEwru.webm)", "score": 1},{"body": "Thank you for a much-needed chuckle.", "score": 1},{"body": "Your face just looks like,  \"Everyone wants to get married, I'm just going to get drunk and try and forget everything going on around me.\"", "score": 1},{"body": "[X] Quit driving\n\n[  ] Quit drinking", "score": 1},{"body": "Probably marry you based on the lack of fucks you have to give.", "score": 1},{"body": "You should see how wine stained my lips are. It is a god damn miracle. ", "score": 1},{"body": "Stalinism was more a movement for soviet socialist patriotism, rather than eliminating religion in the region. So basically, at the time, it was supposed to be a 'all for one and one for all' sort of thing, if you understand (sorry if that was a poor way of explaining it). The current leaders, or leader was religious, hence were the rest of society. Religion has always been the absolute backbone of Russian culture throughout history. ", "score": 1},{"body": "You're a faggot.", "score": 1},{"body": "You can also drive 10 hours from Detroit and still be in Michigan. ", "score": 1},{"body": "So if you were on time, you'd have been inside your office by then... I'd say being late almost killed you.", "score": 1},{"body": "Where is that? Super cool looking place for a wedding.", "score": 1},{"body": "How long did it take to assemble?", "score": 1},{"body": "You're the girl who's always cold, aren't you?", "score": 1},{"body": "Do you know when they started making them out of titanium? The screws have been in for over 20 years. ", "score": 1},{"body": "You go girl! You don't need no man, or no social norms either.", "score": 1},{"body": "I wholeheartedly agree", "score": 1},{"body": "Nah it's just his head. It's Agnew's back.", "score": 1},{"body": "After I found out about /r/elsanna this is much dirtier sounding", "score": 1},{"body": "That's allot of shallot! ", "score": 1},{"body": "I'll take your word for it. Now *down*voting, on the other hand, seems to work just fine.", "score": 1},{"body": "But it's a high quality photo and a lot of people can relate to at least one of the people in it!", "score": 1},{"body": "Just send a picture with a cock ring on proposing to her and you cover both bases.", "score": 1},{"body": "aah. I guess I was thinking of it in the opposite way - tattoos fade and blur, I've got one of my own that's in need of some touching up, but sharp crisp lines are easier to see blur in. I was figuring that because the watercolor tattoos are meant to look \"blurred\" and smudged/watercolory that the natural fading would just look to be a part of the tattoo.\n\nThey're such a new type of tattoo, so it's hard to say because none are very old yet. I'm interested to see what happens.", "score": 1},{"body": "That's not your son. Thats a dog.", "score": 1},{"body": "redditors: A bunch of unctuous, lonely, desperate people with horrible taste. \n\nThat's exactly what this place has become.", "score": 1},{"body": "Im sure you guys will have some killer games of Magic: The Gathering down there.", "score": 1},{"body": "the irony is, that is a totally marryable attitude.  \"fuck this bouquet shit.\"", "score": 1},{"body": "Pizza, I didn't see any pizza...", "score": 1},{"body": "At least the beer tank is safe!", "score": 1},{"body": "So yeah ive heard about busted sphincter but what the fuck happens then.  Its not like they can repair it fully due to scar tissue forming.  So do patients just get a leaky butt syndrome?  Is that why \"the monkey butt powder\" exists?", "score": 1},{"body": "Let me guess, they thinks it's super funny because you have no arms right?", "score": 1},{"body": "Man, so angry. I upvoted because the picture quality was great, and I think everyone can relate to at least one person in it.", "score": 1},{"body": "/r/gainit", "score": 1},{"body": "How I Met Your Mother references for 300", "score": 1},{"body": "That's what I was thinking", "score": 1},{"body": "Who the fuck makes their bridesmaids wear black? Isn't that the single color that is outlawed for women in the wedding party as it carries the symbolism of death?", "score": 1},{"body": "That's me rather my date is with me or not :)", "score": 1},{"body": "There goes his Christmas bonus ", "score": 1},{"body": "That wood paneling. ", "score": 1},{"body": "I know I'm late to the thread but this site has a hilarious collection of gifs that I enjoy more as more of my friends get married.... http://myfriendsaremarried.tumblr.com", "score": 1},{"body": "Did you actually photoshop that yourself? That actually not bad.", "score": 1},{"body": "Nice looking 4runner in the background ", "score": 1},{"body": "[http://thebodypacifist.files.wordpress.com/2013/04/you-are-bad-and-you-should-feel-bad2.jpg](http://thebodypacifist.files.wordpress.com/2013/04/you-are-bad-and-you-should-feel-bad2.jpg)", "score": 1},{"body": "Right?! That's mostly why I upvoted. Gorgeous picture.", "score": 1},{"body": "Looks like Bob Kelso has a beard now.", "score": 1},{"body": "I thought I was clever...", "score": 1},{"body": "Is this at Devon Prep?", "score": 1},{"body": "At least on reddit I'm a winner. Yay reddit!", "score": 1},{"body": "When a homeless guy has better fashion sense than you. ", "score": 1},{"body": "5th cousins you say?\nCount me in. ;)", "score": 1},{"body": "My friends have used the term, \"FloriDad' to describe young males who are fathers but still try to dress like white hip hop dudes. ", "score": 1},{"body": "I work in the mall where this original sign was posted. Northgate mall, Cincinnati. Nothing but horror stories from this location. Many disgruntled employees (rightfully so) have stated terrible treatment from this company. I hope they all find jobs that suit them but I'm glad this company is closing.\n\nhttp://slog.thestranger.com/slog/archives/2015/01/05/northgate-mall-wet-seal-employees-slam-company-with-sign-in-store-window", "score": 1},{"body": "Mmm...disinterest is so attractive.  I don't even have a dick and I want to send you a picture of one.  ", "score": 1},{"body": "That guy is gonna be walking on egg shells.", "score": 1},{"body": "Mmm...disinterest is so attractive.  I don't even have a dick and I want to send you a picture of one.  ", "score": 1},{"body": "I'm leaving for Taiwan in 9 days for 14 days. I haven't been this excited in years. Yay!", "score": 1},{"body": "Same, really.", "score": 1},{"body": "Good point.", "score": 1},{"body": "This is a man that's serious about his cherries.", "score": 1},{"body": "Before my fiance and I were engaged, we went to my cousins wedding..had been together 4 years at this point I'm dying to get married... anyways, I get dragged out for the bouquet toss and nearly caught it except a stupid 6 year old jumped in front of my hand. I had to restrain myself from punching her in the throat. Oh well, we are getting married in May anyways. ", "score": 1},{"body": "Jesus Christ, I realize they have some long legs but those are proportionally really fucking longer than I thought they would be.", "score": 1},{"body": "Eating, apparently.", "score": 1},{"body": "Do me!", "score": 1},{"body": "It almost certainly the opposite since it's unlikely that someone could provide the type of lifestyle a kangaroo would need in Arkansas. Exhibit A: Taking it to Walgreens like it's a dog.", "score": 1},{"body": "Destiny", "score": 1},{"body": "The chin scratch: the next evolution of awkward dancing. It comes as an evolution of the dice roll", "score": 1},{"body": "Omg where can I get one!? ", "score": 1},{"body": "A cat? Rare on reddit.", "score": 1},{"body": "I live in Australia and I've never seen a man chasing a kangaroo down a highway. Although I have met people who have them as pets, and an old mate of mine had a lil joey that was chilled out.", "score": 1},{"body": "it's not just you, im just as confused by that comment as you are ", "score": 1},{"body": "The one with the black dress on the right seems to have some sort of demonic hand trying to reach out of her chest.", "score": 1},{"body": "Worse than that? When the bride and/or groom's families have a handful of recovering alcoholics in their midst that you feel ashamed drinking in front of.  It's such a kill joy!", "score": 1},{"body": "http://imgur.com/TVbnu3M.jpg", "score": 1},{"body": "I've seen this place before...", "score": 1},{"body": "Do you realize that you needlessly point out he obvious?", "score": 1},{"body": "MAGNETIC resonance imaging device \n\n[keyword:  magnetic]", "score": 1},{"body": "This upvote is for your girlfriend.  \n\nCan I have her number?", "score": 1},{"body": "FUCK!!!", "score": 1},{"body": "[Glad you could share that experience](http://thats-normal.com/wp-content/uploads/2013/08/cameron-thats-messed-up-modern-family.gif)", "score": 1},{"body": "Serious question - isn't this designed so that the shark teeth are facing back towards the wilder i.e. you impact with the large curved bit.\n\nIf that's so aren't the shark teeth almost decorative?\n\nif the teeth side was the impact side you'd put teeth along the whole edge and that side would be thickest, wouldn't it?\n", "score": 1},{"body": "Is that Sweet Dee next to her???", "score": 1},{"body": "Found it- it was Lenin's philosophy.  \n\"Lenin wrote; “Marx said, ‘Religion is the opium of the people’ – and this postulate is the corner stone of the whole philosophy of Marxism with regard to religion. Marxism always regarded all modern religions and churches, and every kind of religious organisation as instruments of that bourgeois reaction whose aim is to defend exploitation, stupefying the working class.” (The Attitude of the Workers’ Party towards religion, May, 1909)\"  \n[Source](http://www.marxist.com/religion-soviet-union170406.htm)", "score": 1},{"body": "As a laymen, How can you tell a baby Kangaroo from a Wallaby? Especially when you can only see half of it.\n\nWhen I visited Australia, baby kangaroos and wallabies looked pretty similar. But I'm sure there are ways to tell them apart.", "score": 1},{"body": "That's a Joey you casual. ", "score": 1},{"body": "Is it weird that this story makes me believe in love?", "score": 1},{"body": "why would i want a burrito out of a vending machine? \n\nthat's a guarantee of not fresh processed food ingredients.", "score": 1},{"body": "They're breakdance fighting!", "score": 1},{"body": "She should have walked another 50 meters down the pathway, it looks like the shadow starts to perfectly line up with the dotted line a little further up", "score": 1},{"body": "I wouldn't be in a hurry to get married either if I looked better than all my friends. ", "score": 1},{"body": "Couldnt you guys just use a comealong? ", "score": 1},{"body": "And the write, \"based on lore by J R R Tolkien on it\"... As a joke of course", "score": 1},{"body": "Nsfw?? Much confusion.", "score": 1},{"body": "1 upvote ain't enough ", "score": 1},{"body": "No! Death to genocide!", "score": 1},{"body": "Your friends are acting very lady for a bouquet toss too.", "score": 1},{"body": "Looks like the chinese Watch Dogs version to me!", "score": 1},{"body": "My guess is for printer paper.  I could use some of that.", "score": 1},{"body": "BRAVO! ", "score": 1},{"body": "So we were on our way home from a family fun night out bowling, and we stop at Brusters to get some ice cream before heading home. The kids get what they want and he gets his standard vanilla pint with an insane amount of cherries. I wasn't feeling like ice cream and I opted out. He kept asking if I was sure I didn't want anything and I answered no at least 4 or 5 times. We get home, the kids enjoy their snack and soon goes off to bed. The hubby hadn't slept much the night before and fell asleep shortly after we got home. Me being a third shifter, stayed up and played some COD and started prowling for a snack around midnight. So, I shamefully opened my husbands untouched pint of beautiful  ice cream and ate every single delicious cherry. Then put back on the lid, placed the container back into the freezer and went to bed. The reason for the meme bombing? I'm not sorry I ate them. I will not apologize, because they were delicious!!  ", "score": 1},{"body": "She enjoys the attention.", "score": 1},{"body": "Well that's obscure.", "score": 1},{"body": "&gt; Don't get one, my ex had one and it led to me chasing a kangaroo down a 4 lane highway through traffic at 3 in the morning on New Years.\n\nWhat kind of fucking idiot would allow a kangaroo to get out anywhere *near* a 4-lane highway? That is the point where you say, 'Get your own fucking Kangaroo, you twat. It's your fault the motherfucker is out running around in traffic.'\n\nSorry. It just takes a special kind of asshole to \n\n1. Take a kangaroo out of its natural habitat thinking they can domesticate it.\n\n2. Let the fucking thing get loose\n\n3. Let the fucking thing get loose near a fucking higway\n\n4. Think that they can keep a kangaroo knowing how big it will eventually get.\n\nIdiocy.", "score": 1},{"body": "Are you over +60 years?", "score": 1},{"body": "Is your name Cheryl or Carol? ", "score": 1},{"body": "I need to go rethink my life...", "score": 1},{"body": "[it's new](http://31.media.tumblr.com/0aaf37120460a7b12d34bca2ac2780f5/tumblr_merswijgT81rrr2r7o1_500.gif)", "score": 1},{"body": "Now that your rose is in bloom, a light hits the gloom on the gray...", "score": 1},{"body": "wtf, your gf is a fucking idiot", "score": 1},{"body": "Ha, you are on fire tonight", "score": 1},{"body": "What's great is I recently saw her in Murder, She Wrote from the 80s and she was the same exact character then as well.", "score": 1},{"body": "A cell phone", "score": 1},{"body": "What member number? I believe my gramps was #80-something.\n\nGot the key at my Mom's for safekeeping though, so no pic; sorry :(", "score": 1},{"body": "It's not, though. Last time it was reposted it was determined it was just the world's branchiest branch cut off and put in a pot. I don't blame you for being mistaken, it's hard to remember a month ago. ", "score": 1},{"body": "And you're cute. Good genes and good gift grandpa. ", "score": 1},{"body": "My guess is that hopopo is working at a somewhat expensive wedding industry place or something, so they have older clients and thus there are fewer single women among their friends.", "score": 1},{"body": "I don't even know who I care about.... I didn't think this through.\nSo I guess I really only care about the pizza, then.", "score": 1},{"body": "Gordon Freeman was a character from Half-Life. I think you mean Martin Freeman. ", "score": 1},{"body": "Jesse eisenburg", "score": 1},{"body": "Is that Kool-Aid too?", "score": 1},{"body": "I was at a McDonald's in Japan recently. There were some very pretty women behind the counters. Same goes for Korea, Taiwan and Hong Kong. ", "score": 1},{"body": "Yeah I know, just unsure. Although whole it's a running joke, I think some people do get them legitimately confused.", "score": 1},{"body": "/r/facebook ", "score": 1},{"body": "Nice try Australia, we won't be tricked into being spider-fodder in lieu of your population &gt;:(", "score": 1},{"body": "Don't drink and drive dude.", "score": 1},{"body": "Who's there", "score": 1},{"body": "That looks like the most awesome thriftshop in the world. The ones around here is so useless, just dead peoples old crap.", "score": 1},{"body": "[a DvD copy of \"He Got Game\"](http://31.media.tumblr.com/0aaf37120460a7b12d34bca2ac2780f5/tumblr_merswijgT81rrr2r7o1_500.gif)", "score": 1},{"body": "I fucking love it here in Cedar Falls! It's really beautiful on campus as well. I wish I could have gotten some pictures of the undisturbed snow before they plowed it all this morning.\n\n\n", "score": 1},{"body": "I agree, I don't understand all the downvotes. It's just an opinion. Downvotes aren't for disagreeing. ", "score": 1},{"body": "I second that motion with an irrefutable exact emotion.", "score": 1},{"body": "Are they playing basketball, volleyball something else?\n\nThe attire is totally incorrect.", "score": 1},{"body": "I am bad and very good at it. I feel Bender would be proud. ", "score": 1},{"body": "It's no match for the [Jamie Oliver Herb Chopper.](http://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/s8cAAOSw6aVUp~pu/$_57.JPG) \n\n", "score": 1},{"body": "Solid dog with his octo-camo", "score": 1},{"body": "I'm guessing at least 50 creepy DM's sent to OP. ", "score": 1},{"body": "What is that? A hammock for ants?!", "score": 1},{"body": "10/10 ", "score": 1},{"body": "Ya. That's not you. ", "score": 1},{"body": "Cmon OP", "score": 1},{"body": "But. Its summer in Australia....", "score": 1},{"body": "\"Detective lol is on the case!\" sounds like something that needs to exist right now.", "score": 1},{"body": "I can imagine the phone call to your SO:  \n\"Honey, on your way home can you pick up a banana?\"  \n\"Umm, okay, why?\"  \n\"I need to take a photo of the feature wall for reddit\"  \n\"...\"", "score": 1},{"body": "Your going to break r/photoshopbattles! ", "score": 1},{"body": "You're a romcom starring Tina Fey waiting to happen. ", "score": 1},{"body": "You look eerily similar to that cousin I made out with on NYE a couple years back.", "score": 1},{"body": "Are you talking about a wild fox or a domesticated fox?", "score": 1},{"body": "Hi there! I was actually trying to understand more about the serial number and class... I know C class was everything free, his is \"F 21....\" ", "score": 1},{"body": "Histrionics, dude, screeching like a scalded woman, telling us you save 4-1/2 minutes by driving a bit faster, then squirreling out of your statement, that it was pure hyperbole, that you actually have to drive 40 MPH over the speed limit (!!!) to achieve that time savings.   Man, you are so full of shit.  \n\nDon't conflate \"being lazy\" with \"driving like it's your job.\"  Pay attention, and get on down the road, or if you are unable, stay to the right and let the rest of us get to where we need to be. Come clean, are you old, or an inexperienced driver?\n\nYou absolutely can accumulate a small bit of something and turn it into something significant, or use that 4 minutes a day to post one more outrageous and hysterical thing on your favorite time wasting website.\n", "score": 1},{"body": "This is messing with me.  It's Downton Abbey 2015.  Paneling, richly appointed room, and Anna the mousy ladies' maid, far right.  ", "score": 1},{"body": "Look at the shitter on that critter.", "score": 1},{"body": "This is some low effort garbage.", "score": 1},{"body": "Looks like a primitive Halo energy sword.\n", "score": 1},{"body": "Yea, tell her that she is WRONG!  but use an adam sandler / bob barker accent. ", "score": 1},{"body": "I forget what this specific style of tattoo is called (is it abstract?) but I'm curious if anyone can post pictures of one that's a couple years old. \n\nI really love the style but I always hear people talking about how shitty it'll look once it's faded a bit, and all the pictures I see look brand spanking new. \n\nOr maybe some tattoo artists can offer their input about how the abstract and/or water color styles hold up over time? ", "score": 1},{"body": "OP has just become my favorite Redditor. ", "score": 1},{"body": "My eye goes to the vines, it looks like the pillars split open, enter the void OP. ", "score": 1},{"body": "Yep, I did. I actually used a nifty little Chrome app called PicMonkey. Worked surprisingly well.", "score": 1},{"body": "We would like it if the cars were more symmetrical. \n  ", "score": 1},{"body": "He is a famous homeless guy. See the top of the thread for info.", "score": 1},{"body": "There's about 50 now. Happy?", "score": 1},{"body": "Doesn't taste as good as it looks", "score": 1},{"body": "Where are your buttons?", "score": 1},{"body": "I didn't do it at my wedding. No one missed it. Not a single soul. I tossed the bouquet in the garbage at the end of the night, and no one had to pretend to want it. ", "score": 1},{"body": "&gt; no one was none the wiser.\n\nI don't think that means what you think it means.", "score": 1},{"body": "Get your magic number sorcery out of here. It's too perfect.", "score": 1},{"body": "Those are all probably dudes", "score": 1},{"body": "http://i.imgur.com/6yY8zZa.jpg", "score": 1},{"body": "Oh, *should* it now? Should it *really*?", "score": 1},{"body": "The point of the pic wasn't to impress you cat loving fat asses. You get it?", "score": 1},{"body": "Banana nanana bananana nananana Cat man.", "score": 1},{"body": "In the winter, Ottawa is nice when it is snowing. You can also go skating along the canal when it freezes. As for small towns there are a few nice ones in Ontario but they all kind of look like your hometown to me. \n\nMy hometown was surrounded by farms and rolling hills. Every winter when it snowed heavily the red brick buildings would get covered in white along with everything else. Though my favourite thing was to watch at night as the snow fell creating a false twilight as the streetlights were reflected off the snow making the whole town glow.", "score": 1},{"body": "I'll be the asshole, up to you guys!", "score": 1},{"body": "makes sense, thanks. ", "score": 1},{"body": "I don't ever read the captions while scrolling through these kinds of pictures. These were my thoughts going through these photos:\n\n\"Ah I live in Iowa too! It's always so beautiful when it snows.\"\n\n\"This place seriously looks amazing.\"\n\n\"Huh, I didn't know there was more than one 'Blackhawk Hotel'.\"\n\n\"Weird. A new bar called \"Whiskey Road\" just opened up recently here as well.\"\n\n\"Oh shit, 'Oster Regent Theatre'. Pictures from Cedar Falls on Reddit! Woooo!!!\"\n\nSeriously, Main street is so beautiful right now that I don't even notice it and I live here.", "score": 1},{"body": "Does anyone else see an Angel to the right, and the rest looks like a hand? Maybe I've just been playing to much Magic lol", "score": 1},{"body": "Adding this to my list of things to 3D print for whenever I get one of those.", "score": 1},{"body": "Well I think you're the most gorgeous of the lot.  So I'm sure you won't need to rely on luck from a bouquet of flowers. ", "score": 1},{"body": "Does not check out. Ted would never make such an egregious grammar mistake.", "score": 1},{"body": "You're aware that you probably aren't a stranger to many at a wedding right?", "score": 1},{"body": "LOL. I get it, thank you for informing me.", "score": 1},{"body": "Where do I buy 2 friends? Does Target have them? ", "score": 1},{"body": "Homeless people shop too.", "score": 1},{"body": "A gameboy color cartridge. I'll guess, pokemon Red. ", "score": 1},{"body": "I'd say \"whoosh\" except that it wasn't close enough to your head to make the sound.", "score": 1},{"body": "... /u/unidan?", "score": 1},{"body": "I'll probably never look like the BFG either :/", "score": 1},{"body": "Now you have a chair, some cable, a winch and a tow truck glued to the MRI. ", "score": 1},{"body": "Yeah, that's what they're called.", "score": 1},{"body": "it's awful", "score": 1},{"body": "These are brilliant! ", "score": 1},{"body": "Way to inebriated in that garage most of the time to play any real games haha", "score": 1},{"body": "Those suggestions are all great facebook profile pictures. You should rotate between them. ", "score": 1},{"body": "Purge the Coolant? The cryogens? You mean the Helium right? You shouldn't have to. Just ramp the magnet down (getting rid of all the current amperage) and you'll be able to remove equipment. After removal and inspection, clear area and ramp the the machine back up.\n\nI am admittedly not a certified MRI engineer but go to official training later this year. I have received on the job training with my MRI certified colleagues when this kind of shit has hit the fan up here in Alaska though. \n", "score": 1},{"body": "Alright kiddo, take your dank memes and get your ass back to the classroom. You'll never pass 7th grade if you spend all your time making stupid comments on Reddit. ", "score": 1},{"body": "It's actually just tea, but they use unwashed kilts as the filters.", "score": 1},{"body": "Am I racist if I assume that he's a master at Kung fu?", "score": 1},{"body": "Enjoyable photos, good job. Makes me want to go there.", "score": 1},{"body": "My first thought was \"that's pretty fucked up, poor fella\". Then I remembered I had kangaroo on the BBQ for dinner. ", "score": 1},{"body": "This piss* is gold. Ftfy.", "score": 1},{"body": "this is why you be sure you arent wearing jewelry in that room.", "score": 1},{"body": "Way more likely it is a ghost's hand.", "score": 1},{"body": "Don't use the q word. It gives me nightmares.", "score": 1},{"body": "Why not?", "score": 1},{"body": "The corner of your sheet of paper.", "score": 1},{"body": "None of the weddings I've been to had an open bar :(", "score": 1},{"body": "sexy pizza is so in right now.", "score": 1},{"body": "You're a smart woman, aren't you?", "score": 1},{"body": "\"What're you gonna do about it, slick?\"", "score": 1},{"body": "lloplloPl", "score": 1},{"body": "Is he really the famous detective Lol? I never thought I'd see him in person!", "score": 1},{"body": "This is true, but Australia only just got internet - so we're catching up a bit", "score": 1},{"body": "I have a smaller one on the hill in my backyard\nIt's a volunteer.\n", "score": 1},{"body": "Wouldn't it be cool if that little girl is a redditor today?", "score": 1},{"body": "My boy Tim's wicked smaht", "score": 1},{"body": "Dont advertise you are a gun owner to everyone on the road", "score": 1},{"body": "I thought the killing was monotous but the story and plot overall were good and especially the ending was certainly worth the wait. That movie made 0% sense until the ending.", "score": 1},{"body": "Read as: \"Hold My Balls, I'm Tripping Calls\". Whoops.", "score": 1},{"body": "I too love the smell of Aloe Vera.", "score": 1},{"body": "Hawke?  Is...is that you?", "score": 1},{"body": "Dear Parishioners. We've come here together to send Alex_GordonAMA and a random Bar off into the holy sacrament of being shitfaced. \n\n\nAlex_GordonAMA, do you take this random Bar to be your lawfully refuge from your wife? And do you promise to honour it, to love and cherish it? Are you willing to nurture a hangover, in sickness and in health? ", "score": 1},{"body": "IIRC, by the mid 70s most surgical implants were switched from implant grade stainless steel to a type of titanium alloy that we use today.  Even if it was older, implant grade SS would be fine.", "score": 1},{"body": "I thought so too, just wanted to see some small quivering humans for scale.", "score": 1},{"body": "[x] decent looking girl\n[x] alcohol joke\n\nFront page we go", "score": 1},{"body": "You're masculine, in a sexy way.", "score": 1},{"body": "Would have FALLEN. Not \"fell\". ", "score": 1},{"body": "Don't worry, I am an Australian and i have a Bald Eagle as a pet. I have a little leash that i put around it when i take it outside.", "score": 1},{"body": "Me next! Me next!", "score": 1},{"body": "Yeah for NERDS", "score": 1},{"body": "Good guess, but not correct ;)", "score": 1},{"body": "O'Donnell", "score": 1},{"body": "I feel like this is an attention grab. I also feel like it's working.  \nHi there!", "score": 1},{"body": "check it on and trust me watch it too the end...you will want too turn it off. but it keeps you just BARELY going...and then at the end its all worth it.", "score": 1},{"body": "One thing to bear in mind is that the ideal FB cover shot is 851x315 pixels. However, if you make it at this size then the corresponding profile pic will be 160x160 (I think) - and FB requires at least 180x180. \n\nSo it might be best to make them at double size, to meet minimum while retaining positional matching.\n\nAnother thing to bear in mind is that, on mobile, the pics won't match up anyway, as the layout is different than on desktop :-)", "score": 1},{"body": "Maybe we should ask r/trees to identify it.", "score": 1},{"body": "To be sure, that's what we are talking about.  22 minutes at 45mph is about 16 miles.  A 16 mile commute through nothing but residential districts?!  Where in America is that?\n\nNeighborhoods should be posted at 15mph on side roads, but that isn't what this thread is about.", "score": 1},{"body": "you can tell that man knows you're taking his picture for Karma", "score": 1},{"body": "I, too, used to smoke drugs.", "score": 1},{"body": "Hydrogen is a different matter entirely, as it's nice and flammable, helium isn't. The issue would be dealing with that amount of gas *that* fast. A compressor of that size would be prohibitively expensive, huge and building-light-dimming worthy. ", "score": 1},{"body": "works on mozilla and chrome. I'm not sure why it wouldn't on safari.. I don't know anything about Apple systems.\n", "score": 1},{"body": "I also worked with a 3T MRI in grad school. Quenching the magnet to shut it down will likely damage the magnet, which is by far the most expensive part of the machine.", "score": 1},{"body": "So hardcore.", "score": 1},{"body": "Now that's Derelict", "score": 1},{"body": "you're looking in the wrong places. ;)", "score": 1},{"body": "Since when did they start doing that?? ", "score": 1},{"body": "Is that you, Dwight?", "score": 1},{"body": "Hey, don't bullshit me here. I was around for the great ameristralia joining of 2014. ", "score": 1},{"body": "I hate the douchebags that cant class themselves up for a few hours..dude throw on a button up dress shirt, find some dress panta or chinoa..not fucking flannal..or even seeing baseball caps at weddings..have some class man. ", "score": 1},{"body": "M'lady.", "score": 1},{"body": "The reddit fonts for each are so close, it's often hard to tell.\n\n", "score": 1},{"body": "This guy inspired me a few years ago to grow giant onions in my allotment. Yes I am british.", "score": 1},{"body": "Rotating sushi bar sounds like tysons 1..... Li don't think there's one at tysons 2 but I don't really go there", "score": 1},{"body": "Hottest one there too", "score": 1},{"body": "There was no arguement. I didn't challenge your position, I just stated mine", "score": 1},{"body": "he even looks like an onion", "score": 1},{"body": "Unlucky bastard. I had an epigastric hernia, everything stayed above my belly button, ball sack is fine. \n\nPlus I live about an hour away from the best hospital for hernia repair in the world (Shouldice hospital).", "score": 1},{"body": "I just don't believe it. ", "score": 1},{"body": "Do I even want to know how much that costs?", "score": 1},{"body": "AM GRILL BTW!!\n\nXDDDDDD", "score": 1},{"body": "Because it's released entirely too fast to capture much. ", "score": 1},{"body": "ur hot", "score": 1},{"body": "Looks like Oldboy", "score": 1},{"body": "I actually said \"huh!\" out loud...in a sexy way.", "score": 1},{"body": "Pasco county high-five!", "score": 1},{"body": "Can you imagine getting hit in the face with this? The pointy bits would shred your flesh into ribbons. It'd be like sawing your features off with a buck saw... ", "score": 1},{"body": "Aka bonzai.", "score": 1},{"body": "What does licking it have to do with anything?", "score": 1},{"body": "She must be poppin fukitalls", "score": 1},{"body": "I'll take that as a compliment.", "score": 1},{"body": "Time to get a new frypan. That one's middle is warped.\n\n", "score": 1},{"body": "*high five*", "score": 1},{"body": "Directed by Stephen Spielberg ", "score": 1},{"body": "Until we start fusing hydrogen. Then comes lots of helium. ", "score": 1},{"body": "In accordance to the universal laws of comedy, that bouquet was caught by you, right?", "score": 1},{"body": "This is so trollbait.", "score": 1},{"body": "Probably just a branch in a tiny pot.", "score": 1},{"body": "Proof?", "score": 1},{"body": "That's good to hear! :) ", "score": 1},{"body": "Would be funny if you were the one who actually caught the bouquet!  ", "score": 1},{"body": "I may still have access to the MRI I used for research in grad school. It's not quite home, but I could definitely try this if I really wanted to pay a shit ton of money and likely hurt myself ", "score": 1},{"body": "Stock photo ", "score": 1},{"body": "Well. In that case, you're welcome. I guess. \n\nI really dunno how to respond to that. ", "score": 1},{"body": "Swasticker", "score": 1},{"body": "Technical middle school really?\n\nAnyway ha I can't imagine it was too precise, good enough apparently. \nI actually use calipers all the time as I'm training to be a Machinist. \nThat's why I found that interesting.", "score": 1},{"body": "Baby bat-leth.", "score": 1},{"body": "This is nice and all but where's the title that says your wife left you, or that your autistic 5 year old daughter did this but thought it was no good.", "score": 1},{"body": "Passive aggressively supportive girlfriend", "score": 1},{"body": "thatsthejoke.jpg\n", "score": 1},{"body": "[thatsthejoke.jpg](http://i.imgur.com/tEjeMu8.jpg)  \n\n\n---\n^(*Feedback welcome at /r/image_linker_bot*)\n", "score": 1},{"body": "You're grandpa is hinting at something. ", "score": 1},{"body": "oh Robin", "score": 1},{"body": "Butterballer", "score": 1},{"body": "This is great. Curious how one manages to come up with all these cool art ideas", "score": 1},{"body": "A pungent smell of onions filled the room, then suddenly shrek burst through the door exposing his sherect penis.", "score": 1},{"body": "Mr. Deeds drank it all.", "score": 1},{"body": "^this", "score": 1},{"body": "Please tell me the MRI machine literally sucked that into itself", "score": 1},{"body": "It's fan made, and you should really do yourself a favor and watch the Lego Movie.", "score": 1},{"body": "Did you see this at LACMA? ", "score": 1},{"body": "That would have been exciting if it broke the valve off the bottle, big steel rocket. Do you know what gas it was?", "score": 1},{"body": "As cool as it is to seem above it all, wedding would be boring if everyone didn't go with the act", "score": 1},{"body": "Single for real? Amazing because you are beautiful.  ", "score": 1},{"body": "You should, thought it was gonnna be corny, ended up enjoying.", "score": 1},{"body": "From there on Northward start growing crops right to the border.  Use 12% of the money from that operation to lobby for more water.  Lather, don't waste any water, repeat till you become known as the Riverbed Baron.", "score": 1},{"body": "Unless it was a private hospital, he didn't even have legal right to carry it. My mom's a nurse and has a concealed carry. She always has her pistol, except at work, because it's fucking illegal.", "score": 1},{"body": "Goddamnit vargas-sama...", "score": 1},{"body": "I tired to read that like Jeremy Renners character from The Town.", "score": 1},{"body": "Crazy people find it easy to be happy.", "score": 1},{"body": "I agree with you 100%. ", "score": 1},{"body": "I miss The Hub....", "score": 1},{"body": "I want an answer!", "score": 1},{"body": "go back to sleep Australia. ", "score": 1},{"body": "At least you don't have to gift yhrm big thoigh", "score": 1},{"body": "Good news! Your membership into the Circumlocutory Ancillary Redundancy Committee has been approved!  ", "score": 1},{"body": "Everything. Smell is very closely related to taste. Jeeze, I'm starting to doubt the validity of anything you say about smells. ", "score": 1},{"body": "Good to know!", "score": 1},{"body": "Beautiful ladies.", "score": 1},{"body": "Ah, dammit. Looks soooooooo biteable", "score": 1},{"body": "You can click on tags for a link to where you tagged them.", "score": 1},{"body": "Heh.", "score": 1},{"body": "Sadly I am not the expert I would like to be. If I come across anything, I'll let you know!\n\nBut from my understanding, serial numbers were issued starting at #1 and increasing. But, my grandfather could have been bullshitting me to get me to believe he was one of the first hundred members, so hard to say for sure.", "score": 1},{"body": "That's implying there was ever snow at all", "score": 1},{"body": "gaba, your priorities are increasing the gaba in your brain", "score": 1},{"body": "I think this story is brought up in every MRI training session. I know I've heard it several times, and I only used the machine in grad school for about 4 of 5 months.", "score": 1},{"body": "That is \"gourdgeous.\"", "score": 1},{"body": "\"pLEASEEE take me with you....\"", "score": 1},{"body": "Bad Ass.", "score": 1},{"body": "*slap*", "score": 1},{"body": "White people ", "score": 1},{"body": "You're the hottest in the picture, by far. ", "score": 1},{"body": "Kotal kahn!", "score": 1},{"body": "This must be what they use to make the worlds tiniest violin.", "score": 1},{"body": "You should see a doctor. I knew a friend who had that and he said the doc fixed it (I didn't ask how).", "score": 1},{"body": "Plunk it down hipsters", "score": 1},{"body": "Yes, it is pretty important because the magnetic field causes protons (water) to \"spin\" at some frequency.  This spin, under certain circumstances, can be detected as an electrical signal, but the spatial position that any spin has is related to its frequency.  Other weak magnetic fields encode position using frequency but we need a very stable base frequency to start with.  This means that if the field isn't uniform, things will appear distorted or show up where they don't belong in the image because they are spinning faster or slower than we would expect them to.  Mostly, this shows up as weird, non-physiologic structures called artifacts in the images the scanner makes.", "score": 1},{"body": "IMO That's wrong, poor animals.", "score": 1},{"body": "I'm always impressed with the density of tropical hardwoods. I live in Canada and all I usually see are softwood conifers, maybe the occasional maple or aspen. I've had to fell and limb a few of them, I can't imagine doing that with trees 4 or 5 times as tough. As you say, it'd be like trying to chop down a street lamp.", "score": 1},{"body": "Why not just lay it on it's side?", "score": 1},{"body": "No one else notice the man top right with the \"O Shit\" look on his face as one of the ladies is with him? \n\nI've been there that's the only reason I know. ", "score": 1},{"body": "You got served.\n\nLike these girls do.", "score": 1},{"body": "Am I sinister person for laughing so hard at this?", "score": 1},{"body": "Um. I think OP just put a branch in a pot.", "score": 1},{"body": "Well the fundamental reason is because our economic system isn't a bottom-up scheme where workers elect bosses and rewards, it's a system of hiring up people to work in exchange for money or a piece of what they're making. It's not like people who work for chains don't know this or at least have some clue of what kind of organization they're part of. \n\nThe leader of the chain is likely being rewarded by remaining shareholders for consolidating the capital investments and liquidating its inventories and labor to concentrate on salvaging it for later re-sale. The CFO is essentially the person left digging the graves and shareholders think he knows where best to dig them so they reward him and keep him on. \n\n", "score": 1},{"body": "Congratulations!", "score": 1},{"body": "Anyone else thinking of heroin", "score": 1},{"body": "Who's Elsa ? ", "score": 1},{"body": "I guess this shirt is...unbuttoned", "score": 1},{"body": "Mom?", "score": 1},{"body": "Yeah a lot of people don't realise how sharp \"fresh\" shark teeth are. The ones they find on beaches or used in jewelry are typically the old, discarded teeth that sharks have shed, hence the bluntness.", "score": 1},{"body": "Looks real good ", "score": 1},{"body": "You're pretty thirsty", "score": 1},{"body": "Have to get to school, they don't let you make up tests for any reason.", "score": 1},{"body": "well fuck that thing... \n*High fives door*", "score": 1},{"body": "Shark Tooth Claw:\nRequires level 10. \n15-20 physical damage.\nAttack speed: 1.1/sec.\nChance to Crit: 10%\nFive life gained for each enemy hit by your attacks.", "score": 1},{"body": "Love you man!.. Hope she's ok and Kind wishes upon you all!", "score": 1},{"body": "I honestly have no good reason that this hasn't been my canned response for everything with this account.  All that potential, **wasted**.", "score": 1},{"body": "Mugatu's Derelicte Campaign ", "score": 1},{"body": "That's because Oakland county is in the top ten richest counties *with a population over 1 million\" the majority of those other counties have ~200-400k", "score": 1},{"body": "As a wine connoisseur this worries me", "score": 1},{"body": "This reminds me of my old job . I used to be a lead at a warehouse and I was in charge of the egg department . This sort things used to happened all the time...I was fun and nasty like your mom ", "score": 1},{"body": "I've been shitting pancakes ever since.", "score": 1},{"body": "Do you paint commissions?", "score": 1},{"body": "I have always considered dating as in you are going out occasionally with someone, doing fun things, hanging out, etc. \n\nIn a relationship means they are bf/gf and commonly are in a exclusive relationship. \n\nYou could be dating multiple people at the same time but not when you're in a relationship. ", "score": 1},{"body": "Yes. It's a brand name iirc.", "score": 1},{"body": "Do you want PMs? Because that's how you get PMs.", "score": 1},{"body": "In my defense: I was totally high when I wrote that and wasn't able to find out how to change comments on the android app.\n\nSo yeah, now I let it stand for everyone to see.", "score": 1},{"body": "I had just finished watching an episode of Sword Art Online II, so when. Looked at these they just seemed giant to me. \nLots of giants monsters in that anime. ", "score": 1},{"body": "but what happens if your martini get's friendly fire from the melee ", "score": 1},{"body": "COming from someone like you I'll take that as an compliment, even if you didn't mean it like one.", "score": 1},{"body": "That's just a stick from a tree stuck in some soil, surely. I want to see roots! 😄", "score": 1},{"body": "I'm don't really know how to respond to someone telling me I'm not me. \nThank you is my default.", "score": 1},{"body": "Seriously how do you get that around your head?", "score": 1},{"body": "You don't seem tall. ", "score": 1},{"body": "Lake Havasu City of all places got 4 inches a few days ago.  That's fucking rare for that to happen in that city. ", "score": 1},{"body": "http://youtu.be/Hm3JodBR-vs", "score": 1},{"body": "these are sick ", "score": 1},{"body": "It is an electromagnet. What that means is it is only magnetic while powered. The electricity is spooled up in a coil of wire which creates a powerful magnetic field. The magnets on your refrigerator are permanent magnets. They are metals that have been magnetized.", "score": 1},{"body": "2am and I've got nothing better to do than eat twizzlers and try to entertain myself... Looks like you were entertained, too. Everyone wins.", "score": 1},{"body": "But it comes each time some one mention cats which happens every second on reddit", "score": 1},{"body": "so murrican i dont even", "score": 1},{"body": "And the guy with the gas mask running at the camera", "score": 1},{"body": "Looks like a modern day Ghengis Khan. ", "score": 1},{"body": "That sounds gross. I'm not sure if I would try that. But now I want to know if it's good. So maybe I would. If only they made chocolate kool aid", "score": 1},{"body": "All of them looked badass except mine :( (Aquarius)", "score": 1},{"body": "Think of it more like a club that left little pieces of shark teeth in your skin. It wouldn't be able to cut you like a sword or anything. ", "score": 1},{"body": "Dear Wells Fargo Bank,\n\nPlease consider my account closed.\n\nFuck you very much,\n\n/u/florida002", "score": 1},{"body": "Single eh? ", "score": 1},{"body": "I don't believe the picture on Wikipedia was from July. I was in Shanghai in July and it was so cloudy and foggy the I never saw the top of the building (let alone the sky)", "score": 1},{"body": "They are called 'Huntsman' for a reason...", "score": 1},{"body": "something about this smells Boxxy...", "score": 1},{"body": "You cannot be Serissa?", "score": 1},{"body": "The markings on his head are close to symmetrical. ", "score": 1},{"body": "M-MEGAN!", "score": 1},{"body": "That's not to say we don't have morons in Australia, but even they aren't of the level that treats a baby kangaroo like that. ", "score": 1},{"body": "Is he an all black kitty? Post more pictures if he is!\n\nSo cute. ", "score": 1},{"body": "I have no idea what you are talking about. nails can be kept clean", "score": 1},{"body": "Everyone above this comment is still masterbaiting. They'll be here shortly to see what OP's done. ", "score": 1},{"body": "Mad love from my family to yours.  Here is to a speedy recovery!", "score": 1},{"body": "Pismo?", "score": 1},{"body": "Lookin smooth. Pretty damn smooth.", "score": 1},{"body": "she'd have to pay though...", "score": 1},{"body": "Wow this used to have over 7000 points hard to believe you can get downvoted 2000 times in half an hour.", "score": 1},{"body": "/r/NowExpected/", "score": 1},{"body": "You mean it snowed?", "score": 1},{"body": "Me. Was headed south to Tokyo and wanted to make time for a trip a little out of the way", "score": 1},{"body": "I wish I was rich and could just make everything right..although I know nothing can make up for what happened to her . I could send her something now and a bit each month. I think anything would help her. Does she have a gofund me page or anything set up for donations? ", "score": 1},{"body": "Parched.", "score": 1},{"body": "Wow, she's gorgeous at it though.", "score": 1},{"body": "I too am indifferent to the smell of Aloe Vera.", "score": 1},{"body": "It should. Everything you thought you knew about wine is probably all wrong. You know they crush the grapes with their feet? And you say aloe tastes bad... \n\nBy the way, have you ever tried aloe wine? ", "score": 1},{"body": "Looks like a Final Fantasy character.", "score": 1},{"body": "Lady Grey is clearly superior to Earl Grey.", "score": 1},{"body": "your kid needs to sleep, all kids k-12 need to sleep more, they need later start times, it's school, not daycare.", "score": 1},{"body": "Why does it need the helium? I kinda thought they froze the magnet so it wouldn't work lol", "score": 1},{"body": "Damn that looks just like my car. Except i have a sunroof", "score": 1},{"body": "Lionsgate martial arts/yakuza action movie incoming", "score": 1},{"body": "It should wear a diper ", "score": 1},{"body": "And it begins. ", "score": 1},{"body": "Bay Area ", "score": 1},{"body": "It's actually shit", "score": 1},{"body": "\"All I care about is *attention\"", "score": 1},{"body": "uh..can you ask him when? I'm still waiting.", "score": 1},{"body": "On way that's a bonus for bleeding once a month is I have something better than a diaper to l line my crotch. It's smaller but it does the job for my leakage when I'm drunk, and I can still wear my tight pants.", "score": 1},{"body": "Don't lie, you're beard dude", "score": 1},{"body": "Prove it? Or just ignore me. I mean who really cares what a random stranger on the internet thinks. ", "score": 1},{"body": "My pizza food truck owing friend would would love to rock this shirt. I dig your style. ", "score": 1},{"body": "Yea but dick sex", "score": 1},{"body": "(The article I got it from the Huffington Post is all the proof I have)[ http://www.huffingtonpost.com/peter-h-gleick/an-historic-step-toward-s_b_2167513.html]", "score": 1},{"body": "Throw some bows, give a toddler a concussion, whatever you gotta' do, do.", "score": 1},{"body": "&gt; Guy's excuse was that he didn't have to reveal that he has a gun on him because he has a concealed carry permit, or something to that effect.\n\nAs if a concealed carry permit allows anyone to carry a firearm in a hospital in the first place....what a douche.", "score": 1},{"body": "I've been there and it's nice.", "score": 1},{"body": "I am not sure what the helium is for... possibly part of the imaging process.\n", "score": 1},{"body": "You seem legitimately concerned Andshu.", "score": 1},{"body": "Am I the only person who liked how it ended? I mean, they could have had the decency to make that last episode it's own season, but Ted and Robin totally belonged together. ", "score": 1},{"body": "That one chick in the front looks THIRSTY.", "score": 1},{"body": "Thanks.", "score": 1},{"body": "No way, it was Jay!", "score": 1},{"body": "staged", "score": 1},{"body": "You can click on the tag and it will show you where you tagged him.", "score": 1},{"body": "Damnit Rodger!", "score": 1},{"body": "Most MRI rooms are lined with copper to keep this from happening", "score": 1},{"body": "you sorta look like robin from himym", "score": 1},{"body": "http://imgur.com/uJfwO.jpg", "score": 1},{"body": "The 2015 [insert high end clothing brand name here] fall collection. ", "score": 1},{"body": "Kolashampan from El Salvador is a pretty good impersonation as well. I've seen that on sale here in southern California.", "score": 1},{"body": "I see. So you're using the term \"dating\" as meaning \"having gone on multiple dates with\". I've always hesitated to say \"I'm 'dating' her\" if we hadn't had an \"official\" decision to define the relationship. I feel like with the former definition, I'm \"dating\" my best friend because we go play tennis and grab beers afterwards a couple nights a week.", "score": 1},{"body": "I wanna ruin their hair with my semen", "score": 1},{"body": "Wow white balance looks way better on my screen - great job!", "score": 1},{"body": "I don't watch GoT, but if someone replies a link with a pic it shall be done!", "score": 1},{"body": "this pic has always made me feel as if its computer drawn. It doesnt look real. Even though it is the hubble.", "score": 1},{"body": "you get one for every comment you make so...", "score": 1},{"body": "Andshu concerned. Andshu need resolution. ", "score": 1},{"body": "Helloooo lock screen background", "score": 1},{"body": "Yeah, I can't imagine it being too accurate either. According to my dad it was common for students in Mexico to learn these trades early on. Also, middle school in Mexico is the equivalent of 7th-9th grade in the US.\n\nMy uncle passed away at 18, so I didn't get a firsthand account of his education history. He did however, purchase a real one eventually. [Which I happen to own](https://s3.amazonaws.com/pushbullet-uploads/ujuOV17gTxA-ny9ufjsdVzMVz81nO3rgUxWye9zecesn/20150107_003831.jpg), it was very useful throughout my degree, I could've purchased a digital caliper but I enjoyed using this particular one so much more. [His initials engraved](https://s3.amazonaws.com/pushbullet-uploads/ujuOV17gTxA-ncJYzVL8NxCkkLE3mvlbJkLbH7WDMPSW/20150107_003848.jpg).\n\nThat is awesome! I wish I had more experience in the machine shop. That is a great job, my dad used to be a machinist as well.", "score": 1},{"body": "yo... don't leave yo kid in da car", "score": 1},{"body": "Move to Australia right now and be my best friend. ", "score": 1},{"body": "I believe that's a male gorilla", "score": 1},{"body": "Good for you buddy. You know they you can do/have all of those things in the city too right?", "score": 1},{"body": "He wasnt working on the machine. I never once said he was there to fix the machine, he was working on an entirely separate space to the machine. \n\n", "score": 1},{"body": "Didn't see the bridge. Near San Quentin?", "score": 1},{"body": "Keep the faith. ", "score": 1},{"body": "I suspect the reason so many people rip on Detroit is because they've been subtly propagandized to hate the city's story, led to believe it it somehow the black people who live there's fault, and not the fact that all the jobs that existed and stabilized the city's economy vanished relatively quickly, which leads to a city of millions having massive unemployment. Instead of seeing the city as a capitalist failure, the media purports it as its collapse as having a racial composition.\n\nI have argued with so many racists on reddit about Detroit, and they refuse to see the statistical facts.", "score": 1},{"body": "Can confirm, have competed in this Olympic event.", "score": 1},{"body": "One of the only people not bashing me for this stupid picture. \n-Merci.\nI got it on etsy.", "score": 1},{"body": "As long as you don't put a penny in the door. ", "score": 1},{"body": "I'm gonna need a banana for scale.", "score": 1},{"body": "Hm. I have the same shoes.", "score": 1},{"body": "Old Zic!\n", "score": 1},{"body": "\"Lemme take a picture of this homeless man and reap the karma. Yay for people less fortunate than me!\"", "score": 1},{"body": "buy him a white collar.", "score": 1},{"body": "Holy hell! That pic should of had a warning! I just launched my shih tzu into the ceiling! ", "score": 1},{"body": "WHATS BIRDLAW?", "score": 1},{"body": "just tagged you as \"wore diaper to wedding for leaky penis,\" obviously with the tag color yellow", "score": 1},{"body": "Ye gods, you really want that bouquet. You should really lose a pound or twenty or else it ain't happenin'. Might want to work on the smile too. ", "score": 1},{"body": "so did you ever get the handle or wut", "score": 1},{"body": "I've got a blue one of those.", "score": 1},{"body": "Actually it is \"Serissa is one of the most common bonsai, especially in Japan. It is not difficult to maintain as bonsai, but is very fussy.\" according to the wikipedia page", "score": 1},{"body": "What you don't know, Feduppanda, is that Circlejerk is always leaking. It's leakage can be found spread sitewide.", "score": 1},{"body": "Fitbit for Christmas ", "score": 1},{"body": "This was me at a wedding once, but the bouquet hit me in the fucking head. Then landed squarely between my feet. The crowd fell silent and just stared.", "score": 1},{"body": "wow good job proving my original point. Those all have an ordering system to its paranetrics. Unlike the snow fence. Rek urself nab.", "score": 1},{"body": "life pro tips worthy.", "score": 1},{"body": "This is not a fucking tree", "score": 1},{"body": "This needs to be a photoshop battle picture!!", "score": 1},{"body": "It looks like an awkward recreation of that [scene from The Lion King](http://i.imgur.com/GE2kLWk.jpg).", "score": 1},{"body": "Yay for winning?", "score": 1},{"body": "Well there she is, the most interesting one of them all.", "score": 1},{"body": "Probably the most adorable thing I've ever seen ", "score": 1},{"body": "We're talking about scaling **up** right now, so I have to disagree. That table is taken from an article about how NATO is pushing for higher spending by its members. It won't rise to 10% of GDP, but it might be set at 2% minimum. \n\n&gt; I feel it's important for at least one western country to maintain a comparable military force. \n\nComparable? In what sense? The US is many times bigger than most other forces. It would be rather pointless for Europe [as a whole or one nation] to have similar capabilities. Why would we need that kind of force? We're not the world's police force, we prefer using the UN for interventions. NATO is supposed to be a regional, defense alliance.\n\nI wonder what you see as anti-Western anyway? Russia? They're hardly our best friend, but that's more about Putin's regime than hostility. They care about their regional sphere of influence. Iran's not really an enemy. China is all about their territory and resources, hardly likely to invade Australia/US/Europe any time soon. \n\nThe US has more than enough power to counter as it is. You can't compare the number of \"soldiers\" each country can muster. That's rather pointless anyway. Force projection isn't about North Korean bodies versus US Marines :) Look at number of carriers and air force capabilities. Modern wars are all about air superiority.\n\nChina has a huge number of soldiers, but they're rather poorly equipped. Or at least used to be. They've made progress, but it's far from comparable. \n\nRussia has only just \"refreshed\" their armory, and they're going to have a difficult time doing more with the ruble's collapse.", "score": 1},{"body": "While I agree that this is really an awe-inspiring photograph...\n\n- [from 2 hours ago](http://www.reddit.com/r/pics/comments/2rliih/2015_hubble_image_pillars_of_creation/)\n\n- [from 13 hours ago](http://www.reddit.com/r/pics/comments/2rjeni/hubble_goes_high_def_to_revisit_the_iconic/)\n\n- [from 15 hours ago](http://www.reddit.com/r/pics/comments/2rix7u/pillars_of_creation_new_hubble_photo_shows_stars/)\n\n- [from 18 hours ago](http://www.reddit.com/r/pics/comments/2rigd4/hubble_goes_high_def_to_revisit_the_iconic/)\n\nAnd these are just the ones from /r/pics.", "score": 1},{"body": "Asian aloe juice drinks are so good. ", "score": 1},{"body": "Derelicte!\n\nhttps://www.youtube.com/watch?v=zkOBAEa9wn8&amp;t=0m8s", "score": 1},{"body": "haven't been the [same since](http://www.jeffersonbailey.com/wp-content/uploads/2014/04/old_heidelberg.jpg)", "score": 1},{"body": "It looks like this plant is 90% water storage. How is this plant able to live?", "score": 1},{"body": "Hey, any reason to get drunk!", "score": 1},{"body": "Wow you're an idiot...", "score": 1},{"body": "[Same](http://i.imgur.com/NlKqbRg.gif)", "score": 1},{"body": "Taste it.", "score": 1},{"body": "Nice try Reddit NSA Agent. ", "score": 1},{"body": "Thanks for breaking it down, I'm gonna try tomorrow!\n\n+/u/dogetipbot gold", "score": 1},{"body": "I have to say I am indeed concerned", "score": 1},{"body": "Ah, yeah, that's good proof.", "score": 1},{"body": "Seeing as you're an attractive bad ass, how many horny/inappropriate PMs have you received since posting this? I assume you're keeping track for some reason", "score": 1},{"body": "Where were you when the gigantic man dropped his shorts?", "score": 1},{"body": "Amen brotha... [although it was more like 2 months ago](http://karmadecay.com/user/A-Canadian-Here)", "score": 1},{"body": "__^[wow ^such ^gold]__: ^/u/_lobster_ ^-&gt; ^/u/lord__business __^Ð23200 ^Dogecoins__&amp;nbsp;^__($4)__ ^[[help]](http://www.reddit.com/r/dogetipbot/wiki/index)", "score": 1},{"body": "Thank you :)  Really excited.", "score": 1},{"body": " yup I did that at the last wedding I went open bar for 2 hours was plenty of time to get blasted even got a whole bottle of wine to myself so that was nice.", "score": 1},{"body": " nice beastie boys check your head font", "score": 1},{"body": "House?", "score": 1},{"body": "Lion king, jurassic park, etc", "score": 1},{"body": "We missed you :):):)", "score": 1},{"body": "I'm with you man (or woman) this and sugar gliders", "score": 1},{"body": "You've never had sonic?", "score": 1},{"body": "Photo is of a curious joey (kangaroo) coming in for a drink at a cattle water trough.", "score": 1},{"body": "Well since the only person not interested on the bouquet has a ring on their left hand I have nothing bad to say. ", "score": 1},{"body": "You got served, know-it-all asswit. HEHEHE.", "score": 1},{"body": "I think he meant Flash Gordon. ", "score": 1},{"body": "op looks like robin sherbatsky", "score": 1},{"body": "/r/elsanna", "score": 1},{"body": "How he kept a straight face during that scene....i'll never know ", "score": 1},{"body": "He should do an AMA", "score": 1},{"body": "Is this the nope country that you live in?", "score": 1},{"body": "Sounds like my first time ", "score": 1},{"body": "Even in Chinese it could have been worded more \"properly\". It's more like tongue in cheek humour.", "score": 1},{"body": "What types of materials are used to create an electro magnet?? Are some metals better suited to induce magnetism when electrolized?", "score": 1},{"body": "Considering you're a dude, very ugly since I'm not into dudes.", "score": 1},{"body": "&gt; Brother Sharp\n\nThe article says a production company was planning on beginning to shoot film in 2011.", "score": 1},{"body": "Thirstier than the Mohave", "score": 1},{"body": "You just made that up.", "score": 1},{"body": "Thank you for that.\n\nI'm wondering about that because it's a really distinct shape. It makes me think somebody wants it to be like that for a reason. Because, and I really don't mean to be facetious, it doesn't strike me as the most convenient head ware in tight quarters. ", "score": 1},{"body": "Just yours.", "score": 1},{"body": "Could be because the prince married outside of the royalty. Some commoner blood does wonders for the genetics...", "score": 1},{"body": "Never liked the style of H", "score": 1},{"body": "This is reddit. I'm sure she's been propositioned not proposed to.", "score": 1},{"body": "The Lawyer reacting the the Tom Foolery of the gang might be my favorite part of this show.  ", "score": 1},{"body": "Wow, I didn't know it could do that!", "score": 1},{"body": "i don't get how being mean to plus size people floats your boat.", "score": 1},{"body": "A boat!", "score": 1},{"body": "Dang, they are too. I thought I was on to something.", "score": 1},{"body": "Youre on ios... theres half your problem :D", "score": 1},{"body": "Now convinced that Van Gogh was an alcoholic.", "score": 1},{"body": "I would marry you right now", "score": 1},{"body": "[OP isn't even attractive.](https://pbs.twimg.com/profile_images/751415806/lawl.jpg)", "score": 1},{"body": "/r/retiredgif ", "score": 1},{"body": "I love you! Marry me! Whoops. Full circle. ", "score": 1},{"body": "If you're the girl drinking the cosmo (I believe) then I think we're a match made in heaven. I didn't look at the rest of the photo. Was it funny??", "score": 1},{"body": "I think it's a reference to the number on the building in the picture.", "score": 1},{"body": "Thats uncalled for", "score": 1},{"body": "oh dear", "score": 1},{"body": "I think it ate it...", "score": 1},{"body": "Saw this posted a while ago, comments said it was from a movie. ", "score": 1},{"body": "Where it was waiting for it...", "score": 1},{"body": "The end of the exact very same article that you are commenting on ends talking about how a movie was being made about him.", "score": 1},{"body": "You know, if any piece can grow into a new whole, does that mean a woodchipper is like a low tech Groot cloning machine? ", "score": 1},{"body": "And i don't blame you for being concerned. This is a serious matter. Andhu need answer. ", "score": 1},{"body": "vous êtes les bienvenus!\nYou're very sexy in it too. :3\nNeat!", "score": 1},{"body": "They are are friends and neighbours. This one outstayed its welcome", "score": 1},{"body": "Right back atcha, sizzle chest.", "score": 1},{"body": "What the hell is this?", "score": 1},{"body": "Yay for me being proud of my picture. Nay for the people that I've somehow angered by putting it on reddit. ", "score": 1},{"body": "You are now tagged as \"Future Lucille Bluth.\"", "score": 1},{"body": "Really? I find her super attractive, and I love her voice. ", "score": 1},{"body": "Meh.", "score": 1},{"body": "It looks like it might be an Eastern grey kangaroo. I hope it's not, they can get over 6ft tall and that's a retarded thing to have in your house. If they absolutely have to sell them as pets, they should at least import some pademelons which are tiny, fat-arsed, docile versions of a kangaroo.", "score": 1},{"body": "this is HDR... and it is too much of it. There is an own subreddit for that: /r/shittyHDR ", "score": 1},{"body": "They even included the spandex bottoms so you didnt have to fold and roll them yourself!!!", "score": 1},{"body": "I'm failing to see how my comment is A) inappropriate and B) a private message but let's give you a thumbs up for trying.", "score": 1},{"body": "That's really cool", "score": 1},{"body": "Approved.", "score": 1},{"body": "That's really cool", "score": 1},{"body": "Darude Sandstorm", "score": 1},{"body": "... What the fuck is this shit? ", "score": 1},{"body": "quick, someone x post this to /r/trees, they'll figure it out", "score": 1},{"body": "Hm I guess we're all going to ignore the all black theme at a wedding.", "score": 1},{"body": "Welcome to the future, next stop moon.\n\n+/u/dogetipbot gold", "score": 1},{"body": "Sonic used to be just in the Mid-West, but they're starting to expand quite a bit. I'm not a big fan of their food, but their drinks and their jalapeno cheddar poppers are great.", "score": 1},{"body": "Someday you will look back on this time .... and fondly remember your balls.  Happy landings.", "score": 1},{"body": "Very nice!", "score": 1},{"body": "He's actually not so good looking, just a really good picture. See details in him for other pictures, but this guy was treading in Chinese forums long ago", "score": 1},{"body": "You know, I came to the comments looking for a clever and hilarious remark. Instead, I got you. \n\nFuck it, I'm single?\n\nWhat is this? /r/teenagers ?\n", "score": 1},{"body": "\"NAKED PEEPLE!!\"(http://i.imgur.com/sZisys8.gif)", "score": 1},{"body": "Drugs.", "score": 1},{"body": "My dad did this. Partly, because he was a nice guy, but he also loved using his expensive snowblower.\n", "score": 1},{"body": "What shit? ", "score": 1},{"body": "&gt;There were some very pretty women behind the counters. Same goes for Korea, Taiwan and Hong Kong. \n\nSure, by Western standards- not by local. And certianly no girls rocking double eyelid surgery, shaved jawline and a nose bridge implant.", "score": 1},{"body": "And I'm at home shitting myself when I see the Orion nebula as a faint cloud or a couple of moons orbiting Jupiter in my telescope.", "score": 1},{"body": "I'm on mobile now, but don't worry. I saved your comment to tag you later as drunk leaky penis. ", "score": 1},{"body": "This is pretty much how I feel what with everyone else my age getting married and popping out kids... though not necessarily in that order.", "score": 1},{"body": "Are you gay?", "score": 1},{"body": "Your averyage Superdry model", "score": 1},{"body": "because it is only a orange !", "score": 1},{"body": "So deep.", "score": 1},{"body": "Not really. I can tell from the pixels around the paw that it's shopped.", "score": 1},{"body": "Oh, okay that's reassuring then, I suppose... kind? I'm not exactly a big /r/justiceporn person...", "score": 1},{"body": "I feel like this is how people in Mad Max would have dressed if it was filmed somewhere really up north. ", "score": 1},{"body": "Sweet Rizzo be in peace lil buddy.", "score": 1},{"body": "__^[wow ^such ^gold]__: ^/u/_lobster_ ^-&gt; ^/u/asprokwlhs __^Ð23200 ^Dogecoins__&amp;nbsp;^__($4)__ ^[[help]](http://www.reddit.com/r/dogetipbot/wiki/index)", "score": 1},{"body": "Found it here: http://www.buzzfeed.com/expresident/most-powerful-photographs-ever-taken#.udNvdZ8QO5", "score": 1},{"body": "hat barrier needs to be reinforced", "score": 1},{"body": "Ahhh right good lookin' out.", "score": 1},{"body": "\"Admit it!\"", "score": 1},{"body": "Yes. Stop being miserably single", "score": 1},{"body": "I'm pretty sure that even if you were traveling at relativistic speeds, and got somewhere and back in say 6 years, much more time would have passed on the planet you came from and everyone you know would be long dead.", "score": 1},{"body": "Makes me miss home. Im from 45 miles to your left.", "score": 1},{"body": "I bet you're fun at parties.", "score": 1},{"body": "i watched fury in one of these chairs. worth it. ", "score": 1},{"body": "You should watch the movie Filth. \n\nSPOILERSSPOILERSSPOILERS\n\nThat's basically the twist.", "score": 1},{"body": "Syria or Maryland?", "score": 1},{"body": "As a plus size person myself, you should work on your sense of humor :) ", "score": 1},{"body": "You're the good one.", "score": 1},{"body": "/r/circlejerk. But you'll have to try harder than that. ", "score": 1},{"body": "Thanks! I usually won't know if I like how they turn out until the next day, but with the glass it's like two different paintings, one on each side, this is one of the better ones I've done.", "score": 1},{"body": "That pug is like \"da'faq?\"", "score": 1},{"body": "Is it having extremely hot friends?\n", "score": 1},{"body": "In Dutch 'groot' means 'big'. Didn't know the reference. Have been staring for a while.", "score": 1},{"body": "came here for this", "score": 1},{"body": "I've been in your shoes &amp; just seeing your sweet boy's face made my heart sink. Thinking of you.", "score": 1},{"body": "They get what is called trunk ass (imagine the end of an elephant trunk) and an inability to control their bowels. \n\nSource: i read a lot of fucked up shit", "score": 1},{"body": "Anyone else immediately think \"haven't I seen these in M:TG?\" Great artwork.", "score": 1},{"body": "I'm aroused. ", "score": 1},{"body": "Where can I find these?", "score": 1},{"body": "How you doin?", "score": 1},{"body": "It's crazy, I find it mindblowing just finding nebulae in my telescope and seeing them as vague space clouds. ", "score": 1},{"body": "There's one not too far from me and I have no clue what it is. Sounds like a pharmacy.", "score": 1},{"body": "all men. ", "score": 1},{"body": "There is a Swedish saying: Det gäller att ha tungan rätt i mun.\nTranslated: You have to have your tongue in your mouth the correct way.\n(something like that).\n\nKind of sums this up for me. ", "score": 1},{"body": "Nah look at the base.", "score": 1},{"body": "Eh, some cultures cook and eat bugs right now, it's all about perception I guess.", "score": 1},{"body": "To be fair, all paintings are combinations of existing artwork at their core, just arranged in a new way. But I get what you're saying", "score": 1},{"body": "I too have a grey beard. ", "score": 1},{"body": "In 20 years of living in a big city in america I don't think I've ever seen an Asian homeless person.", "score": 1},{"body": "It's a brand new shirt covered in Storm Troppers. A gift from a coworker. ", "score": 1},{"body": "Most British name ever", "score": 1},{"body": "No, you need tiny steel shackles on it's legs. ", "score": 1},{"body": "Well...we have. I have conditioner with aloe in it. ", "score": 1},{"body": "It's a fun thing to watch when you have nothing else to do in the evening. \n\nThe ending was a bit disappointing though I feel. ", "score": 1},{"body": "Gives me that old fashioned romantic feeling that I'd do anything to bone them", "score": 1},{"body": "KGB", "score": 1},{"body": "As a resident...I'd just like to say at least Boring is true to its name. Happy Valley on the other hand...well, I find it neither happy nor very valley like. But hey, cool this part of the world made it into Reddit!!", "score": 1},{"body": "It's a brand new shirt covered in storm troopers. A gift. ", "score": 1},{"body": "Looks a lot like the character Ubishit were going to make Ajay Ghale in Far Cry 4.\n\n[This one](http://cdn2.vox-cdn.com/assets/4634615/10397841_249218638618868_2920608276632245941_n.jpg)", "score": 1},{"body": "So you were actually drunk when you drew this? Nice.", "score": 1},{"body": "Yes. Yes that's exactly what I did. You moron. ", "score": 1},{"body": "I'd fall asleep. ", "score": 1},{"body": "Kangaroos make decent enough pets as long as they have enough room to graze.  I don't think they make very good house pets though.", "score": 1},{"body": "I understood none of these references.", "score": 1},{"body": "Most probably that's what happened here.", "score": 1},{"body": "I don't get any of this..", "score": 1},{"body": "Tbf, I'm not treated like an asshole. I'm downvoted on a Internet website. I'm sure I'll get over it. ", "score": 1},{"body": "Where'd you get the shirt from?", "score": 1},{"body": "Ben Grimm is an asshole. ", "score": 1},{"body": "Dude...I'm all about that base.", "score": 1},{"body": "Now here are some leaks that would break the internet. ", "score": 1},{"body": "Still only 50 if you want to receive.", "score": 1},{"body": "Lommy Dragonborn\n\nThis checks out.", "score": 1},{"body": "You are my hero", "score": 1},{"body": "Son, I am disappoint", "score": 1},{"body": "I knew I would see someone from /r/screenprinting somewhere in this post!", "score": 1},{"body": "Wha...? That just doesn't feel right.", "score": 1},{"body": "I've done plenty of shop work when I started out. Hot gas/spatter mig welding works fine and looks decent. Now I mainly do structural iron work and scab welding in power plants as a contractor. The customer just wants the units to run. Speed is the name of the game. ", "score": 1},{"body": "You look like cobie smulders. Gorgeous", "score": 1},{"body": "Like a xan bar?", "score": 1},{"body": "Hey man. Its actually really cool and funny that you're making fun of people who identify as certain things. Your lack of acceptance towards others really shows your wisdom. I definitely think higher of you now. \n\n\n\n\n\n\nJk you fucking asshole", "score": 1},{"body": "This is the dream of a madman", "score": 1},{"body": "That wasn't even OP's comment.   I'm pretty sure it was just a joke.", "score": 1},{"body": "The internet has made you such a distrustful person :(", "score": 1},{"body": "Jesus, stereotype much? ", "score": 1},{"body": "'strailia", "score": 1},{"body": "Have you been introduced to /r/trollxchromosomes yet?", "score": 1},{"body": "Really astounded to see this anywhere in the US.", "score": 1},{"body": "[.] (http://youtu.be/Ja06DJrFe5E)", "score": 1},{"body": "Black bridesmaids' dresses, that's different.", "score": 1},{"body": "You're wicked smaht.", "score": 1},{"body": "n", "score": 1},{"body": "The ending was when I decided", "score": 1},{"body": "I always thought magnetic field is induced only during procedure - and can be quickly turned off in case of emergency. Never thought this magnet is always on and is so strong. Then what about patients with metal parts inside their body that were missed during control procedure before MRI? Has such accidents happened?", "score": 1},{"body": "He was nowhere to be seen when I took an orange.", "score": 1},{"body": "depends who's doing it, a team of rope workers used to awkward construction jobs would solve it in no time without any real risk. A tensioned X web as used when working with things in high winds or under strong ocean currents, a few long scaf boards to brace the door and a little windlass and it's done.   ", "score": 1},{"body": "I hated how much they wasted an entire season on their wedding, only to break it up the following episode", "score": 1},{"body": "nice pic. keep sharing cool stuff..have a nice day", "score": 1},{"body": "Fair enough", "score": 1},{"body": "Is that wallace hall?", "score": 1},{"body": "I will happily give her my bouquet *if you know what i mean*", "score": 1},{"body": "Confirmed redhead. My mom used to grow a few aloe plants for me and that was so great. I have some aloe gel now which is pretty good, but fresh is just amazing.", "score": 1},{"body": "That hair! ", "score": 1},{"body": "It's been two hours, you should've seen 30 by now", "score": 1},{"body": "It's the only place they belong.", "score": 1},{"body": "brooo did you even down vote me. Disrespectful.", "score": 1},{"body": "I like you! ", "score": 1},{"body": "My cousin's kid broke my other cousin's kid's gameboy. His dad immediately got asshole kid's gameboy from the car and gave it to the other kid.\n\nI swear I wanted to drink that little asshole's tears.", "score": 1},{"body": "he is groot", "score": 1},{"body": "I knew this was going to be about alcohol before seeing the picture", "score": 1},{"body": "How are you not bothered by all the black dresses? That was the first thing that caught my eye.", "score": 1},{"body": "What is that touching the dude's crotch?", "score": 1},{"body": "Well, to be honest, you are (at least to me) the best looking out of the group, so you don't need to worry about silly stuff like bouquets etc.", "score": 1},{"body": "Doug?", "score": 1},{"body": "Time to get a white collar. ", "score": 1},{"body": "Working out well because splitting up isn't a real option isn't a good thing.\n\nI don't think marriage in general makes a lot of sense, but choosing your partner, or having partners whenever you want them makes way more sense than having someone randomly chose for you and not being able to do anything till then.", "score": 1},{"body": "Think I'm in love :)", "score": 1},{"body": "I'd probably go to the movies more if they all had these.", "score": 1},{"body": "And to me last week. I loaded some lumber into my station wagon, in a hurry. the longer boards were stacked on the front dash, but not in the right order (which would have been the longest on the bottom, because the front window slopes inward). I squeezed the back hatch door shut. While putting the cart away, I heard a loud POP from my car. Damn. front window cracked.", "score": 1},{"body": "That's because the sentiment is bullshit. There is some old superstition that tattoos without outlines will somehow magically turn to mush, as if a little line of black on the outside can somehow hold it in. It's agonizing to me how many artists still believe in that ridiculous crap. \n\nTattoos blur depending on age and skin, and fade depending on exposure to sun. If anybody tells you they have a tattoo that needs touching up \"once or twice a year\" then either the guy is lying to look cool or his artist is a back-alley scratcher that keeps putting the ink too deep or too shallow into the skin.", "score": 1},{"body": "Yeah cause slightly overweight people never get married.   It just ain't happening.  In what universe does a sense of humor come in to play when gratuitously insulting people.  ", "score": 1},{"body": "Then Tony busts out the vacuum...", "score": 1},{"body": "Theres a guy who looks exactly like him in my city. He is mentally disturbed. Had his shirt off this weekend.. Was 40 degrees too. All he does is pace back and forth between 20 meters. ", "score": 1},{"body": "Well, finger painted it, yes", "score": 1},{"body": "The most important part of this photograph is the girl who obviously doesn't give a shit whilst sipping a martini glass sans martini.", "score": 1},{"body": "Syria", "score": 1},{"body": "I think you mean 90 degrees.  If you tilt 180 degrees you are standing on your head.", "score": 1},{"body": "I had jaw surgery 5 months ago and had 8 screws and 2 plates put in. \n\nThe surgery was done by a licensed, well-known surgeon in the United States. I have no idea what metal is in my jaw.\n\nDo I have to worry about my jaw being torn to shreds or boiling to death if I have another MRI? ", "score": 1},{"body": "Only good bitch is a drunk bitch us feel me bois?", "score": 1},{"body": "Reminds me of tiny Groot", "score": 1},{"body": "Much thanks fellow doge, I'll try to find my old wallet and see if I can start gilding shit too!", "score": 1},{"body": "BASE jumping! ", "score": 1},{"body": "Shove women, catch bouquet.  Light bouquet on fire, throw again.  \n\n\nNo one will call you by name any more.  ", "score": 1},{"body": "The concept of an attractive person willingly making that fact known online can be a bit hard to believe at times, and Reddit doesn't like being lied to. For what it's worth I'm willing to believe, it doesn't hurt or help me either way.", "score": 1},{"body": "Yeah I'm aware. I gave them a thumbs up for attempting.", "score": 1},{"body": "He wanted to surprise you. You ruined his surprise.", "score": 1},{"body": "&gt; I like how it's clearly a piece of aloe vera.\n\n", "score": 1},{"body": "M'mography", "score": 1},{"body": "Yeah i'm glad I got to be part of the 90's. At least when im a bit older I can revel in the fact I experienced one of the last definitive/memorable decades. I'll lord it over those disgusting \"millennials\". Sure we've had technological advances and such like in their time but it sure as fuck was nothing to do with them. \n\nI really wonder what these ipad shafting, chino wearing, slicked back haired fucks will contribute in the future, not that I'm contributing a whole lot currently but fuck them, I'm the last of a dying breed.", "score": 1},{"body": "I live in southern WI where these things have just recently become more common. Last fall while I was waiting at a red light I noticed a little black mouse running along the curb and I pointed it out to my kids. Seconds later a spider like this came running out of the tall grass to chase it. We use to enjoy camping...", "score": 1},{"body": "&gt; and I did not want to risk the embarrassment of leaky penis in front of all my friends\n\nIf you're worried about pissing yourself in front of your friends, you need new friends.", "score": 1},{"body": "Nice to see Britney Spears could make her mates wedding", "score": 1},{"body": "Liquid xanax in jungle juice: The one true party drink", "score": 1},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text.", "score": 1},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text.", "score": 1},{"body": "What is going to happen now? Is she taking donations.. such a sad situation. Im sure she loved her babies very much.", "score": 1},{"body": "One in a million, or at least several. ", "score": 1},{"body": "All you gotta do is fix your Dwight hair style and you're golden. ", "score": 1},{"body": "Who is the curious fellow in the background?", "score": 1},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text.", "score": 1},{"body": "I caught the bouquet and my SO caught the garter. Bride's Marine decorated father looks at us, pauses, and says, \"3 months or less.\"\n", "score": 1},{"body": "Y'know, I actually skipped that entire comment thread because I assumed it was a joke. Now I don't really know what to think.", "score": 1},{"body": "*Fell", "score": 1},{"body": "My wife took the picture. It's from Aomori prefecture, Japan.", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "I am not single but that would totally be me. I'd probably look at the bouquet with a bored face while it's falling down and then try not to step on it on the way to the bar :P", "score": 1},{"body": "Bullshit. Tattoos are ink in skin. *ALL* tattoos are ink in skin. They fade over time when exposed to sunlight, they blur with age depending on the skin. The idea that somehow thick outlines will make them more \"stable\" is fucking ridiculous.\n\nStrong contrasts will make an equally blurry tattoo appear more clear, sure, but that's about it. If your friend needs touch-ups twice a fucking year, then what he truly needs is a new artist. Tattoos only blur that quickly if they're underneath the skin or too far in the upper layers. ", "score": 1},{"body": "` `", "score": 1},{"body": "\"The Kennedy Package.   Yes, sir.\"", "score": 1},{"body": "We have one of these theaters where I live. It *completely* destroyed the other regular theater in town. If the new one is sold out, \"I didn't want to see it anyway\" is the common response.", "score": 1},{"body": "*best case", "score": 1},{"body": "Been trying to slide into your DM, guess you're still drinking.. ", "score": 1},{"body": "Couldn't you just clone the new card you get to this one and keep on using it?", "score": 1},{"body": "*tips bonnet*", "score": 1},{"body": "Yes girl! ", "score": 1},{"body": "My great grandmother has had one on her back porch as long as I can remember. Whenever I would get a cut or scrape at her house it was always the remedy. ", "score": 1},{"body": "Recent college grads are that aren't already know what engaged?  I must be in the wrong part of the south.", "score": 1},{"body": "Well, we found it guys. It took a while, but we finally got to the part of the thread where people stop commenting on how funny the picture is and just start trying to flirt with a hot woman on the internet, probably thousands of miles away. It took longer than usual.", "score": 1},{"body": "*tips spatula* m'cdonalds", "score": 1},{"body": "Based on other shit I've seen on the runway, this actually doesn't look bad at all", "score": 1},{"body": "As someone who is single and hates going to weddings that's exactly what I do. Just drink. Damn straight you have your priorities right OP. What did was it btw?", "score": 1},{"body": "Brb getting hair aloe ", "score": 1},{"body": "This stuff saved my life when I was on vacation in Bermuda. The actual plant worked a hell of a lot better than the commercial product too!", "score": 1},{"body": "Really? Then why do they never say \"black hot\", \"brown hot\", or \"yellow hot\"? It's always \"white hot\", \"red hot\", or even \"hot pink\".", "score": 1},{"body": "&gt;Jesus, stereotype much? \n\nSorry? What am I stereotyping? Those procedures are common enough here to be noticeable- as in the above pictures. They are usually not an expense in which the average McDonald's employee can indulge.", "score": 1},{"body": "Leather seats make too much noise when you move on them.", "score": 1},{"body": "Is that sweet dee?", "score": 1},{"body": "Is it ... is it a stereotype already ?", "score": 1},{"body": "Can't think of anything that it tastes like, an old ad campaign insisted it's made in Scotland from girders. It is delicious and so unique, one of the more refreshing soft drinks.", "score": 1},{"body": "I'm way late, but I decided to draw him.\n\nhttp://i.imgur.com/BHH9w4z.jpg", "score": 1},{"body": "Awesome!", "score": 1},{"body": "It bugs me to no end that people *still* buy into the ridiculous superstition that tattoos without outlines are somehow more prone to bleeding. Tattoos, *all* tattoos, are ink in skin. They blur and fade at the same rate, depending on the same conditions. Different colors may have different half-lives, but I can guarantee that all of them last longer than two years.\n\nStop going to back-alley scratchers that mix their own ink, and you're gonna be fine. Even with a tattoo like this, even after two years.", "score": 1},{"body": "I'm not arguing with that one. Although if you are pulling a 2 1/2 for a vehicle fire anyone running towards it has a death wish, or they really like to work harder. ", "score": 1},{"body": "I want one! ", "score": 1},{"body": "[Insert meme here  to ride the karma choo choo]", "score": 1},{"body": "You bear a striking resemblance to Olivia Wilde", "score": 1},{"body": "I'm betting at least one of them is a dude.", "score": 1},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text.", "score": 1},{"body": "that's fine and all, but canadian whisky is still spelled without the e. as pro-e as you are, it won't change the weird way canadians do things.", "score": 1},{"body": "She looks like someone who would be fun to drink with and people watch.", "score": 1},{"body": "Honestly? Better than usual!", "score": 1},{"body": "Does this have to do with scanning through three dimensions rather than just capturing information about chemical shift? i.e. the difference between a NMR spectrometer and an MRI machine?\n\n(Sorry, I'm half brain dead from a bitch of the day in the lab, and it's been nearly a decade since I've had to seriously think about NMR spec or MRI data... I'm a PhD level molecular geneticist dammit Jim! Not someone with real knowledge!)", "score": 1},{"body": "https://www.etsy.com/shop/TrendingTops?ref=shopsection_shophome_leftnav", "score": 1},{"body": "He asked for a thirteen but they drew a pretty bird.", "score": 1},{"body": "Yes, raising and caring for a roo is so unbelievably cruel. As opposed to the Australian government funded mass-culling of kangaroos, whose executions now number in the 10's of millions.", "score": 1},{"body": "And that kids, is how i met your aunt Robin.", "score": 1},{"body": "Your submission was removed as it violates rule VI: Submissions must link directly to a specific image file or to an image hosting website with minimal ads.", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "w   h   y", "score": 1},{"body": "You are my spirit animal. Let's be best friends. ", "score": 1},{"body": "Your gramps is smart. He knew you would never have a chance of getting in based on your looks alone.", "score": 1},{"body": "You got your priorities damn straight damnit, say Fuck yea!", "score": 1},{"body": "If i was in a room next door to an MRI and my keys were in my back pocket, would the force of the magnet be strong enough to pull my bossom through the drywall into the next room?", "score": 1},{"body": "We have to sit on coffee cans in my country. I'm jealous.", "score": 1},{"body": "This is me during the garder toss (sp)? But closer to the bar.", "score": 1},{"body": "What did it say?", "score": 1},{"body": "Darn. I just spoiled a movie that I haven't seen for myself. :-) ", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "Your submission was removed as it violates rule III: No personal information, missing persons requests, or witch hunts", "score": 1},{"body": "The fattie really wants it.\n", "score": 1},{"body": "Thanks for the link. Im more interested in this...\"human flesh search rngine\" the article mentioned. ", "score": 1},{"body": "You have a nice face", "score": 1},{"body": "Now that you mentioned it,  the ergonomics suggest that you are correct.  Wooden knuckles with fins...", "score": 1},{"body": "My kinda woman,\n\nps, the guy in the back on the right.... looks like hes about to say \"SHHIIIIIITTT!\" ...his girlfiend must be one of the crazies in front..", "score": 1},{"body": "Cats are the best medicine!\n\n(but keep taking the *actual* medicine your  doctor gives you, too!)\n\n:-)", "score": 1},{"body": "no... He surpassed me, alright.", "score": 1},{"body": "His work is indeed great, but most of it is dotwork and newschool, nothing even remotely close to watercolor work like OP's birdy.", "score": 1},{"body": "Well, I guess I'm moving again. To Scandinavia I go. Then a visit to Taiwan during Christ-Mass. ", "score": 1},{"body": "Eh, some cultures are beheading street magicians right now, it's all about perception I guess.", "score": 1},{"body": "She also has a koala hugging the right side of her stomach.", "score": 1},{"body": "Hoe come the hotter one is a single? Illuminati alert!!", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "\"Vidgo Morgenstein\" is my favorite part.", "score": 1},{"body": "Your submission was removed due to a broken link", "score": 1},{"body": "I give you... Derelicte!!!\nhttps://www.youtube.com/watch?v=zkOBAEa9wn8\n", "score": 1},{"body": "Found the unattractive person!", "score": 1},{"body": "Oh wow, here's a clever and original objection that nobody ever mentioned before.", "score": 1},{"body": "And we have crashed her party.", "score": 1},{"body": "Outside", "score": 1},{"body": "Good. I know more than one officer who puts public safety and keeping the peace over enforcing the law.\n\nBut then again, this is Canada, some attitudes are fundamentally different, despite huge similarities in culture between Canada and the US, or even Canada and other commonwealth countries. ", "score": 1},{"body": "That's how the Canadian do", "score": 1},{"body": "For all of you wondering what OP's on about, look over her shoulder. ", "score": 1},{"body": "Just remember when camping: #keepcountingthekids", "score": 1},{"body": "We have one in Plymouth, Minnesota that just renovated all of their seats to this!", "score": 1},{"body": "There are Sheep and then there are Wolves.", "score": 1},{"body": "Pink George Carlin", "score": 1},{"body": "\"featured\" as in \"Not my work / stuff I find cool / stuff friends did\"", "score": 1},{"body": "this is gold..looks like something out of a sitcom or a movie haha", "score": 1},{"body": "Never heard \"pink hot\" before.  Red and white hot are in reference to how hot metal gets.", "score": 1},{"body": "Try the ones without added sugar...", "score": 1},{"body": "Next time you have a wedding to go to and not give a fuck, let me know. I'll not give a fuck with you.\n\n-Single dude", "score": 1},{"body": "Yep...watch for some Paris or New York designer go GQ with this for the next season", "score": 1},{"body": "no TIL every following month until eternity?", "score": 1},{"body": "This is all well when there are only a few employees but when you have too many employees to take every persons grievances to heart then you need a union, even a small union that is just there to ensure staff are treated fairly and supply support when the employee would rather fire them than resolve an issue it gives the employee a little bit of power they would not have as an individual", "score": 1},{"body": "Okay judge judy ;)", "score": 1},{"body": "I thought that white thing in the background (statue), is a condom that's thrown mid-air. Sorry Mary. You're a condom :(", "score": 1},{"body": "I was just messing around and made it and thought it looked cool. But I ended up being fake and thirsty. So that was fun..First and last time I'll ever post a picture of myself on Reddit. - But for what it's worth, thank you.", "score": 1},{"body": "Time to burn everything and move. ", "score": 1},{"body": "Was not disappointed by this picture\n", "score": 1},{"body": "This reminds me of some album cover or something. Any ideas?", "score": 1},{"body": "For the first time in 20 years, I really miss Iowa.", "score": 1},{"body": "Thank you :)", "score": 1},{"body": "Bad title and wrong sub. ", "score": 1},{"body": "Albany/Berkeley, the specific place is called Albany bulb", "score": 1},{"body": "So now we know who got Mugatu's Derelicte campaign", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "I can tell by looking that this picture was taken *after* he hit her multiple times in the face with that huge gavel. ", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "Ah yes that era of time when we called fat kids \"husky.\"", "score": 1},{"body": "If it had ended 5 minutes earlier, it would've been a great ending though.", "score": 1},{"body": "Hated every union Job I worked at. Eevery one there always this one fuck-up who couldn't be fired because of whatever dumb reason suited them. it always made everyone else's job HARDER. Every non-union job i've worked at I advanced faster got paid more and didn't have to deal with stupid co-worker who couldn't do it right because that person always got fired without 5 exactly worded warnings first. ", "score": 1},{"body": "It's like a scottish creaming soda", "score": 1},{"body": "Nice to see life is treating Tyrol well since the events of the Battlestar Galactica", "score": 1},{"body": "I'd totally bang him. Hot homeless guy. Damn it, China!", "score": 1},{"body": " A Little more than a decade...", "score": 1},{"body": "KGB who?", "score": 1},{"body": "If no access to Photoshop, http://www.pixlr.com", "score": 1},{"body": "Its an illusion because he spent it on the bus", "score": 1},{"body": "sorry this is my problem not yours ):\n:D", "score": 1},{"body": "Cool! Nobody ever seems to know about Muscatine. Always fun to see Iowa mentioned on Reddit, considering all the kind comments from those who have lived/been there.", "score": 1},{"body": "Yes it does.", "score": 1},{"body": "Who wears black to a wedding?", "score": 1},{"body": "*tips m'orange", "score": 1},{"body": "So she just thought she was gaining weight for no reason? I mean that's obviously a pregnant frame. How do you wait that long to be like \"hmn something is off...\"", "score": 1},{"body": "Eh that expression means happy in humans but dogs don't smile like we do. People always interpret animal expressions in human ways, when they usually communicate pretty differently than us. Even the ones that do use facial expressions attribute different meanings to the same ones, for example chimpanzees smile to show aggression - baring their teeth is a threat. \n\nI bet he is pretty damn happy though! ", "score": 1},{"body": "Yes. He just said he was too tired. What don't you get about that?", "score": 1},{"body": "\"Married sex or drunk sex.....better drink more\" ", "score": 1},{"body": "Artistě", "score": 1},{"body": "/r/thingsforants", "score": 1},{"body": "I've seen these before, thank god there's never any people in them when it happens. ", "score": 1},{"body": "All alcoholics want to do is get drunk, but that doesn't mean you can't safely take it in small doses.", "score": 1},{"body": "Agreed,  if we all down vote together perhaps we can defeat OP", "score": 1},{"body": "Yeah.  Like Canada.  Watch out, you commie bastards!", "score": 1},{"body": "Pretty sure it's just missing an eye.", "score": 1},{"body": "planned. why be there otherwise if you weren't interested?\nprobably uploaded before you left the venue you were so boosted. ", "score": 1},{"body": "Triggered-kin\\*", "score": 1},{"body": "Pretty sure those are modern women.", "score": 1},{"body": "Sometimes there just aren't enough rocks.", "score": 1},{"body": "I love that *leaky penis* is italicized for emphasis every single time it is used in this post.", "score": 1},{"body": "Was expecting a giant \"your mom\" at the end.", "score": 1},{"body": "you mean a kid, she had a kid in her cart.", "score": 1},{"body": "I just spent the last hour going through his deviantart site because of this post. Thank you. :-)", "score": 1},{"body": "Not to hookers, though. ", "score": 1},{"body": "someone was trying to escape from inside of her", "score": 1},{"body": "No because I did too ", "score": 1},{"body": "Does the adult diaper have the sort of velcro straps on the side for more of a custom fit or is just Huggies pull-up style?  ", "score": 1},{"body": "Is that Dee from Always Sunny? ", "score": 1},{"body": "I guess since the casing is plastic (?), it could have built up a static charge lifting your hair. It's nothing to do with magnets though and not worse than rubbing a balloon and holding it over your head.", "score": 1},{"body": "Digging that comic sans storefront.", "score": 1},{"body": "That's what my work has as well.  Two small, closet sized \"bathrooms\" that have a toilet, and sink.  Pretty crazy concept I know.", "score": 1},{"body": "And that kids is how I met your mother", "score": 1},{"body": "Damn, son. You went full Big Bang Theory with that analogy. ", "score": 1},{"body": "Professor Snape?", "score": 1},{"body": "osu... heh", "score": 1},{"body": "Is this in Cleveland, Ohio?", "score": 1},{"body": "I know thatthusbwill get buried but here goes... \n\nThe Indian logic for investing in gold,  which may do not remember now,  is to invest in fast appreciating,  easily liquidated security. \n\nThe Indian government,  even after trying for decades,  is still not as pro people as many other nations.  The pension given, to only a few people who have worked in government jobs or fall under special categories,  is a pittance.  So in essence to secure your future,  you have to save for a rainy day. This is the best way in the Indian economy.  \n\nEasy to purchase,  easy to sell,  value appreciates quite well,  no risk investment and easy to store. \n\nMany Indian families have to sell of their gold when on need of money in urgent situations. \n\nHope this explains. ", "score": 1},{"body": "Oh man, haha, no it certainly didn't.  I shot people, and other than the ballistics calculations at range, that doesn't take a lot of brain power.  The ChemE degree I got with the benefits did though.\n\nAlso, I'd highly encourage you to find your nearest VFW and walk in using air quotes when you say service.  Especially if you're telling them all they should love America like you do.  Let me know which town you're from before you do though, so I can watch the news!", "score": 1},{"body": "Is there an article or something? ", "score": 1},{"body": "Am I the only one who owns a [**Jack Lalanne Juicer?!?!?!?!?!?**](http://imgur.com/L319pXh)", "score": 1},{"body": "I'm too scared to move....", "score": 1},{"body": "As a really really white person, often called a vampire, I have to agree with you. ", "score": 1},{"body": "I was really just riding the bad karma caboose... it was more fun when I was drunk. Now, I just feel like an ass.", "score": 1},{"body": "Gemini is sick.  It's got the double vision effect going. ", "score": 1},{"body": "No, you're mistaken, a designated driver is the word, \"taxi\", or, also correct but used but less often, \"hotel\".\n\n\"Wife\" stands for \"designated driver for half the time, because she likes to make going out with your side of the family bearable asswell.\"", "score": 1},{"body": "Who is that super heroine?", "score": 1},{"body": "Cineapolis is one.", "score": 1},{"body": "What's wrong with it? It's minimalist.", "score": 1},{"body": "I skipped it. Instead, I gave my bouquet to the female guest who had been married the longest. I made a fun game out of it.", "score": 1},{"body": "So, Im getting downvoted but I don't know for what reason. Is bad, already done, offensive, uninspiring? Unfunny? I'm I so ugly? If anyone answer me it would be appreciated.", "score": 1},{"body": "Vargas is a national treasure. ", "score": 1},{"body": "Well ofcouuuuurse. But they are wearing the ancient dresses and clothing of my people. Just like how any people would wear the clothes of their ancestors to commemorate them. Like how the Chinese would dress up in their ancient traditional garments at special cultural occasions. Its how we pay respect to our ancient roots ", "score": 1},{"body": "Why haven't we found a way to make our vegetables this big commercially?", "score": 1},{"body": "&gt; (but not from modern-day Germany)\n\nNo no we indeed are part of the Federal Republic. The reason we're not Danish any more is that the Kaiser wanted a channel (to be precise, the Kiel Channel) to move the flotilla between Baltic and North Sea without being shot at by the Danes, so he set out to conquer.", "score": 1},{"body": "ChedRPeppers are the best. Get ranch for dipping. I'm also obsessed with the diet cherry limeade--diet sprite with a little cherry syrup. ", "score": 1},{"body": "unbereavable.", "score": 1},{"body": "Nice example.", "score": 1},{"body": "Well, do what ever you like OC, I don't care about karma. But downvotes, that bothers me.", "score": 1},{"body": "Aaaah hahaha. Well that's awesome. ", "score": 1},{"body": "Dat ass on capricorn", "score": 1},{"body": "So, how many messages have you gotten asking you out on Reddit now?", "score": 1},{"body": "That made me laugh. Thank you.", "score": 1},{"body": "Jackdraws. ", "score": 1},{"body": "Well, do what ever you like OC, I don't care about karma. But downvotes, that bothers me.", "score": 1},{"body": "This is my new desktop wallpaper.", "score": 1},{"body": "Get out of here with your scientists' lies!", "score": 1},{"body": "I live in Council Bluffs &amp; plan on giving my boyfriend a tour of Iowa soon. Things like this prove Iowa is actually a place worth living &amp; loving! ", "score": 1},{"body": "The birds in this picture make it look really ominous. Love it.", "score": 1},{"body": "Her shoulder looks like her other boob in the thumbnail", "score": 1},{"body": "This photo screws with my eyeballs", "score": 1},{"body": "I drank out of the wrong tartan.  My ancestors will be rolling in their graves...Not..\nTartan is a mostly 19th century creation made by bored Victorians who yearned for a past that didn't exist.", "score": 1},{"body": "I think maybe it is a tradition that is on it's way out.  As the concept of women being only wives and mothers evaporates I think the bouquet toss will be shunned.  I personally find it a little demeaning but I have faced a lot of pressure from my family to wed and a lot of frustrating double standards about having a career AND a husband AND kids without really being given the time to do any of it properly before the interrogations start.  I'm sure to a lot of women it is a sweet tradition but I hope they can get over it when a few of their friends choose not to participate.", "score": 1},{"body": "Funny thing is she's the most attractive, and her vibe is wayyyy better", "score": 1},{"body": "You missed the word aroused OP", "score": 1},{"body": "I will take one alcohol please.\n", "score": 1},{"body": "Well I'll be Damned...some people really don't like ancient african culture. Smh", "score": 1},{"body": "my dog suddenly doesn't want to come inside the house.  Even for his meals.  He joins me for walks and behaves perfectly normally and happily away from the house, in the car etc, but when we get near home he won't come in the house.  He is 9 and has epileptic fits every month or so but has never behaved like this before.  He is currently sitting on his own in a field about 100 yards away and has not been in for his supper.", "score": 1},{"body": "I upvoted it just for you.", "score": 1},{"body": "It's like being in my lounge room with hundreds of people I don't want to meet!", "score": 1},{"body": "/u/iced327 crafts a custom Facebook cover / profilepic for an attractive woman, with the hope she will use it, and he/she can use Google image search to uncover her Facebook.\n\n\nClever person, you are.", "score": 1},{"body": "&gt; how the hell he would clean up the mess\n\nPut up a sign \"Free Eggs\".", "score": 1},{"body": "I'm drinking poo juice.\n\n-Bill Gates\n\n", "score": 1},{"body": "Green tea?! Sort it out mate. ", "score": 1},{"body": "http://karmadecay.com/user/GallowBoob", "score": 1},{"body": "Now my favorite as well. ", "score": 1},{"body": "Ugh!", "score": 1},{"body": "because rhinos breath out of their horns", "score": 1},{"body": "i wonder what the comments will be", "score": 1},{"body": "Thats beautiful. ", "score": 1},{"body": "This is bullshit!\nI can just take pictures of all the crap urban outfitters sells and make front page? I frackin work there! I'll be back!", "score": 1},{"body": "Likewise! I always drive to a wedding to allow my husband to take full advantage of the open bar.  Someone's got to do it! Plus I always die laughing capturing some cracker photos! ", "score": 1},{"body": "Your so random!", "score": 1},{"body": "Thank you! I didn't even notice them!", "score": 1},{"body": "THAT. IS. FUCKING. AMAZING!!!!!!!!", "score": 1},{"body": "Balloon nets are common in stores now...did you not know this?", "score": 1},{"body": "It took her until she was like 6 months pregnant to figure it out?", "score": 1},{"body": "Oh yeah, he is hot!", "score": 1},{"body": "http://imgur.com/B2X0e3G", "score": 1},{"body": "So you got a car??", "score": 1},{"body": "Marry me", "score": 1},{"body": "Ehh pics is a terrible sub anyway I feel bad you have to even shift through these posts to do your job ", "score": 1},{"body": "http://i.imgur.com/VjhCG0C.gif", "score": 1},{"body": "Your welcome, it really is a good picture. ", "score": 1},{"body": "Thank you for bringing me home.", "score": 1},{"body": "You're doing flowers wrong. ", "score": 1},{"body": "...if elsa was getting ready to give me the sloppiest, coldest blowjob ever.", "score": 1},{"body": "40 degrees is pretty damn hot though.", "score": 1},{"body": "Are you robin sparkles?", "score": 1},{"body": "Woulda called crabapple (Malus Ioensis Plena) myself by the bark and flower.", "score": 1},{"body": "Before reading the 'drinking' part i thought it was shampoo lmao.", "score": 1},{"body": "&gt;While many netizens found it hard to believe that such a handsome man could be homeless...\n\nInteresting.", "score": 1},{"body": "In the first picture he seems to be giving the middle finger to the heavens. ", "score": 1},{"body": "Maybe with a projector, but I guarantee it was done without, its not quite accurate enough to be a trace.", "score": 1},{"body": "i'm not sure if you're getting it or not", "score": 1},{"body": "These are always the women I've looked for in bars or at parties etc.\nComing up on 8 years together. ", "score": 1},{"body": "Hottest babe in the house. Let them chase the flowers while men throw themselves at you.", "score": 1},{"body": "Take a thin copper wire, neatly wrap it many times (30 plus) around a steel nail, connect each wire end to a pole of a 9V battery. You now have an electromagnet. Disclaimer: The 9V will heat up in not too long as this is shorting it for maximum current flow. Don't keep it connected for more than a few seconds at a time.\n\nIt won't be super powerful, but it should pick up paper clips, ect.", "score": 1},{"body": "Two useless people! !", "score": 1},{"body": "I have to say, that was probably one of the most \"WTF is happening\" films I have ever seen.  ", "score": 1},{"body": "Is it just me or is a slim Kim Jong Un standing behind the lady to her left?", "score": 1},{"body": "I don't think ruthless beheadings of innocent people are comparable to eating land shrimps.", "score": 1},{"body": "and those are just the dudes.", "score": 1},{"body": "http://vimeo.com/92071732", "score": 1},{"body": "Has it's tennis ball toy too. Good dog.", "score": 1},{"body": "Nope, he's got eyes on most imminent threat; the person taking picture. Not trying to blend in, trying to make sure threat has to go through him to get to sheep. Dog is doing his job and doing it with calm, steely-eyed determination despite looking adorable. ", "score": 1},{"body": "Most of the thermostats in modern office buildings are placebos.  They pacify the masses.  ", "score": 1},{"body": "\"Marry someone richer than you, and then you will be richer too.\" - Me. ", "score": 1},{"body": "Those jeans were basically sweatpants. ", "score": 1},{"body": "I thought the ending was weak as shit. How did it cause everything to suddenly make sense? What reveal are you talking about? \n\n**SPOILER BELOW**\n\nDo you mean the part where old mate at the back of the train and Ed Harris were working together? That shit became fairly obvious pretty early in the film. Nearly as obvious as the fact that the children were being abducted to keep the train running somehow, which seemed the case the second you saw that guy's kid get taken. Those are the only reveals I can think of, outside of the earth slowly beginning to thaw, which wasn't that interesting.\n\nDon't get me wrong, I still enjoyed the film, in the same way I enjoy other stylised action romps, but I don't think it's the cult classic that a lot of the film media is trying to spin it as. The fact that it's sitting at 95% on Rotten Tomatoes seems so completely absurd to me.  \n\nI genuinely think that the drama surrounding the film's stunted release due to Weinstein getting his panties in a knot did a lot to help the film's reception once it became more widely available. It's a decent action flick, but it's not the well-crafted classic so many outlets are selling it as.", "score": 1},{"body": "To find out, look at any comment from a guy on a woman's \"became single\" Facebook status.", "score": 1},{"body": "until they run out of booze, then panic sets in. ", "score": 1},{"body": "BECAUSE ICE CREAM. IS A FEELING.", "score": 1},{"body": "Judging by your username, you'll need to get some custom made.", "score": 1},{"body": "How has this not been gilded? Here you go.", "score": 1},{"body": "That's a startup there already. ;)", "score": 1},{"body": "They are not dressed as some kind of pink french maids. They are dressed like little girls in doll like dresses. A lot of the fashion is doll like and cute.", "score": 1},{"body": "This is how I make up names for my dog. It's always gibberish, and has the same syllabic rhythm (not sure that's a term). Goodlebutt Spundercraft for example.", "score": 1},{"body": "Some tiny dude can lie in it and play the worlds tiniest violin, if he can get it away from my mum who plays it non-stop (it's funnier the more you play it I'm guessing). ", "score": 1},{"body": "Fucking let me in cunt", "score": 1},{"body": "/r/upvotedbecausegirl", "score": 1},{"body": "Thank you, I seem to be gathering downvotes for committing the sin of asking a genuine. Between you and Diabolico, it's been really cleared up, thanks :)", "score": 1},{"body": "The guy in the fleece looks like he is having a bad day.", "score": 1},{"body": "...because they are pests to us.", "score": 1},{"body": "I cri ery tme", "score": 1},{"body": "Well there's also the difference that in analytical NMR in a lab, you irradiate your sample with EM radiation at specific frequencies. In MRI you don't irradiate patients so which the nuclear part is still technically relevant (still aligning the spin state of nuclei using a magnetic field), you're not using radiation anymore.", "score": 1},{"body": "Space between ever and !", "score": 1},{"body": "Only works if you post it in a sub that allows memes", "score": 1},{"body": "Hummus is not generally eaten in India, it's middle eastern.\n\nMom's curry would have been better. ", "score": 1},{"body": "You should take her to disneyland.. the girl might generate enough karma for \"special purposes\"", "score": 1},{"body": "Think I'm in love, said every guy ITT, but me the mostest! ", "score": 1},{"body": "No gloves were worn in the making of this burger. ", "score": 1},{"body": "That's what the ghost would want you to think. It's literally the perfect crime.", "score": 1},{"body": "So much rich mahogany.  ", "score": 1},{"body": "Read that as pooping a blood vessel ", "score": 1},{"body": "Your (original) pug and I both agree that's the most horrific thing we've seen this year.", "score": 1},{"body": "http://en.wikipedia.org/wiki/Jaguar_warrior\n\n(via Age of Empires II)", "score": 1},{"body": "people really underestimate big magnets hu ", "score": 1},{"body": "http://en.wikipedia.org/wiki/Nepomorpha\n\n", "score": 1},{"body": "of course not, we're stuck in front of a computer screen 18 hours a day instead of living, getting outside 2 hours a day would probably give us more original thoughts than a lifetime of Reddit, just sayin'...", "score": 1},{"body": "Jennifer Lawrence and Emma Watson in the same picture? Get ready for the Karma tidal wave.....", "score": 1},{"body": "No doubt... I'm currently living in Kaohsiung and they definitely do not dress like this. ", "score": 1},{"body": "Probably in pain because of the chlorine in the water :)", "score": 1},{"body": "In fact other cultures do this. An Irish friend of mine was given a plain-looking bracelet by her dad when she left home to go travelling. It was actually solid gold and was for her to use in an emergency.", "score": 1},{"body": "Shoutout to /r/picsoftinyasstrees!", "score": 1},{"body": "But... How?", "score": 1},{"body": "That's the new GE model... that's a 5-million dollar machine.", "score": 1},{"body": "He's probably trying to tell you that he isn't a hipster. Such a hipster thing to do. ", "score": 1},{"body": "Ugh I miss Boulder. I want to move back.", "score": 1},{"body": "Redditors. ", "score": 1},{"body": "I thought the ending was weak as shit. How did it cause everything to suddenly make sense? What reveal are you talking about? \n\n**SPOILERS BELOW**\n\nDo you mean the part where it was explained that old mate at the back of the train and Ed Harris were working together? That shit became fairly obvious pretty early in the film. Nearly as obvious as the fact that the children were being abducted to keep the train running somehow, which became apparent once you saw that guy's kid get taken. Those are the only 'reveals' I can think of, outside of the earth slowly beginning to thaw, which wasn't that interesting.\n\nDon't get me wrong, I still enjoyed the film, in the same way I enjoy other stylised but flawed action romps, but I don't think it's the cult classic that a lot of the film media is trying to spin it as. The fact that it's sitting at 95% on Rotten Tomatoes seems so completely absurd to me.  \n\nI genuinely think that the drama surrounding the film's stunted release due to Weinstein getting his panties in a knot did a lot to help the film's reception once it became more widely available. It's a decent action flick, but it's not the well-crafted classic so many outlets are selling it as.", "score": 1},{"body": "Judging by the kangaroo and mainly the manliness of those women hands, I'm guessing Australia ", "score": 1},{"body": "But who will take care of m'lady?", "score": 1},{"body": "Yup, the ending pretty much made the whole movie meaningless.", "score": 1},{"body": "I thought the ending was weak as shit. How did it cause everything to suddenly make sense? What reveal are you talking about? \n\n**SPOILERS BELOW**\n\nDo you mean the part where it was explained that old mate at the back of the train and Ed Harris were working together? That shit became fairly obvious pretty early in the film. Nearly as obvious as the fact that the children were being abducted to keep the train running somehow, which became apparent once you saw that guy's kid get taken. Those are the only 'reveals' I can think of, outside of the earth slowly beginning to thaw, which wasn't that interesting.\n\nDon't get me wrong, I still enjoyed the film, in the same way I enjoy other stylised action romps, but I don't think it's the cult classic that a lot of the film media is trying to spin it as. The fact that it's sitting at 95% on Rotten Tomatoes seems so completely absurd to me.  \n\nI genuinely think that the drama surrounding the film's stunted release due to Weinstein getting his panties in a knot did a lot to help the film's reception once it became more widely available. It's a decent action flick, but it's not the well-crafted instant classic so many outlets are selling it as.", "score": 1},{"body": " But it's not like my wife doesn't do things to make me mad. ", "score": 1},{"body": "What kind of food do you leave for them?\n\nAnd are you able to touch them?", "score": 1},{"body": "Unless it's your sisters wedding, your sister is the cohost of a podcast about hacking, and she happens to work with your Internet crush.. ", "score": 1},{"body": "No they won't! This needs to be posted to /r/marijuanaenthusiasts!", "score": 1},{"body": "Its the 3rd one from the left. ", "score": 1},{"body": "Saw dumb and dumber 2 in this and fell asleep so quickly", "score": 1},{"body": "I feel like I'm supposed to avoid mentioning that OP is attractive and amusing but fuck it, I already started this comment. Well done, OP.\n\nHow's it feel to be a spirit animal?", "score": 1},{"body": "Post your pic to reddit, get a million marriage proposals in your inbox.", "score": 1},{"body": "Anybody else bothered by the mustard spot", "score": 1},{"body": "MURICA-tier cinema", "score": 1},{"body": "\"Not worth the trouble\" - Me", "score": 1},{"body": "ALRIGHT WE GET IT WITH THE FUCKING ALOE", "score": 1},{"body": "I don't think it's a good idea to own a roo... To care for a young or sick one is great. But they'll fuck your shit right up as soon as it's big enough. ", "score": 1},{"body": "Agent Hill? ", "score": 1},{"body": "Na man, that asian guy that was on the front page yesterday that was dressed up like Johnny Depp would star in it.", "score": 1},{"body": "This is something right out of a Douglas Coupland Novel. ", "score": 1},{"body": "I took this picture and posted it a year ago\n\nhttp://www.reddit.com/r/pics/comments/1uhte5/today_i_found_a_machine_that_makes_burritos/", "score": 1},{"body": "Que the rants about machine of death and imperialist America in 3,2,1... But seriously, it is a beautiful bird. I suppose we should thank the Germans for the idea. Thank you, Germans.", "score": 1},{"body": "Goddammit, tendorphin.", "score": 1},{"body": "Always two there are.  A master, and an apprentice.  ", "score": 1},{"body": "no its a repost ", "score": 1},{"body": "Well if it *was* Thailand they might be positive. ", "score": 1},{"body": "Where can I get one of these ?!", "score": 1},{"body": "Nightmare fuel.", "score": 1},{"body": "From one of the comments more up she sounds like an apparent animal keeper. ", "score": 1},{"body": "I have that in T-Shirt form. legit.", "score": 1},{"body": "[In case you wanted to know what the story was about.](http://www.kptv.com/story/27766641/deputy-k-9-find-guns-and-meth-during-salem-traffic-stop)", "score": 1},{"body": "Actually, if it is under a certain age, it may need feeding at very frequent intervals, so it may be necessary to keep it with her all the time. ", "score": 1},{"body": "I'm going to Taiwan 17 of Feb until 1 of March. I shall investigate this claim... ", "score": 1},{"body": "Rochester NY has one. ", "score": 1},{"body": "I see it now...", "score": 1},{"body": "That's one hell of a large kidney stone.  How he passed it I'll never know.", "score": 1},{"body": "Skippy the Bush Kangaroo was a kids show that featured the titular roo \"saving the day\" in the same way Lassie does.", "score": 1},{"body": "Blonde girl next to OP is cute.", "score": 1},{"body": "To the Batmobile!", "score": 1},{"body": "...the signs weren't in Spanish. ", "score": 1},{"body": "Dat EAR doe", "score": 1},{"body": "Ok so that's about 340ml. Roughly the same, but yeah we do pay a lot for beer here. I don't think even the proper cheap shit is priced as low as you are quoting over here.", "score": 1},{"body": "Oh, something about it hoping it was a copy pasta.", "score": 1},{"body": "Call me racist but they look Japanese.", "score": 1},{"body": "You're one beautiful lady.", "score": 1},{"body": "Is it anecdote time? After moving and joining a union my husband and I got health insurance for the first time in years and he actually gets paid what his work is worth now. He works with a few idiots but that's true of any job, paying people less and cutting their benefits doesn't make them more competent.", "score": 1},{"body": "Unless you are caring for a Joey for WIRES - like a friend of mine, who is looking after one that was a road-kill orphan rescued from its dead mother's pouch.", "score": 1},{"body": "Ayy lmao", "score": 1},{"body": "I've never been to a wedding where it's actually done, I've only seen it in films.", "score": 1},{"body": "Next on Deadliest Warrior, we view the awesome destructive power of the Hawaiian Tooth Punch. \n\n", "score": 1},{"body": "Yo dog, Why you trippin.", "score": 1},{"body": "Although weirdly, liquid nitrogen is cheaper than water to manufacture. ", "score": 1},{"body": "there is a demographic of insane people who keep exotic animals that really shouldn't be kept as pets.", "score": 1},{"body": "My thoughts exactly:(", "score": 1},{"body": "How soon after was this taken? I mean, where the hell did the buildings go?? *starts folding tin foil hat...", "score": 1},{"body": "It seems the fact that you're not wearing a little black dress already says it all.", "score": 1},{"body": "Sexy as fuck? ", "score": 1},{"body": "http://i.imgur.com/I1ga784.png", "score": 1},{"body": "Am I the only one who immediately thinks of a monchichi when they look at the baby?", "score": 1},{"body": "I am impressed with myself for only spilling a little on the counter and not throwing the bottle.", "score": 1},{"body": "/r/upvotedbecausegirl", "score": 1},{"body": "Nano thermite ", "score": 1},{"body": "I am groot.", "score": 1},{"body": "gotta chose ginger every time", "score": 1},{"body": "...and so tasty...", "score": 1},{"body": "Gah! Fuck!", "score": 1},{"body": "A playstation vita", "score": 1},{"body": "aside from this fella's fictional story. you typically need permits in all but the most backward states.", "score": 1},{"body": "Either that or Dark Side of Your Mother.", "score": 1},{"body": "What year is this? 2008?", "score": 1},{"body": "Must got a new snow blower for Christmas and wanted to bust it out", "score": 1},{"body": "Ah, the [Metro 2033](http://oyster.ignimgs.com/wordpress/stg.ign.com/2013/05/MetroLastLight_051013_1600.jpg) look.", "score": 1},{"body": "I think the above you is just anti union. I've never heard anything bad about one in my life. If anything they protect the employees working there and make sure they're taken care of. If people at my job wouldn't be fired for trying to unionize we would have done it long ago", "score": 1},{"body": "CONGRATULATIONS!!! Enjoy each and every second.", "score": 1},{"body": "I'd totally fall asleep then wake up and buy another ticket because I missed the movie", "score": 1},{"body": "Same with me and when I see baby tylers", "score": 1},{"body": "Bazinga!", "score": 1},{"body": "B-but you're already married!", "score": 1},{"body": "They sell those, 2 for a dollar at Wallgreens in Stralia.  Folks keep them in their yards down there.  They serve an important purpose.  When the kangaroo gets big, it gives the crazy Aussies something to fight when they are drunk.  Doesn't really hurt the kangaroo because the aussie is blind drunk.  Plus it is good cardio for the drunk Aussie.  Both the kangaroos and the drunks seem to enjoy it.  Win win.", "score": 1},{"body": "I shall help your cause with an upvote. Good luck.", "score": 1},{"body": "The woman on the far left looks like she really doesn't want to catch whatever is being thrown and is only looking up to predict where it will fall. I'm curious as to why everyone is wearing black? Is there some funeral throwing ritual I don't know about? \n\nI have so many questions..", "score": 1},{"body": "It Depends...", "score": 1},{"body": "At the wedding of one of my cousins, the bouquet hit me in the face and fell to the floor, where it stayed.\n\nI was about 22 I think. And male. And single.\n\nDidn't go down well :D", "score": 1},{"body": "Why is this a shallot and not an onion? ", "score": 1},{"body": "You probably never want to find out.", "score": 1}]