[{"body": "That's one trippy colour scheme. "},{"body": "&gt;Your choice to reply to me baffles me.\n\nThat much is obvious."},{"body": "No donut for building inspector"},{"body": "I enjoyed your picture and I am happy for you.  Thanks for posting."},{"body": "Just a little sleepy time before finals"},{"body": "Write tv. Doit. I believe in you. "},{"body": "When you own a pet rat, how do you take care of it/not step on it/not lose it?"},{"body": "Isn't that technically a glacier at that point?"},{"body": "Throw a Jack under the car. Lift that Bitch up and swing it out like that. Even if you have to do one side at a tone it'll be faster than doing an Austin powers till your out."},{"body": "I get how everything stated would be different, except for the signs part - which is what the person above you was pointing out I believe. \n\nA traffic sign doesn't (usually) change. If it's a yield sign, it says yield. It will say yield now, or an hour from now.\n\nThere are exceptions where signs change based on time of day, but they aren't as common, and it's unlikely to have that change occurring 10 minutes after OPs normal commute time. "},{"body": "A fucking moron?"},{"body": "Why did I notice the monkey in the background before noticing a woman with no head?"},{"body": "Cleopatra 2525?\n\nI remember she was a stripper.\n"},{"body": "Cute Rule #07 FTW! :) Great picture, much cute. :)"},{"body": "I used \"obscure\" terms in order to make a concise comment rather than writing a novel, because I felt it would too condescending.\n\nI linked to the definitions of the words I used because I was self aware enough to realize not everyone would know what they meant. Out of courtesy. \n\nIt was meant to be a bit of a slap in the face. "},{"body": "must be one of those hybrid things like grapples."},{"body": "Not to also mention that he's a mile from the curb. Around here you try and get within 4-6 inches, not 4-6 feet :P"},{"body": "[Fossa ^^fossa fossa ^^fossa fossa ^^fossa ...](https://www.youtube.com/watch?v=gwMQ3svUfY4)"},{"body": "Did you photoshop your face? Your face looks very uhh cgi."},{"body": "Is that a 20th anniversary GTI?"},{"body": "Nah, that looks as stupid as every other unibrow."},{"body": "Those are for guys in wheelchairs that have some mobility, they can pull themselves up and pee"},{"body": "No steroids, just chicken and rice and no drugs"},{"body": "Call and have one or both of them towed."},{"body": "Yep. I've always told anyone that wants a pet rat to go to a store that sells reptile feeders and get a feeder rat. Fancy rats have little genetic diversity. The feeder rats tend to live a lot longer. "},{"body": "And some top quality bedhead."},{"body": "I know."},{"body": "I did 5 driveways recently. I got a box of chocolates from one house and some homemade cinnamon buns from another. I wouldn't take money, but fancy junk food: bring it on!"},{"body": "Thanks. This changes the entire context of the photo now."},{"body": "Kevin?"},{"body": "I feel so bad for laughing, but I can't stop."},{"body": "&gt; It's also against building regulations.\n\nReally? Where? Building regulations are specific to states, counties, and cities. Do you even know where this is to claim it's against regulations?"},{"body": "yesitdoes.gif"},{"body": "Because this hadn't already happened."},{"body": "the ice only needs to be 3 inches thick to be safe to walk on, 8-10 inches can hold a car."},{"body": "Watch out, Sam, there's a huge dog about to eat you!"},{"body": "I want his skin as my couch"},{"body": "You could play Turk in a Mexican version of Scrubs!"},{"body": "Much hugs and love you to you and the little snax. Don't know her but I love her. "},{"body": "Either all Wal-Mart's and its odd patrons look the same, or this is the Wal-Mart in painted post."},{"body": "Looks pretty green to me"},{"body": "good headbanger"},{"body": "Lots of things are dangerous. It doesn't mean that they should be illegal. "},{"body": "No ones suprised the CANADIAN kids can play good hockey"},{"body": "It happened very quickly. He tried to counter balance it and his weight was not nearly enough and he got flung."},{"body": "Most states only require your center rear brake light to be visible. The window can be obstructed or covered with no issue. It's possible your friend covered the window and the brake light hence the ticket."},{"body": "Honest question, how do we have evidence of an event 1000 years ago if it's 7000 light years away?"},{"body": "I was 18 and alone...it was my first mercy killing. I panicked."},{"body": "Their should be a random acts of kindness sub reddit"},{"body": "Don't cry over spilt milk, but fuck....all those poor eggs :'("},{"body": "People have been saying reddit is. Going to shit since day one. "},{"body": "Final Destination style man. Better check yourself into an asylum now."},{"body": "No it is not. "},{"body": "Says the guy worried about how people use a free website with fake internet points.\n\nCute though."},{"body": "These jokes are all terrible. Turn back now."},{"body": "Whats this bullshit "},{"body": "Just because you've seen it doesn't mean you get to spoil the fun for us...\n\nI hate this better than you I redit more malarkey..."},{"body": "Fist bump OP. I have the same car."},{"body": "This is the opposite of a problem. "},{"body": "I am going to drink a toast tonight to my former pet rats Gidney and Cloyd.  They have been gone for almost 2 decades  but I will never forget them.  "},{"body": "You must be a super serious redditor huh?"},{"body": "Hello ow, nice to meet you."},{"body": "[Indiana Jewelry](http://imgur.com/4rEu7i7)"},{"body": "Cry about it, you white knight faggot. You really showed me with your anonymous internet comment. Hopefully you won't realize that you're just trying to make yourself feel better by doing something completely useless and ineffectual."},{"body": "Awesome"},{"body": "Imagine how much he cried when he cut it up. "},{"body": "Great, now I have a mental image of Jesus repeatedly punching a fig tree faster than the eye can see while yelling."},{"body": "1)Its clean.  There is no dust on anything, the fixtures are bright and shiny, and most importantly there are hardly any only stains on the concrete.\n2) A car drove through a substandard guard rail.  That defect was sure to be changed the first time a car drove off the slab and crashed to the floor below which means that this is the first time this has happened which means the parking structure is new because lots of people suck at driving and it probably wouldn't be very long before that happened."},{"body": "Flowers for algernon "},{"body": "honestly, the gore isn't *that* OTT. its nothing that wouldn't actually happen. it really is a great film. you should definitely give it a watch all the way through. "},{"body": "5/10 see me after class. "},{"body": "Modern medicine amazes me. It comes across as such an easy task but it's actually a living organ that needs to be removed/cleaned/reinstalled. It sounds like you're cleaning a carburetor or something.\n\nBest wishes for your little girl."},{"body": "Yes. Hubble and other space telescopes can focus on one point at a time for a long period of time and gather a lot of detail about these very far off structures. "},{"body": "Bad luck Kyle\n\nHas famous meme\n\n           :/\n\n\n\nDoesn't get his name right"},{"body": "Oh god, you're so pathetic wanting to jealously guard your own little piece of the internet from becoming popular. There's plenty of defaults that I've unsubbed from because I don't like them anymore, but I don't cry about it. Every community that has ever existed has had people claiming \"it used to be better when\". No one gives a shit, get over yourself."},{"body": "Yes I agree :). And bald tires are easier, and coconut greasing your tires before you try that make them slip a little more for a few miles"},{"body": "Not exactly. It's beneficial in some places where a lot of people are of the mindset that 'people who own guns are just hicks, and there are so few of them they don't matter and need to get with the times'. It's a very common belief, and doing things like this show that this fairly average mother owns a 'scurry 'salt rifle'! It sort of forces people to see that large men with southern drawls aren't the only people interested in firearms."},{"body": "Come on, you can get out of there: \nhttps://www.youtube.com/watch?v=DfMVB6X8qMA\n"},{"body": "Bribery probably."},{"body": "I'm sorry OP, but I think you're a baby."},{"body": "I am a parent.  This post tugged at my heartstrings...  \n  \nBut I downvoted it because it is a terribly uninteresting picture - little girl walks down hall with themed luggage.  \n  \nAs you say, this sort of thing belongs on Facebook/Tumblr/etc to be shared among relations and friends.  This is a terribly personal moment and has nothing to do with the world at large."},{"body": "In his situation, yes.  I use [this thing](http://www.bumperbully.com/) on my car.  People tend not to park so close upon seeing it.  Win-win."},{"body": "naah just more VTEC"},{"body": "What an asshole. Good response. For an added fuckyou, consider clearing all immediate neighbors but him."},{"body": "Are you the guy on YouTube with the catchphrase, \"its magic, not hacking, magic is not illegal\" or something?? One of your videos about your neighbors music was on the front page yesterday"},{"body": "[We're done here.](http://i.imgur.com/l9ThAA2.gifv)"},{"body": "I was worried that the snowfall from last night was going to make it difficult to pull out of the spot, but I managed to do so in about ten seconds."},{"body": "It's a boy. She's all \"in front\"."},{"body": "Who cares shut up. "},{"body": "10/10 with rice"},{"body": "This is like something from my nightmares. I hate parking garages so much because I'm afraid shit like this will happen. Thanks OP for confirming my nightmares.\n\nGlad you didn't get squashed by that car though. "},{"body": "This sort of thing is beneficial in some places where a lot of people are of the mindset that 'people who own guns are just hicks, and there are so few of them they don't matter and need to get with the times'. It's a very common belief, and doing things like this show that this fairly average mother owns a 'scurry 'salt rifle'! It sort of forces people to see that large men with southern drawls aren't the only people interested in firearms."},{"body": "Winter can be such a buzz kill. "},{"body": "Please elaborate as to why you had to mention you were a high school drop out.\n"},{"body": "So we know it's not Aspen."},{"body": "I remember my rat, I was probably his age when Sonny died. I feel for you little bro. Stay tough"},{"body": "Ahh, sorry to disappoint you man! :/ We only made some photos there, but in Denmark we actually did a video clip of my juggling..with some beach scenes as well :) Here, https://www.youtube.com/watch?v=9hBfuQ82vRk  I hope you'll like it! :)"},{"body": "I'm quite surprised this hasn't been mentioned by anyone else.  That leg is fucked the hell up."},{"body": "Thank you. That webm extension doesn't work for me on my phone or PC."},{"body": "I love chicken and rice..and drugs.  My favorite is doing drugs, then eating chicken and rice.  \n\nGlad your clean though!  That's important.  Keep it up! "},{"body": "My thoughts exactly, lemme just set this box of small adorable rodents down and let my new buddy in."},{"body": "Yes, especially in female rats, who get mammary tumors something like 96% of the time."},{"body": "Way ahead of you buddy. Already got a petition to change the meme to \"shit karma kyle\""},{"body": "This brings back some serious feels.  \nRodents make wonderful pets, especially first-time ones. My first pet was a jet black Guinea Pig named Speed, he had this messy ridge of hair down his back like a Mohawk.  \nHe was the last gift my grandfather gave to me before passing away, so when speed finally got sick and passed a few years later I was devastated. I didn't get to say goodbye to either of them. Im glad to ses OP's son/friend was able to be there for the little furry dude's last moments"},{"body": "you people obviously don't live in chicago. This is an excellent park."},{"body": "I do like this.  I might try to add a bit more dark in and around the eyes, and create a bigger contrast between the outline of his head and the background.  \n\nAlso the middle red hat slice seems a bit off..."},{"body": "You can only play one ring and ringadingading is not a word."},{"body": "I'm hoping he gets laid heavily."},{"body": "(☞ﾟヮﾟ)☞"},{"body": "Reported him for sexualizing a minor. If you just look at his history you can see how gross of an asshole he actually is..."},{"body": "You sound like quite the drama queen.."},{"body": "It's the long hall in Dublin Ireland"},{"body": "I just want one to play with my dog. She has 3 cat friends who treat her like the fat sister"},{"body": "im waiting for a good snow fall so i can plow my driveway with the tractor we just got.  1 pass down to the road and back should clear the entire thing. "},{"body": "i bet those went over easy"},{"body": "Thank you for the smile you gave me."},{"body": "This is called \"snow fugue\" and happens when a particular combination of windspeed and dropping temperature coincide. And fences, obviously."},{"body": "I *am* a photographer. Google my username.\n\nI think what they're getting at is this is, in an era where people learn (and are exposed to work) primarily online, this is entry-level *subject matter.*\n\nThe quality of the work is certainly not entry level. There is talent there.\n\nThis may not actually be much different from photography throughout history (being documentary-oriented I think about pictorialists insulting members of the Photo League), but it's not deep work. It doesn't comment on life, it doesn't bring us any insight or invite us to think differently. It's easily consumed and enjoyed at a surface, aesthetic-only level.\n\nThat's fine, I just don't find it terribly interesting (anymore)."},{"body": "Presumably wild rats are killed by predators at such a high rate that cancers weren't really a problem, in evolutionary terms. Mature quickly, have lots of babies, get eaten. It's a winning strategy."},{"body": "How do people like you even live with yourself? You've got to either be under 15 or a sad fucking person "},{"body": "Nah, it's still pretty impressive."},{"body": "Cats lap liquid from the underside of their tongue, not from the top."},{"body": "Opps indeed, op, opps indeed."},{"body": "HOLY GUACAMOLEEEEEEEEEEEEE - OP 1 AND CAR 0 \n\nbecause you cheated death - Final destination is upon you ... kk that was a bit evil, I was only kidding and I'm glad your ok :)\n\n"},{"body": "I think it was back window and was missing side view mirror. He was in wreck. After the wreck side view was gone and back window was blocked"},{"body": "This is literally the first time i have ever seen acorns like that."},{"body": "You can just buy them in the store... \n\nhttp://www.grayridge.com/products/images/doubleyolkshead.jpg"},{"body": "It's because of that god damn loch ness monster..."},{"body": "I find I relate to your kid on a spiritual level. "},{"body": "This isn't aww, I don't give a fuck about your dog."},{"body": "Graveyard. Turn back."},{"body": "Updates? Best of luck, she seems to be a brave little girl. "},{"body": "[Why don't you make like a tree and get the fuck outta here!] (http://youtu.be/xjgB2EwvGbs)"},{"body": "&gt; I want to be able to encourage someone when they need it.\n\nWe'd love to have you join us at /r/FreeCompliments."},{"body": "Rofl, thats so fucked up when his coworker comes along as he's finally making headway and just shoves the car out the other end of the tunnel with their vehicle."},{"body": "Because gun control statistically speaking doesn't make anyone safer. We like guns over here, they're fun to use at the range, and they're the best defense against anyone looking to cause you harm. Also statistically speaking, the VAST majority of firearm owners are the most law-abiding people you could ever meet. The sheer number of concealed carry permits out there should speak to this. If I wanted, I could conceal my handgun and walk around as much as I please, knowing I could defend myself should the need ever arise. However, we choose to go through the expensive and time consuming process of getting a license to excersize a constitutional right(that the people who were forming our government thought was so important, they listed it second only to the freedom of speech and expression)\n\n\nYou're not an American, so I honestly don't value your opinion on gun control. It's an emotional response to a non-emotional situation. Just because you think 'guns are scary and inherently bad, they should be regulated into eventual nonexistance', doesn't mean that's an accurate representation of the actual situation over here, nor is it an adequate solution to the problems we do have. "},{"body": "Does no one else see this as the gator version of Leo?"},{"body": "the tears are flowing RIP Rizzo "},{"body": "Or you're just a moronic truck driver who seemingly always forgets that the lift gate isn't level and never fucking will be Cory!\n\n\n*sigh* So many laptops...."},{"body": "Did you take the picture?  If so, well done.\n\nAlso it looks like your fiancee is cute - it's all good news."},{"body": "Don't say that again.  "},{"body": "That doesnt look like your wife"},{"body": "Source: https://www.flickr.com/photos/26969062@N07/14418877386/ and https://www.flickr.com/photos/26969062@N07/14418877386/sizes/h/\n\n2556 x 1437 pixels: https://www.flickr.com/photos/26969062@N07/14418877386/sizes/o/\n"},{"body": "ah, i see.  well at least he was honest."},{"body": "What? He should realise that the responsibility of replacing that TV is on him."},{"body": "Glad to hear all is well."},{"body": "Caesar loved his dank maymays."},{"body": "[&gt;:O](http://big.assets.huffingtonpost.com/tumblr_m8raizR0Rm1rdkwfwo1_500.gif)"},{"body": "Why? It's one of the least insightful comments in the thread. The sentiments are nice, but it adds next to nothing to the conversation."},{"body": "now I watched my wife work ALL DAY git'n THIRTY BAGS t'gether for you ungrateful sunsa-BITCHES, and ALL I hear is CRITICIZE, CRITICIZE, CRITICIZE!\n"},{"body": "Well, since they're both less than 18 inches, they both are. Unless OP parked too close to one of them. I'm giving him the benefit of the doubt and assuming he parked there first and they both parked around him."},{"body": "It's *schön*, but not very *blau* :-P"},{"body": "http://i.imgur.com/RP466L2.jpg"},{"body": "Do a barrel roll!!"},{"body": "He didn't say 2 seconds late he just said late. He still would've been late had he left 2 seconds earlier but he also would've gotten smashed "},{"body": "strangle your cat for free."},{"body": "Get closer. We need a clear view to measure the Couric size. Kids these days!!"},{"body": "-fist bump-"},{"body": "My best friend had two rats while in college. They were such an awesome team. I didn't even interact with them as much as I wanted to. One day he's visiting and tells me one of them died. I actually started tearing up a bit. I also felt bad for the other one, losing his buddy (I think he's got a new buddy now)."},{"body": "MMmmmmm.....Coma Taco."},{"body": "I like your reasoning, sir "},{"body": "Amazing. Commenting to find later."},{"body": "these are awesome! "},{"body": "Very sly."},{"body": "*yawn*"},{"body": "I came in hoping to see good news so thank you. I'm glad to hear everything went well :) "},{"body": "Why are they one of the worst?  I don't eat them much but I do like them."},{"body": "As a father with soon to be two daughters they have frozen everything and I haven't bothered to get them to watch it yet. All hail the marketing power of Disney. "},{"body": "Even the birds feel the need to protect themselves in Detroit."},{"body": "Nah, you just underestimate the stupidity of people."},{"body": "You're are probably right. Domesticated red foxes are somewhat rare, and incredibly expensive. Tame foxes are pretty damn common now, and are far less expensive."},{"body": "[Fixed](http://i.imgur.com/4Q5Nu8e.jpg) so those people have their nav lights on the correct side lol"},{"body": "Your submission was removed as it violates rule I: No screenshots"},{"body": "I have a 22 minute, 16 mile commute, which averages out to about 45mph. If I go nuts and do 10mph faster everywhere I go, I can save about 4 and a half minutes off my commute, lowering it to 17 minutes.\n\nOr I can leave the house 4 minutes earlier.\n\nSpeeding is dumb."},{"body": "You can't just lay it in the back seat and buckle it in so it doesn't roll? Thats what my buddy does in his cavalier."},{"body": "For some reason I heard Michael Jackson singing \"Ben\" in my head while looking at this post."},{"body": "This definitely required a double take "},{"body": "*two months?!* aaaauugghhh.... thanks buddy."},{"body": "There are subreddits to post personal stories, and subreddits to give advice to people with trouble in real life.  \n/r/pics is neither. Would you be surprised if someone that ran on the field during a football game just to tell everyone that his brother is currently fighting cancer gets told to get the fuck out? I'm not saying it's right to tell someone in need to fuck off, but they don't get a freepass either and just because you're an asshole towards other assholes doesn't mean it's alright to be one. You're just as annoying as the people you're insulting."},{"body": "Fuck school"},{"body": "\"What are these beaners doing in my fucking bed?!\""},{"body": "I had pet rats when I was about his age, and just wanted to say: they made the best pets. Super intelligent and friendly, would fall asleep on you or play with you. Anyone with kids that age, 10/10 would recommend rats "},{"body": "Right in the feels."},{"body": "Maybe the penguins don't speak Korean? "},{"body": "[Uptown Funk](https://www.youtube.com/watch?v=OPf0YbXqDm0) is just *such* a groove. Hot damn."},{"body": "Not true, Europe? \n\nEdit: woosh on my part. "},{"body": "The moving propeller on the trailer hitch. "},{"body": "^^no^tears^only^dreams^now"},{"body": "Ah! Shit-fire! "},{"body": "Closer to an 01 maybe? "},{"body": "Ah man that photo made me teary eyed out of nowhere.\n\nHope she has a successful recovery."},{"body": "Buildingporn"},{"body": "Give up the cat nip or the dog gets it..."},{"body": "no more /u/canada_mike falling into the toilet"},{"body": "Gut Cassidy and the Sundance Cheeseburger "},{"body": "Looks cool, but the cropping on the clip picture could have been better, showing the full head maybe."},{"body": "2 seconds late...really?"},{"body": "They are lucky.  If you get between a ferromagnetic object and an MRI, you may find yourself dead."},{"body": "They say the owner looks like their onion"},{"body": "And the EXIT signs are in English."},{"body": "This is adorable. But I'm going to wait for a few generations of domestication to happen before thinking about owning one."},{"body": "The value of the labour is in part determined by the labourers. If, collectively, the labourers make a bargain with the employer, than what they ask is what they are valued, (both the labourers and employer have agreed that). In this case, the employer did not fulfil what it agreed the value of the employees were, even minus a union forming collective bargaining among employees.  \n\nAs has been demonstrated by many industries in the states with busted unions and with falling skill standards, union wages were an accurate valuation because dropping below them caused a disintegrating service quality; Like items being sold to walmart below normal cost, necessitating, due to a form on monopsony by volume, a drop in quality to recoup cost &amp; profit. (A comparison not made for analogical accuracy, it actually covers a different phenomenon, but for explanation through a related concept)\n\n(Note that I'm assuming the relevant dominant management paradigm in the US is competitive labour. A fairly safe bet, yes?)\n\n\nUnions aren't comparable to monopoly or monopsony, (anticipating your next point), because the scale of the good/service is different between employees and other things bought by a company. \"Que?\" With other goods and services, we don't expect the level of ownership by the company of the companies it buys from and contracts from. But,  . . . I tried writing several things here, but it's much better just to look at examples in this thread to see how much ownership people think companies have/should have over people. \n\nAnother way of showing this on the societal scale is the amount of bargaining power that people have with employers. Only with unions do employees have the same bargaining power with a company as the company who sells sugar to a restaurant has. To use an example in simple words &amp; concepts: The amount and scale of wage theft is much higher than the amount and scale of unpaid invoices. \n\nUnions, again by definition, cannot have too much power because they are ultimately dependant on the job. A decision of a union to price their labour higher than can be sustained is a decision that the job is not worth the money. Assuming a rational &amp; honest employer, they would agree to that price of labour. In that case, the value of the job has not been determined because no agreement was reached. Again, the value of something is determined by a transaction between equal parties. \n\n\"What about jobs that have been scared away by unions?\", well, what about companies scared away by the cost of goods? We don't see companies or people saying that companies were scared away by the costs associated with logistics &amp; suppliers, even though this is a very common reason, for companies to fail to start up, to move away, or to shut down, (actually more common than unions, especially in the US these days with very few unions remaining to upset anything at all). We, society, accept it as a cost of doing business to fairly pay suppliers and logistics at the profit margin they demand, (or to be precise, a cost dependant on the marginal cost), but we don't accept workers with the same bargaining power as a cost of doing business. This is an issue of social normalization, not of economics. (Which is in large part due to anti-union propaganda that the US has been blasting out for about a century, related to the industrial-gov't ties leading upto and during WWI, and greatly boosted by the same thing leading upto and during WWII. For example, many of the propaganda posters we examine today from those periods can be held as examples of works telling people to accept lower wages, increased workloads, and decreased work quality, (safety &amp; etc.) 'for the good of the country', (ex: Rosie the riveter). That many of these messages have prevailed since without the reason of nationalism would be the particular mechanisms I would point to, to examine the current state of collective bargaining in the US relative to other countries)\n\n\nTL;DR: It's a tenet of capitalism that the value of something is what equal parties buying and selling that item agree upon. (This is literally how a stock market determines the value of a stock: the overlap of buy-prices and sell-prices thus resulting in transactions). Union wages, by necessity, are wages agreed on by the company and the employees, and therefore by definition are exactly the correct value. By virtue of being the definer of the value. There is an argument to be made that non-collective bargaining also fulfils a value-defining place, however that argument is shown to be false by a number of reasons &amp; evidence, such as examining the bargaining power demonstrated through theft between parties, indicating that the bargaining power of the parties is not on equal terms, so it is not a bargain made between equal parties. \n\n\nSTL;DR: Actually, yes it is a tenet of capitalism that the value of something is determined by the transaction between equal parties. "},{"body": "[Ratso Rizzo](http://03258d8.netsolhost.com/WordPress/wp-content/uploads/2014/02/midnight-cowboy.jpg).  Love it.\n\nRats are awesome pets and wicked smart.  Sorry for your loss."},{"body": "&gt; Fuck me, if you think I give an actual shit about karma  \n  \nGreat to hear!  Self-post this next time so Karma is nil *and* you get to plaster your child all over one corner of the internet - everybody wins :D"},{"body": "That was a fun article to read. Not to mention the author is a fox. "},{"body": "You guys remind me of the little scared fish from Finding Nemo, forced to be a friend of a shark. Pic of [Blenny](http://i.imgur.com/p9TlmY7.jpg)."},{"body": "Looks like you pissed someone off."},{"body": "You should always give yourself room for s good cry.  crying is one of the best releases to mental pain."},{"body": "But what does it say? "},{"body": "The cars that are regularly parallel parked have no scrapes since the drivers have got good at it. The cars that only have to parallel park once in a while have scrapes from the driver not having a clue where the ends of the car are."},{"body": "It'd be awesome if I had a penguin as a pet. "},{"body": "Congratulations, this is stupidest thing I have read all day. I was just browsing /r/circlejerk too..."},{"body": "[I know that feel, had it last month.](http://imgur.com/aZB53yU)"},{"body": "[he sure does](http://www.dose.com/lists/3604/34-Hilarious-Photos-Of-Kids-Losing-It-Over-NOTHING)  (#23)"},{"body": "Yeah, took me a minute."},{"body": "Well? How did he respond!?"},{"body": "or disabled...."},{"body": "If somebody else was driving underneath that drop or somebody was walking they could have easily been killed how exactly is that not really dangerous"},{"body": "See above/below"},{"body": "Yeah I am, I'm like a reddit vigilante "},{"body": "Fantastic! heres hoping for a fast recovery"},{"body": "Add arms so it can be submitted to /r/armedbirdswitharms"},{"body": "What sort of towels do you carry around with you?"},{"body": "Yep, but that's what I'll be mentally saying from now on whenever someone cuts me off in traffic."},{"body": "He made this all up\n\nHe's having a rat tattoo done right now."},{"body": "You can't even see anything."},{"body": "THIS! best post in the thread!"},{"body": "Yeah, I had three rats as a kid. They cost about £8.50 each to buy, but in total over £1,000 in tumour removal. Should have got insurance aha "},{"body": "double bluffing doesnt work when your eyes look like that..."},{"body": "Its not about money its about respect and decency. What does shitty family offer your life?"},{"body": "I laughed way harder than I should have."},{"body": "where do u live"},{"body": "I swear I've seen this post before. Maybe a year or two ago, but I've seen it. I can't find anything on google, it's driving me crazy. "},{"body": "Adorably honest"},{"body": "You're gonna have a hard time wiping. "},{"body": "Aw snap, dog.  The Fresh Prince wasn't sent to Bel Air by his mother-in-law, unless he married his sister, yo.  "},{"body": "That's like 62 Toyota Corollas"},{"body": "I want that hat"},{"body": "While I understand why people might do that, it's quite impractical in areas of dense population with street parking. Most of the time, I have less than a foot of clearance on either end and the chances of finding an open parking spot at the ends are very low."},{"body": "Walmart made the hat? You sure?"},{"body": "Time to have your dog to poop in their minivan and pretend not to notice.\n\nSeriously though, that's super shitty of your brother. What the heck was going on that no one noticed what the kids were doing?"},{"body": "Jesus they didn't like that one did they"},{"body": "Had to set the bar."},{"body": "The time lapse of being on time is greater than the difference of being late two more seconds I'm assuming. But if you weren't late you wouldn't have all of this juicy karma "},{"body": "I also found this little guy in a building while I was horribly lost. This campus is like Narnia. \n\nhttp://imgur.com/DQ5yvsG"},{"body": "I love how you're getting downvotes for not being retarded. Reddit is strange."},{"body": "That smile is so haunting to me. Like the kid is trying to be strong, though it's quite obvious how tough of a time he's having. Life teaches us that we mustn't show weakness, so we smile hollow smiles."},{"body": "Yep, girls love thousandaires"},{"body": "For 18 wheelers you have the mirrors as your only view behind you but it's allowed cause that's just how it works and there trained to drive like that "},{"body": "&gt; Olaf.\n\nI frickin hate that thing"},{"body": "But is the rat OK?"},{"body": "I lived in chicago and had to street park every day.  If someone was taking up more than one spot or they were preventing a spot from being parkable, they are the asshole and I have absolutely no qualms about anything that happens to their car.\n\nIt's a bit different when dealing with congested street parking.  This is also where people put out chairs and tables on spots during the winter to keep other people from taking the spot.  You do NOT want to move these chairs."},{"body": "I had a rat when I was a teenager. He was my only pet growing up, and I had to get him on a weekend my mom was out of town. I loved that thing. He died on christmas. Thanks, universe -.- "},{"body": "I watched it twice. Had to show my brother and my sister in law how creepy it was. "},{"body": "Unsubscribe."},{"body": "More tolerable than a lemon stealing whore."},{"body": "This conversation is making me feel funny."},{"body": "Seriously, I have scrolled WAY down, and have seen nothing but support. Well Done, good people of Reddit."},{"body": "/r/creepy\n"},{"body": "I would imagine this was on a template and that a web developer didn't actually make this since its an article site. I imagine someone with a very rudimentary knowledge of HTML made this and didn't think to do that and it wasn't auto done because the template software doesn't have that option. "},{"body": "But the oranges weren't for sale, which means that though his intentions were pure, he's still in the wrong, *technically*. But really, it was just 1 orange. If it had been 50 oranges and he left $37.50, OP may have had an issue."},{"body": "You sir, do not live in a city"},{"body": "or the loch ness monster"},{"body": "Don't worry, [it isn't OP's car](http://www.reddit.com/r/LosAngeles/comments/20xplq/parked_at_ucla_came_back_to_this/)."},{"body": "Rat in the feels."},{"body": "I'm not 100% sure this is against regulations almost everywhere in North America, but I'm fairly confident. \n\nI was helping of my friends was doing research for a design project in Civil Engineering, which is where my experience with the building regulations come in.\n\nThere may have been a select few States/Provinces that were exceptions, but I didn't think so. \n\nThis was over two years ago now though, so my apologies if I'm incorrect. "},{"body": "You look like a Mexican Jack Black. "},{"body": "So is his wife."},{"body": "If you went to work 2 minutes earlier you would be in time and safe"},{"body": "So why the fuck are you still here if you think Reddit is going to shit?"},{"body": "Right but for example, there's a stop sign on my route to work. I can turn my car on and be parked at work in 4 minutes if I get lucky. There is a stop sign on my route to work, divided by 4-5 lanes that do not have a sign. That stop sign could be a breeze, almost rolling through, or I might have to wait a bit for cars to pass. The sign is constant but the conditions of use change every second."},{"body": "You should leave a note on his car stating that if he fucked the way he parked, he would never get laid."},{"body": "Or, you know, realize that there isn't enough room to do that without damaging the other vehicles. "},{"body": "It's not even an office, he was just getting coffee. Prick."},{"body": "maybe OP has multiple personality disorder "},{"body": "You were 2 seconds late for work?"},{"body": "It's there, you just can't see it"},{"body": "I don't know why this one freaked me out while the other one made me laugh.."},{"body": "And the truth shall set you free!  Wait a minute..."},{"body": "Costs $5k to move in. Place is covered in roaches and literal shit. Landlord acts says it's fine because it's \"so affordable.\""},{"body": "Stay strong young man.  It never gets easier saying goodbye to friends but dont let that stop you from loving them.\n\n[\"You my friend will see, you've got a friend in me\"](https://www.youtube.com/watch?v=Jj_8yT0XkyU)"},{"body": "That's really nice.\n\nI'm not a snow plower, but I have a little rule in my head:\n\nwhenever I have to brush snow off my car (leaving work for the day, at the grocery store, etc.) I always brush off the cars that are parked on either side of me as well.  "},{"body": "0_0\n"},{"body": "I just had to put my dog of 14 years down today :( I'm sorry for your loss, I know how hard it is"},{"body": "Pictures of the room the other cars have?"},{"body": "Being early for work could have saved your life too. Just saying. "},{"body": "&gt;He had the decency to actually leave money for it. I bet you enough people walk past that tree and pick one without leaving money or even caring to say thank you.\n\nYour argument:\n\n* Many people do something malicious\n\n* In this instance, a person did something malicious but provided the victim some compensation\n\n* Therefore, the person acting in this instance did not act maliciously\n\nAn action might be less bad than the bad thing many people do. That doesn't make the action good."},{"body": "that dude was like \"oh, you\"\n\nNah, bro. Fuck that. A bunch of people physically move my car, I ain't gonna be smiling about it. Somebody is catching these hands\n\nedit: I'm an idiot. Or blind. Or both"},{"body": "Yeah and a penny saved is worth three in a bush ain't it?"},{"body": "Boxing arms!  WAYYYYYY coool."},{"body": "hey josh, i heard someone was looting your karmas"},{"body": "You kinda look like Brucie from The Longest Yard."},{"body": "Some people dont like these pictures with no context which has to be explained in text which is either my kid is going on to surgery or my grandparwnt dad and here's a pic of him or her. There are subs were this guy can go but he went to r/pics. I mean it's every other day these poat get voted to the top and all thw comments are the same."},{"body": "I know. Everyone is concerned about OP or the car. DOESNT ANYONE CARE A POOR SOUL LOST THEIR BIKE TODAY!?"},{"body": "Where's the Bailey Building and Loan?"},{"body": "Bedhead."},{"body": "Reminds me of this https://www.youtube.com/watch?v=SXSo1JhWE68#t=15"},{"body": "Well, it's entry-level, so you'd need 5 years experience. But there are plenty of exciting, unpaid internship opportunities!"},{"body": "You monster."},{"body": "My mobile phone just caught fire when I clicked that... why did i click that?"},{"body": "I'm convinced all pandas are actually people in panda suits."},{"body": "He just got in his truck and left."},{"body": "Awesome! I like....maybe some treats for the mail carrier aswell?"},{"body": "It was pretty blustery, so I didn't stick around long. It was already cold at the end of Sept. I can't imagine how unpleasant it would be to climb it now!"},{"body": "Yep, blame it on someone else for being an idiot and running into the rail and over the edge. Murica!\n\nDownvote me all you want, but people have a problem with being held accountable for their own actions here in the states. That's a fact. "},{"body": "Except for leopard seals, and Giant Petrels (birds similar to an Albatros)"},{"body": "Cheeky cunt"},{"body": "Judging by how far aft the keg was, the trunk space is fairly small. I bet it'd be ok. My question was more if it's ok to do that to a keg. Then I remembered most of the beers in half barrels are piss. "},{"body": "The guy on the very far right doesnt have a son :("},{"body": "Did he hide the quarters under your welcome mat, [in a sneaky fashion?](http://cdn-www.i-am-bored.com/media/package-on-doorsteo-box.jpg)"},{"body": "ಠ_ಠ"},{"body": "You are a funny, funny, horrible person."},{"body": "Amazing shot, what did you capture this with?"},{"body": "Is that Paul McCartney in the back?"},{"body": "In Europe that is the norm. Use the bumpers, they are meant for that."},{"body": "Can we please end this seemingly ceaseless Detroit bashing. As a resident it is completely demoralizing to passively watch as hordes of people bash the city that I call home. Many that speak ill, have either never been or hide behind biased facts. The city has problems, but people like myself are trying to forge something great."},{"body": "I don't see Paul. I see [Theo Rossi](http://www.imdb.com/name/nm0744331/?ref_=tt_cl_t6).\n\n"},{"body": "This was my first instinct as well."},{"body": "YO SKIN BITCH\n\nLOOKS SMOOTH"},{"body": "Oh you have a hitch lock, that's nice, guess you don't mind a rip in your tire cover.\n\nCome to a major city that has congested street parking and see how long before your car gets fucked with when you deliberately try to piss off other people.  \n\nNo, a responsible towing driver would take the damn thing out so they aren't a complete asshole to the people just trying to find a parking spot.  It's not about parking close to the other person, but having room to actually get into the parking spot."},{"body": "But then he comes back to life in a way, only appearing in teenagers dreams, and kills them while they sleep... IN THEIR DREAMS!"},{"body": "Hey, she's a real person! Look everyone! "},{"body": "Probably both. And probably has issues with his parents. I see it all the time in my line of work. It's more an envy thing that they never had the same type of relationship with their parents. Sad."},{"body": "I'm in college right now so I can't exactly afford a fox and all the space it requires along with the proper permits but I plan on it when I'm more stable financially and have a home with a yard big enough to support it! I just got curious one day for my future pet and what it required on my end. "},{"body": "Rip the ebrake. Left hand down. Rev it. Dump the clutch."},{"body": "Been there done that too. My daughter had her kidney out at 14 months. Super strong in recovery, and doing very well still here 5 years later.\n\nKids are don't let things like illness and surgery stop them, she'll be better than before before you know it :D"},{"body": "I meant geographically not ethnically."},{"body": "Do you guys meet up often?"},{"body": "Somebody is getting canned"},{"body": "That's funny, I wore a shirt with the same words but different design to the Cannabis Cup a few years ago and people kept wanting to take pictures with me. "},{"body": "Not that you necessarily would have been able to avoid this, but this is why I always parallel behind another car, being sure to give myself at least a few feet of space to get out."},{"body": "this right here is some fancy shit. I like it. "},{"body": "\"What are you growing?\" \n\n\"Ummmm... Herbs?\""},{"body": "Not my brother's fuckin' kids.  He trained them to respect other people's shit."},{"body": "Last time I got the 90s it took ten years to clear up. "},{"body": "All websites are always going shit. Everyone looks at the past with rose coloured glasses when the past wasn't much different from the present to begin with. "},{"body": "I really want to watch that movie now. Ahh"},{"body": "What we've learned: Stupidity almost claims another life."},{"body": "Just trying to be professional, but NOOOOoooo...."},{"body": "If any of my friends have kids anytime soon I'll be pulling this quote on them."},{"body": "Sweeeeeeet"},{"body": "&gt; And let me steal their nudes and selfies.\n\n-NSA"},{"body": "Even the name sounds like a candy bar."},{"body": "I lived in a major city for several years. I didn't have many knicks on my bumper, even though I parked on the street 4-5 times a week."},{"body": "Angel?"},{"body": "&gt; Ring ring. Ring ring.\n\n&gt; Actually, it vibrated, and because this is a story about the age of the Internet and the way technology can change our lives, it’s important to get the sound right.\n\n&gt; Vibrate vibrate. Vibrate vibrate.\n\nNot sure if I'm laughing with or at the author of this article... "},{"body": "/r/redditisfacebook"},{"body": "Yeah, my first thought. Damn smooth skin. It's like your baby's."},{"body": "How about this...\n\nHow about instead of taking this picture to post on reddit for attention you instead stand next to her and hold her hand while she walks\n\nHow about you ask her if she wants you to post a picture of her going into surgery on the same website that hosts insane porn and weird shit like she couldn't imagine?\n\nHow about instead of replying to people on this post you go hang out with her?\n\n\n\nThis post is lame on so many levels.\n\n\nGet off reddit and go be her dad.\n\nLet the downvotes commence...\n\n\n"},{"body": "Pretty plain to see the one on the right is Legolas."},{"body": "Did you actually read the studies on the topic or are you just parroting?"},{"body": "Yep. Worked as a temp for Honda one summer. Clocked in at 7:00:17, as in seventeen seconds late, and was docked 4 hours of sick/vacation time. A few weeks later I was a legit 5 min late, and finally late 80 seconds and was automatically let go for not having anymore comp time (you get 2 days for the first 6 months).\n\nFuck all that noise. "},{"body": "The implication is that he isn't that bright and isn't a building inspector and even he could spot that this was wrong. "},{"body": "That'll buff right out. "},{"body": "Exactly."},{"body": "There are plenty of comments of the sort you described, but I don't think this is one of them. It's a little harsh, but it *is* constructive.\n\nI went to photo school. This type of criticism is something I'm fairly accustomed to having leveled at me, and I bring it to my friends. \n\n\"Wow, those are really great/you have such a good eye\" is nice to hear, but what does that do for me? Short of the times I've been on the verge of quitting photography altogether, nothing.\n\nPhotography is subjective. You HAVE to take the opinions of people who don't think the work is good to improve.\n\nWhat is this work trying to do? Is it successful? Are we interested in the purpose?\n\nPersonally, I think they're trying to be pretty pictures that attract a lot of views on the latest popular photo sharing website. That's fine, and moreover I think they're successful in doing that. It's just not something I'm particularly interested in anymore.\n\nIf they're trying to be insightful, or some sort of commentary, I think they fail. But that's okay because I don't think the creator would claim that they are."},{"body": "Yay! Now we can rename r/pics to r/sympathy. "},{"body": "I understand that income is taxed. I understand that the vast majority of servers I've known do not claim 100% of their tips as income. I understand that is income tax evasion.  I understand that is illegal.  \n\nWhat I don't understand is how they let you post on reddit from your middle school classroom. "},{"body": "I hope everything goes well for all of you.  As a father, I know it sucks sometimes to have to deal with this stuff.  But it will be ok in the end."},{"body": "[African wild dogs](http://en.wikipedia.org/wiki/Lycaon_pictus), I think."},{"body": "If you were 'on time' then you would have been past it before it happened, assuming you would have been more than 2 seconds late."},{"body": "He should get someone better at negotiating deals to negotiate his deals for him."},{"body": "In highschool my friend had this old yellow Blazer with a big rack on the front. If someone was parked like an idiot he would just push their car around a little. It was amazing"},{"body": "[http://i.imgur.com/U4xHdAu.jpg](http://i.imgur.com/U4xHdAu.jpg)"},{"body": "This is illegal, btw. "},{"body": "It's like Animal Crossing"},{"body": "Yay!!! praying for a speedy recovery!!!"},{"body": "Bashed it on the rocks unfortunately."},{"body": "O_o"},{"body": "Doge svedanya, Ruffski"},{"body": "If only there was a way to reply to a thread currently in progress on this topic, so discussion wasn't fragmented."},{"body": "Not OP, but saw his response further up. Yes, she's out, and did great. Should be in the hospital for another 3 days."},{"body": "I feel like this shits gotta happen a lot. I'm convinced my roof is gonna fall on me any night. My door has had cracks in the wall above it that keep spreading, the door itself keeps getting wedged in the frame (and I continually have to reset it so it fits enough to close), and I hear some creepy ass house noises. I keep telling myself \"well someone had to sign off on it\" but my paranoia tells me one of these nights I'll be buried."},{"body": "There should be more punishments for this kind of misleading karma farming. Well done for exposing the truth."},{"body": "McGraw is my hometown!"},{"body": "Takes a crane to get it out"},{"body": "[What does the fox say?] (http://youtu.be/jofNR_WkoCE)"},{"body": "I don't know. My actual wife looked like that with both kids and both were girls. "},{"body": "Looks like a Camry to me.\n\nEDIT: Nope definitely a Taurus wagon."},{"body": "How's it going to make the corner after the loop the loop? \n\nBig questions need to be answered. "},{"body": "U were hilarious in \"school of rock\".\n"},{"body": "It tells you i have no formal training in this area whatsoever.\n\nPlease elaborate as to why you needed this spelled out for you."},{"body": "So that's the equivalent of a crazy cat lady here?"},{"body": "I can't tell if this face is saying \"sorry\" or \"HELP ME!\""},{"body": "Fuck you guy."},{"body": "It is the protector we need but not the one we deserve"},{"body": "[A cat's jaw has only up and down motion; it does not have any lateral, side to side motion, like dogs and humans.  ](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr03/4/16/enhanced-15399-1396642707-8.jpg)"},{"body": "That made me tear up instantaneously. \n\nEdit: Spelling"},{"body": "In every accident pic the person on the phone is a must. I wonder the amount time between the accident and phone call along with what was going on in his head... nobody likes fuckin up at work. "},{"body": "Boy, I didn't think I would tear up over a rat. But your poor boy. And that poor animal. I'm sorry for your loss. =("},{"body": "I want to hug each and every one of those little bastards. Penguins are just the best"},{"body": "Great news. I can't imagine why anyone would be offended but I for one am glad you posted. My wife and I received the awful news that our 2nd child would not survive the pregnancy just shy of a week ago. Seeing your daughter and knowing there is a happy ending is inspiring. I can only imagine how scary this process must have been for both Mom and Dad. We will keep thinking and praying for your family. Thank you so much for sharing"},{"body": "I love mo, too young one."},{"body": "Well I mean either way it looks good and most people who don't know much about birds' first guess would be a bluejay"},{"body": "Reminds me of Terese Nielsen. Awesome."},{"body": "That'll buff out."},{"body": "As an owner of four wonderful ratties, I dread the day they start passing away. "},{"body": "Awwwww the baby is soo cute!"},{"body": "Looks like a truck with an open back door backed into that sucker.\n\n"},{"body": "Out to buy their used schoolgirl panties i presume..."},{"body": "I love how she doesnt seem to be bothered by it all.\nBadass little girl!\n\nI read the surgery went well. Stuff like this makes me happy!"},{"body": "Your body is fine ;-)"},{"body": "Guy with acne here, just shaved and now im bleeding alot. Came here to compliment the guy on his beautiful skin. Adorable baby too btw but omfg your skin."},{"body": "I love the third picture with the guy and his extended mittene'd hand."},{"body": "Because not all high school drop outs are like you."},{"body": "Psychopath?"},{"body": "Never before have I seen someone miss a joke by THAT much. It's like shitting into the Grand Canyon, but the turd somehow plopping into some poor kid's water bucket in South Africa.  "},{"body": "Dude...what the hell?"},{"body": "about as good as /r/adviceanimals"},{"body": "What a shitty design. Glad you're okay!"},{"body": "Which is kind of funny. Super white teeth aren't healthy.\n\nThe natural color of enamel is light yellow or slightly gray and your teeth should appear accented by those colors. Like it shouldn't be able to stop traffic, but enough to notice the hello."},{"body": "Biceps and cowboy boots...I wish I was half as cool."},{"body": "I think that only applies to feather, this girl is dot Indian. "},{"body": "Those in the 13-19 year old bracket are not Homo sapiens. "},{"body": "Good job Matlock. Fuck you KASKAx you fucking liar!"},{"body": "Were you wearing your space suit?"},{"body": "It is known."},{"body": "not gay guys but my lesbian neighbors are in a rock band and are loud as fuck when they use the house to hold practice"},{"body": "Just get a corgi.  All of the ears and the benefits of thousands of years of domestication.\n\n[Look at that face.] (http://i.imgur.com/8Kkz2eBl.jpg)\n"},{"body": "Thank you all they say is im heartless or this is a community site and I dont own it or I'm not a parent. This is not facebook! Wish the mods did there job and remove pictures that are nothing more thwn kids \"going to surgery\" or a dead relative."},{"body": "more like lexus suv "},{"body": "You might be the best parallel parker in the world, but that won't stop other cars from bumping into you while you're parked."},{"body": "Bat/cat"},{"body": "What conversation, making jokes about a crying child? Those are fine and all, I just think the first genuine response to an emotional picture should be higher than those is all. Not a big deal. "},{"body": "And if somebody is walking down the sidewalk and a car jumps the curb, they can get killed. Does that mean that walking on the sidewalk is too dangerous and the state should be forced to build car-proof barriers on every road with a sidewalk? How is this any more dangerous?"},{"body": "Sniper porn?"},{"body": "It's a trap!"},{"body": "Ah, then I suppose neither is OP's fault.  Does that make OP gay?"},{"body": "God, I miss those small coffee drinks!"},{"body": "&gt; Thank you for the kind thoughts and wishes from everyone. For the people that were offended by the post, **go fuck yourself with a lightning rod**\n\nFTFY\n\n"},{"body": "WHY CANT I STOP LISTENING TO THIS"},{"body": "I'm so confused right now !"},{"body": "*hay guise just taking a pic for likes hehe kthx* /r/Facebook"},{"body": "I keep trying to talk my boyfriend into getting a rat, he wants a pet but doesn't have the time to devote to a dog or cat but I feel like fish are a bit unexciting for him. I think rats are so cute."},{"body": "It happens in the US as well.  Here is a Black Widow eating a Lined Snake\n\nhttp://i.imgur.com/t9bbkuq.jpg"},{"body": "Yeah, that's not true at all.  The people who regularly street park are the ones with the most scrapes because they typically end up parking in spots that are much smaller.  The people who don't street park often will skip those spots or think they won't fit.  \n\nI hated it when friends or relatives would come over and try to street park.  They would pass up half the spots and then take an hour to park in a spot the size of a city bus.\n\nThe OP's picture is actually not that uncommon.  It's pretty close, but it's something you typically deal with.  Most of the time you have either the front care or the back car that close (or closer).\n\n"},{"body": "Wrong subreddit to post in thats why. "},{"body": "ISO 3200\n30 seconds\nF2.8"},{"body": "It won't bother her anyway."},{"body": "You don't live up to your username."},{"body": "His last name just had to be Craven."},{"body": "Didn't teach you very well if you're in a hand with 6/8 off suit lol.  I kid, I kid."},{"body": "Wait, where are the violent, raping seals? "},{"body": "Whoa, I just got funked up, baby boba."},{"body": "[Many cats love having their forehead gently stroked.](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr02/9/17/enhanced-buzz-5632-1397079234-23.jpg)"},{"body": "Thank you so much! It's been nerve racking getting out there at 26 and having the confidence in my work!\n\n This was a brand new house I designed and build in Los Altos, CA"},{"body": "so.damn.adorable. much love to you and your infant"},{"body": "New phone wallpaper, thanks!"},{"body": "I've heard about the chairs! That is just nuts! \n\nAs for my tow hook- I don't think it protruding 3-4\" from the rear of my bumper is that big of a deal. In the summer I have my Yakima bike rack plugged in the hitch and it sticks out in FEET, not inches. If my 3-4\" of metal sticking out of my hitch is enough to not allow you to park in the spot behind me- well- I'm sorry- the spot was too fucking small to begin with and you have no business trying to wedge your car in there. I lived in SF for many years so I know the struggle- we bought a smaller car and all of our problems melted away. "},{"body": "maybe next time include that in the comment? the sentence just came off bad which was the reason for my response. sorry!\n\nmy son gets really shy around strangers...could be good, or bad i guess, but every kid reacts differently to strangers i suppose!"},{"body": "A majority of that cost will be to purge the magnet coolant and shut the magnet down, I assume. I am a trained operator of a 3T MRI and have been warned of these things time and time again. Liquid helium is not fucking cheap these days. "},{"body": "/r/wtf"},{"body": "Glad you're okay. So how was the car removed? Pulled back up,  or dragged the rest of the way down with a thud?"},{"body": "Sherlock."},{"body": "Tree"},{"body": "I genuinely wish I was, instead I got really really cold and half froze to death. Space suit would have been the best suit for the occasion... That gives me an idea..."},{"body": "[Shucks, thats corny!](https://40.media.tumblr.com/94869ce1cadf603b606d0153adbc68a3/tumblr_n5g8suRs761ql5brco1_500.png)"},{"body": "ITS HER ROYAL HIGHNESS' MATCHED LUGGAGE!"},{"body": "Took me a while to realise that was a lion. I just saw a cute fluffy dog in some grass. I'd be terrible at a safari"},{"body": "/u/The_Dogg really does have a good eye.  I can see both locations shown in the picture (The Earth is letting out some steam!!! and Can anyone tell me where this is?!?) on the map.  Damn.  "},{"body": "Thanks!  Canon 5d iii with a Sigma 50 1.4 Art Lens."},{"body": "There's no butchers in most Walmarts in Tennessee, and now I know why..."},{"body": "In Canada?"},{"body": "Happy cake day, glad you have a window I unfortunately am surrounded by walls so that is a welcome site!"},{"body": "Why is there no railing built there?"},{"body": "you were 2 seconds late to work?"},{"body": "Like this?  /http://abcnews.go.com/US/story?id=92745"},{"body": "[Relevant](http://youtu.be/QrGrOK8oZG8)"},{"body": "top kek"},{"body": "That title bothered me more than it should have."},{"body": "Without clicking this link. It's the two Russian guys climbing this sky scraper when it was still under construction. The high five at the tip of the crane makes me feel sick"},{"body": "Liar. "},{"body": "Accidents happen. The reason there are building codes is to reduce the overall effect of the accident. If a proper barrier had been installed, the driver would have simply driven into it, not fallen over the edge. This drop could be fatal to a passenger in the vehicle, or another person or vehicle passing underneath, but slamming into a barrier isn't as fatal."},{"body": "The full head is there if you click the icon. Mighty fine craftsmanship methinks. "},{"body": "Netflix has it to stream if that'll help feed you. "},{"body": "Keepass. Das gute!"},{"body": "Typical sixth street basic white girl."},{"body": "Vending machines in Japan can also dispense hot drinks. so nice."},{"body": "Having 2 long haired females in my household I am confident that the photo doesn't do the smell justice. "},{"body": "Wrong subreddit."},{"body": "Communists consider pet ownership bourgeois and made it illegal."},{"body": "Agreed.\n\n-Also resident of metro detroit area"},{"body": "No need for a paternal test. I think this ones yours"},{"body": "Well you might not be interested in him but you are in /r/pics which means that you are at least partially interested in pictures and that is in fact the medium that this  is in "},{"body": "What IS a boy to do??? (Oh, we're NOT doing Frasier shit this week?)"},{"body": "On the internet, no one knows you're a dog"},{"body": "This isn't Facebook"},{"body": "They don't want to look at the times themselves and use common sense.  They know in this economy they can fire all their staff and have unemployed people lining up outside begging for a job every day."},{"body": "Jesus H. Chrysler... "},{"body": "I thought Bruno was a woman for like 3 years."},{"body": "Sort of resembles an angler fish."},{"body": "Alfred - get my grappling hook, I want to bat it around."},{"body": "ITT: So much freaking love for an internet stranger and his daughter!! Yeah, I know there were trolls, but I didn't see them - all I saw was encouragement and good cheer.\n\nGlad to read your daughter did well through the surgery, /u/biggysnax. Hope the next few days go by without incident, and she is soon home happily playing with Elsa and Olaf."},{"body": "they just so mothafucking cute. \n"},{"body": "What a strong little boy. It's hard to lose a little friend like that, especially at his age. You should be very proud of him."},{"body": "I know, it was a joke.  Maybe not a vary good one, but it was that or just comment on how pretty she is."},{"body": "In an earthquake."},{"body": "\"Whateva! Whateva! I do what I want!\" "},{"body": "That kid has amazing strength to be able to smile for the photo. I sure wouldn't be able to do that at 8. Not really sure I could do it now..."},{"body": "at OP, i.e. specific advice reg. OP's problem, not comments to public at-large."},{"body": "k"},{"body": "Final destination! Rawr!"},{"body": "I love jokes like this. "},{"body": "I think it's more complicated than that, but I have no problem with agreeing that pensions are a form of \"welfare\", so long as all state-funded pensions are treated equally - or a clear explanation is given why \"public pensions\" are welfare, while \"state pensions\" are not.\n\nI think you need to be aware of the political climate in Britain at the moment to understand why so many people are suspicious of how this data is presented. There is a growing division between the two main parties and their supporters - probably the biggest divergence since the pre-Blair years. Meanwhile, smaller parties with specific agendas and grievances (e.g. UKIP) appear to be gaining wider support. The Conservative-led government is seeking re-election on the grounds that they will continue to tackle the budget deficit. Their main targets have been welfare spending (especially unemployment benefits) and public sector pensions. They argue that cutting welfare spending is the key to a strong economy. So, padding the \"welfare\" section on these forms would seem to be in their interests.\n\nWhere it gets more conspiracy-theory-esque is when you ask why they chose not to put state pensions into welfare as well. Please bear in mind, I don't necessarily believe any of the following ideas that have been touted:\n\n* Including state pensions in the same category as unemployment benefits would piss off the voter-heavy 55+ demographic.\n* State pensions are seen as a \"good\" expense by the majority of the UK, so making the size of this chunk apparent is in the interest of the sitting government.\n* The government wants to reduce public sector pensions further and so presenting them as \"welfare\" fits in with their wider message to the electorate.\n\nOnly the people who drafted the document know for sure why they made these decisions. They may have genuinely felt they were adding clarity. But I think its right for people to question what the motive of the government is in presenting the information in this way.\n\n(EDIT: Changed 65+ to 55+)"},{"body": "/r/photoshopbattles would love this picture"},{"body": "I got the [reference](https://wademack.files.wordpress.com/2011/04/dressup_owl.jpg)"},{"body": "And OP is parenting like a 21st century revolutionary. \"That guy is rebelling! Take a picture for karma.\""},{"body": "He's the hero Gotham deserves, but not the one it needs right meow."},{"body": "As the surgeon was carefully handling the new kidney to be put in her he looked in horror as the young patient rose from her bed. He looked in her cold soulless eyes as she said\n\n\"The snow glow white on the mountain tonight, Mr. Surgeon\"\n\nHe gasped, completely baffled at what is happening, all of the sudden she grabbed the kidney out of his hand and threw it on the floor.\n\n\"**LET IT GO**\"\n\nHe quickly jumped over to grab the kidney hoping it wasn't damaged but all of the sudden she jumped off the bed and threw him across the room.\n\nScared, he tried to reason with the girl,\n\n\"Wait, stop! You need this kidney, you... you could die without it!\"\n\n\"**I DON'T CARE WHAT THEY'RE GOING TO SAY**\n\n\"At... at your funeral? Please let me put the kidney in!\"\n\nThe little girl hopped back on to and lied on back on the bed,\n\n\"The cold never bothered me anyway\"\n\nAnd then she went back to sleep.\n\nThe young intern had woken up from his nap in the closet, vaguely remembering this little girl walking with a Frozen™ wheelie backup and some dude walking behind her taking pictures of her.\n\n\n"},{"body": "http://www.reddit.com/r/LosAngeles/comments/20xplq/parked_at_ucla_came_back_to_this/ Its not OP's car."},{"body": "Remember, some people had bad experiences with their parents, and grow up being apathetic and often psychopathic when they see a child being loved by a good parent. Ignore them."},{"body": "I know right?! Instead of trying to call me out on it, they just downvoted it.... It's like none of them have ever looked at anything on google earth. "},{"body": "that rat looks like Master Splinter"},{"body": "Oh no I love humans and animals too, just hate the flood of \"look at my dog\" content... /r/pics, though a very broad subreddit, is still supposed to be interesting, just a dog simply isn't. And besides there is a dedicated subreddit for \"look at my dog\" posts, /r/aww."},{"body": "They kind of help mom and dad out too. I got lazy about them with my third kid and she sliced my cornea twice. Painkillers, an ointment and a patch were required both times. "},{"body": "Bad day. Bad day. Bad day. Bad day. "},{"body": "I just happen to have two bottles of wodka and 50 American dollars in my pocket... We good?"},{"body": "I can sympathize, my first apartment in Brooklyn had 4 windows, none of which were in my bedroom.  They did cut a hole in my wall that led into my roommates room.  So that was nice."},{"body": "Not sure if compliment"},{"body": "The good drivers still *get* hit though."},{"body": "Can confirm, just got scratched.\n\nSource: father of a scratch-happy baby boy"},{"body": "My SO and I just had to put our pet rat Zelda to sleep. It was a terrible ordeal. I'm sorry for your loss, and I hope you and the little guy are doing well. "},{"body": "The many lives of Wile E . Coyote. \n\n\nYeah yeah, I know it said wolves. "},{"body": "Wow! He doesn't look 60. "},{"body": "&gt;They could not have foreseen civilians with automatic weapons and clips\n\nAlright then. We'll go back to muskets, and we'll also let the government arrest you for anything you say on the internet that they don't like. Also, the police can search your car at any time, since the founding fathers never knew about cars. \n\nThere's no room to dispute the founding father's intentions and if you think otherwise you need to do more research. \"armaments\" is the word used in the amendment. Not 'musket'. Not 'black powder rifle of more than six shots'. \n\nArmament.\n\nˈärməmənt\n\nnoun\n\nmilitary weapons and equipment.\n\nThey knew that humanity wouldn't be waging war with muskets for the next 300 years, they had to have known weapons technology would advance with everything else. They wanted civilians to be empowered against their government, and to this day that still holds true. Look at Mexico as a decent example. Guns are prohibited from civilians, and they have an insanely corrupt government, citizens have no rights, etc etc.\n\n\nAlso, because of the inevitable \"But civilians armed with guns can't fight tanks and jets of an oppressive government police state!!!\"\nTanks and jets don't create a police state- police do. Police, armed with guns, that the civilians are on hopefully equal footing with.\n"},{"body": "Great to hear!  Good luck on her recovery."},{"body": "\"late to work\"  so I assumed OP was at home and had access to towels.   However,  I keep a blanket in the back of my van for covering things from view in the back. "},{"body": "For Illinois, it can't stick out further than 4\".\n\n[Clicky](http://www.ilga.gov/legislation/BillStatus.asp?DocTypeID=HB&amp;DocNum=3669&amp;GAID=10&amp;SessionID=76&amp;LegID=46447)\n\n*Amends the Illinois Vehicle Code. Provides that if any portion of a motor vehicle hitch containing a ball mount and hitch receiver extends more than 4 inches beyond the motor vehicle's rear bumper, then the ball mount must be removed from the hitch receiver when the motor vehicle is not being used for towing. Provides that if any portion of a motor vehicle hitch extends more than 4 inches beyond the rear bumper of the motor vehicle and the hitch is composed of a single assembly that cannot be easily removed from the vehicle, then the ball of the hitch must be covered with a red cover. Defines \"ball mount\", \"hitch receiver\", and \"motor vehicle hitch\".*"},{"body": "We need to like, call the police! Maybe even a fireman."},{"body": "Certainly his species has.  But many individuals have always frozen to death.  Particularly in unusually cold weather.  We are in a period of mass extinction because of human encroachment and climate change.  Not just more individual animals are dying, but large numbers of species that have survived thousands of years."},{"body": "classic\n"},{"body": "Dude! MK4 respect! How long have you had it?\n\nI've owned my 1.8t GTI for 10 years"},{"body": "Thats xenu withdrawal"},{"body": "why the long face though? "},{"body": "I spotted Bigfoot!"},{"body": "...Tai?"},{"body": "So how did being late save him then? If he'd left on time he would've also avoided it"},{"body": "and if your a good driver your care will repel other cars when you leave it alone?"},{"body": "what a relief.  my little girl looks about the same age as yours and I couldn't imagine the anxiety this would give me.  glad to hear all is well!!"},{"body": "So hammer some planks on your wall."},{"body": "If OP is magic he would just apparate to work instead of driving dumbass"},{"body": "I wouldn't classify 2 seconds as late I mean that's the difference of one poor shift."},{"body": "This is my question as well. What kind of shitty engineer plans a parking structure where idiots can easily back (or in this case, drive forward) over the edge of the parking area down an entire floor? The person who designed this needs to be fired and fined."},{"body": "If i had a friend like Ben...."},{"body": "bed time is the time between the when they first fall over and the first scream for a cuddle. Usually about 20 minutes or so.  Only after 6 months of age though."},{"body": "Woodseption"},{"body": "*Hey Hank, I have that scaffolding that you asked for...make that had*"},{"body": "You shouldn't feed them...what a shame. "},{"body": "Frostbite, she stayed out too long in Frozen™ weather."},{"body": "Didn't he try and do an AMA and /r/iama told him no because they don't let 'internet famous' people do amas or whatever?"},{"body": "Given that he's biggysnax... She ought to be lil'snax"},{"body": "You are not a true dad of a girly girl until you have won the Pretty Pretty Princess game and are wearing all the jewelry that comes with it and your wife is standing there laughing at you taking pictures."},{"body": "Interesting, at first I was like what happened to the nose, then noticed the user name.\n\nCool"},{"body": "Your in law school and aren't crying? I had moot court and lrw in the same semester 1l year, as well as my other courses, and I went home and cried atleast twice due to the work load and sheer misery. (am male) "},{"body": "Honestly I dont know what it is, It could be Coyotes. \n\nBut thats art for yah, open to interpretation and shit."},{"body": "Ohmagawd I'm dying "},{"body": "It is what it is though. Be a good person even if others are shitty and learn how to not get butthurt about how frustrating it can be. "},{"body": "My niece would have that plus a lunchbox with a 3ds, DSI and original gameboy plus games."},{"body": "foot?\n"},{"body": "..and if you'd paid attention in school you'd understand the difference between I'd vs. I've and fell vs. fallen.\n\nGlossary:\n\nI've - A contraction of 'I have'\n\nI'd - A contraction of 'I had'\n\n[More here](http://www.enchantedlearning.com/grammar/contractions/)\n\nFor fell/fallen, refer [here](https://www.englishforums.com/English/FellOrFallen/gccbx/post.htm)\n\nFootnote: I understand illiteracy rules the mob so your downvotes will not surprise me, so have at it, you wonderful half-wits! :D\n\n\n"},{"body": "4 logos on this gif"},{"body": "Neighbor must be the boss"},{"body": "Wow.... Someone is in serious trouble for overlooking that massive safety hazard. "},{"body": "It won't bother her anyway."},{"body": "That fucken guy, I would have slashed his tires then slash his throat then shove some mentos up his ass and down his throat while he is bleeding to death"},{"body": "Ooooh .. your O's face. "},{"body": "u gotta turn on RES"},{"body": "Don't forget cocaine."},{"body": "What if they're front wheel drive and are automatics left in park?"},{"body": "That was her car "},{"body": "i bet the black guy sitting down is seriously thinking about his life choices."},{"body": "No, no. He kidnaps heavy women because the greater surface area of their skin gives him larger pieces of material to work with. When you create a garment, you need material beyond the final finished size to account for seams, zippers, hems, gussets, etc. This additional material is referred to as \"seam allowance\"."},{"body": "Oh yes, that's not what i mean though.  Many people will decide to look at a post dependent on its picture and its title.  If either looks uninteresting, people might not click.  I'm saying that cropping the image will attract more people."},{"body": "&gt; Somebody is catching these hands\n\nI don't even know what that means. Regardless, they moved HER car, not his."},{"body": "You know what? Embracing the whole electric car thing is really nice. But honestly, we should just get rid of cars. Fuck driving. And fuck parking. I want more buses, subways, and trains. There are entire generations of young people that live throughout their teens and 20s without cars in foreign cities because they don't need them. "},{"body": "Maybe you should give em the laaaaaaaaaaaaaaaaaaaaaaaaaazzzzyy eeeeeeye"},{"body": "nice edit, the comment really flows now. rly upvote worthy"},{"body": "I did this when I was in my 20's. Datsun 710 wagon + brothers stag party= broken rear window. I did it while closing the back. :-("},{"body": "Where does he get those wonderful cat toys?"},{"body": "Eh, I'm betting on it getting lost in the nether of cuter cats and dogs."},{"body": "It's a good thing it's not a scratch and sniff photo! Glad to know I'm not the only one!"},{"body": "It's obvious from the article that it snowed 27 inches in Jamestown, ND during this storm. The image OP linked is just a snow drift, which reached 20-30 feet in some places due to 100mph winds. "},{"body": "In reality this was probably just not meant to happen. You had an equally unlikely chance of being crushed by a falling car at any point had you been early or late to work. Stop being dramatic and go die in some other less interesting way, like in your sleep when you're 90."},{"body": "Snow ? We got 6 inches of ICE here !"},{"body": "I'm just not sure why it would be. The drop is relatively short, cars can't be moving very quickly, and there's a clear area that you're not supposed to drive over (the railing). This isn't any more dangerous than a sidewalk outside a shop or the shoulder on a residential street and there are no regulations that say you have to have a car-proof railing there. There are lots of bridges and culverts that have no such railing and they're perfectly legal. "},{"body": "Do Americans associate the word 'methinks' with the Irish?"},{"body": "what a waste"},{"body": "and THAT is why you don't lock your bicycle to rails.  "},{"body": "I work in IT, my data center is basically a cinder block rectangle inside of another one, the only way you see daylight is if you look on the security monitors or take the elevator to go out.\n\nMy place in Brooklyn gets plenty of light in the afternoon and not much before that, just the way I like it.\n"},{"body": "It doesn't seem like it could have been that fast of an impact either, really. \n\nA 9 foot drop maybe? That calculates to be about 17 mph assuming total free fall, which this wasn't. Probably more like: front tires drop off the slab, body of car slams down and scrapes forward, car reaches tipping point and falls over edge."},{"body": "[Recent studies have shown that cats can see blue and green. There is disagreement as to whether they can see red.](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr08/9/14/enhanced-11714-1397069467-10.jpg)"},{"body": "Can we think about the Bike for a minute?"},{"body": "Aloha bitch."},{"body": "[It may take as long as 2 weeks for a kitten to be able to hear well.  Their eyes usually open between 7 and 10 days, but sometimes it happens in as little as 2 days.](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr07/9/14/enhanced-18799-1397069418-11.jpg)"},{"body": "you know that feeling when your shit gets fucked but youre to much of a bitch to say anything about it so you cry online"},{"body": "I absolutely love rats and bawled like a baby when I had to say goodbye to my last one. I'm tearing up a little right now thinking of it even. This is an amazing picture of that same moment."},{"body": "Also make sure those things are secure when transporting them. My one buddy was using his moms SUV to pick one up. He put it in back and everything fit fine. He hit the gas causing the keg to slide back (or tilt back not sure exactly) and completely shattered the back window, just like in the picture. \n\nSo if you're picking up a keg, be sure someone comes with you to hold it secure."},{"body": "A'ight, but it's karma. It literally does absolutely nothing on the website, is free to give away, and costs nothing. So what if a few that many people don't like happen to come to the top of the list. \n\nIf OP is for real, we are providing a little bit of solace in what is probably one of the scariest times in a man's life - Men will say that their daughters and sons are equal, but you can bet right now there are all kinds of emotions floating around with OP about being able to protect *his* little girl. It's fucking heartbreaking.\n\nIf OP isn't for real, we're rewarding a liar with imaginary internet points of which we have an infinite supply and for which there is no cost to hand out. Other than Gold, we literally can give OP nothing of value on reddit. With that in mind, I'd actually say that I hope this *is* fake, because otherwise OP is dealing with something very few of us have to deal with. "},{"body": "No it's not, it's fucking stupid. "},{"body": "I always felt this way when winter hits. To protect my health I'll drive a little slower."},{"body": "Please tell me you left him a basket of oranges the next day ....?"},{"body": "His shadow looks like a come-at-me Yeti"},{"body": "Yes, you're right.  This generation invented crime.  There were never criminal acts before this generation.\n"},{"body": "Frostbite, she's in there because she stayed out too long in Frozen™ weather."},{"body": "or meth"},{"body": "Jesus, that was brutal. Probably the most brutal penguin death I've ever seen."},{"body": "&gt; I can't believe you're a real person.\n\n&gt; I felt it would too condescending.\n\nLOL"},{"body": "AFLAC is targeting the club scene"},{"body": "you're not wrong, Walter...."},{"body": "I feel required to downvote because I agree with you and upvoting will give this atrocity exposure it doesnt deserve. so i'm upvoting your comment. \n"},{"body": "30 seconds? Damn. That's beautiful! Nice work"},{"body": "Half of this is your fault unless you were the first person to park out of the three cars shown. I used to yell at my girlfriend for this all the time because she had to get right up against the car in front of her and 5 times out of 10 a dope with the same idea would park behind her. Leave a foot-foot and half in front of you or if you are backing up to a car leave some room. "},{"body": "And Spike Lee?"},{"body": "that's not true at all.  good craft beers do come in sixth barrels, but that doesn't mean they don't come in a half barrel as well. \n\n"},{"body": "They have those in the US as well....? They used to have them all over the ice arenas here in So-Cal."},{"body": "Ryan! Oh god no more Isaac videos!"},{"body": "Coworkers are the worst sort of orkers!"},{"body": "For all we know you being late caused this crash in the first place. Nice going jerk."},{"body": "Live in SF, 100% you know what you're talking about. Ignore the mid westerners."},{"body": "I am reading this in bed while my two pet rats are running around under the blankets doing some shenanigans.\r\rRats are amazing, loving pets. I am sorry for your loss, and I admire you for teaching your child to love and respect animals. \r\rI am going to give my Gandalf and Yoda some extra cuddles tonight :("},{"body": "Do these foxes smell bad?"},{"body": "That's why I ask the tree!"},{"body": "/r/Facebook "},{"body": "yes we ned a face swap. I'm surprised nobody has done it yet. "},{"body": "Hey, let [me](http://www.finearttips.com/wp-content/uploads/2009/02/dora-maar-with-cat-194-952-mil.jpg) try that on when you're done."},{"body": "What is our world going to do with the over abundance of frozen shit when the fad dies down?"},{"body": "Hold \"F\" to pay respects"},{"body": "You can see them thinking!\n\nhttps://www.youtube.com/watch?v=IXPiO-VNPe0"},{"body": "Unless the parking garage is where OP lives."},{"body": "I've had to clean womens restrooms.... \n\nAt least (for the most part) with men's restrooms you only have to deal with urine on the floor because some people can't aim, but women's rooms? Absolutely disgusting."},{"body": "It's a stock photo: http://www.alamy.com/image-details-popup.asp?imageid={098D6840-5B0F-4697-8848-FD9E783121F6}"},{"body": "I read the top right hand corner as \"Low Brain\"\n"},{"body": "I mean even if your car had been under it there was no guarantee you'd be dead anyway."},{"body": "Good work soldier"},{"body": "You're absolutely right.  The official bird of Detroit is a pack of wild dogs.  Detroiters need to be less butthurt about the city's deserved reputation.  I say this as someone who went into Detroit for brunch this weekend and can't wait for DCFC season to start."},{"body": "Before realizing it's a kid I was imagining the person by the machine couldn't decide and ended up like Jack Nicholson in The Shining."},{"body": "At least you waited until winter."},{"body": "KARMA WHORE ALERT"},{"body": "/r/cargotechture will knife fight you to the death for it."},{"body": "Seriously! I second this."},{"body": "Dude! these are brilliant shots...and quite a coverage for a two year period. "},{"body": "I feel like part of your problem is that you're in The People's Republic of Boulder. "},{"body": "I had the same reattachment surgery when I was 11. The doctors said the issue was there for so long and were surprised they didn't find it sooner. Lucky for her to have that fixed earlier rather than discover it later :) I hope she is doing ok and enjoying all the popsicles she can. "},{"body": "Why did you steal Sloth's mask?"},{"body": "Awesome, thank you for the background on it! I was curious about it but didn't expect anyone to know that much about it. \n\nUnfortunately I don't have anything to scan it with, sorry :( this picture is just about as good as I can do without going out to a kinkos "},{"body": "NOT ORIGINAL CONTENT "},{"body": "Well it was, 9 months ago when this was posted.\n\nhttp://karmadecay.com/r/pics/comments/2rit2w/guess_ill_be_late_to_work_today/"},{"body": "Putin approves."},{"body": "take out the word \"literally\" and those could have been upvotes sir."},{"body": "Past me is a dick."},{"body": "Anyone would look bad in a shitty picture."},{"body": "And that ape is totally squishing one of them!"},{"body": "When the hitched vehicle is parked, and the other Parker hits said hitch, that's the hitch owners fault? "},{"body": "but the male body is disgusting and unattractive. Except brad pitt, I'd totally go gay for that guy."},{"body": "BYE FELICIA "},{"body": "Not \"gay\" per-se, but something related..."},{"body": "Set up a heating pad nearby. Turn it on low. Your cat will never do this again."},{"body": "http://i.imgur.com/P2vkwAS.gif"},{"body": "That's probably exactly what happened though, why would he post a picture otherwise?"},{"body": "Neither of these foxes has exhibited any aggression in the 6 months they've been visiting. There is no door between the fox and I in this picture, she was about a foot in front of me. \n\n"},{"body": "That little tear on his cheek ;( so many feels"},{"body": "Reminds me of when my ferrets passed away. Wish the feels would go away :("},{"body": "Thank you sir :)"},{"body": "Probably because all the fecal matter it lived in til it died "},{"body": "... and Jordan Two Delta."},{"body": "Did you try the mint ointment I gave you?"},{"body": "My wife's brother's kids have no sense of respect for their own things, let alone anyone else's. I'm constantly correcting them when I see them fucking up other people's shit. It drives me nuts. I feel your pain man. Hopefully you can get your brother to do the right thing here."},{"body": "And I don't know why you wouldn't use tineye to figure out that it is: http://www.alamy.com/image-details-popup.asp?imageid={098D6840-5B0F-4697-8848-FD9E783121F6}"},{"body": "[If your cat snores or rolls over on his back to expose his belly, it means he trusts you.](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr03/9/18/enhanced-buzz-27283-1397080897-15.jpg)"},{"body": "Best of luck with surgery! She's adorable. Keep us updated."},{"body": "No, no, no. In Soviet Russia, there is no best. This is Man's Equal Comrade"},{"body": "Your dog needs a flouro vest, safety issue. :)"},{"body": "jesus man"},{"body": "My penis needs DICK"},{"body": "aw, come on man, Google your shit. Those are wolves replicas, built with metal, hay and sheep skins. Pretty impressive. \n\nhttps://teachartwiki.wikispaces.com/Head+On+--+Cai+Guoqiang"},{"body": "I was completely fine until I read your comment, especially the part about showing your mom the picture. When one of my best friends passed away the only time I cried was when I told my mom that he was gone. I can normally hold it together, but as soon as mom comes into it I revert to being her little boy and it all comes out."},{"body": "I'm just wondering all the stuff she packed."},{"body": "That's why they don't give a fuck if their kids destroy someone else's property.  "},{"body": "We need to go deeper."},{"body": "It looks like there was a railing. It's just on the lower floor now that the car ran into it."},{"body": "I'll just leave [this](http://www.reddit.com/r/LosAngeles/comments/20xplq/parked_at_ucla_came_back_to_this/) here."},{"body": "What does the fox spell? "},{"body": "Yeah no kidding sounds like he is not very good at driving a manual."},{"body": "I was relieved after I read this comment. That is great news, I hope she makes a quick recovery!"},{"body": "Like how poets whore out their intimate thoughts to publishers.\n\nThis was a beautiful moment and I'm grateful it was shared with me."},{"body": "Internet Icon?  I like to think of it more like a Patron Saint."},{"body": "Or just push and to hell with the towel."},{"body": "Truth."},{"body": "Ainters gonna aint!"},{"body": "[Giant Peter you say...](http://img1.wikia.nocookie.net/__cb20101230202917/familyguy/images/4/48/Houseofmunch.png)"},{"body": "It's a stock photo: http://www.alamy.com/image-details-popup.asp?imageid={098D6840-5B0F-4697-8848-FD9E783121F6}"},{"body": "Pedophilia is bad mmkay"},{"body": "well, if you think about it... the cup is kept upside down most of the time, cuz it rests more than it being used. \nSo, quality control didnt quite fail "},{"body": "Huh, cool thanks. I had heard they were super energetic but didn't know they were that high strung. \n\nI like bigger dogs anyway. A fox would be too small for my taste in pets. If anything it would be neat to have one that comes to your backyard for food or something. "},{"body": "Doesn't matter had beer."},{"body": "pet that cat for me next time you see it! :)"},{"body": "God, this bot/troll is everywhere today. It's annoying. "},{"body": "90s reaction: \n\nI'll just have these burly men help me out!\n\n2010s reaction:\n\n&gt;That fucken guy, I would have slashed his tires then slash his throat then shove some mentos up his ass and down his throat while he is bleeding to death\n\nWhat the hell happened?!?"},{"body": "&gt;Sad that the lies have convinced you, just consider the possibility.\n\nWhat lies are you referring to? Or are those also assumptions you are conjuring?  Considering possibilities is widely different from assuming and accepting the most unlikely.  "},{"body": "I think your camera has cataracts."},{"body": "This almost makes me feel bad for wearing K-leather football boots......almost....."},{"body": "At least it wasnt a fenced in dog BC then it would have been shot."},{"body": "Excuse me while I hug my ratties"},{"body": "Its Ontario. They are pretty expensive. But because of labour laws, it's pretty hard to fire someone. "},{"body": "My car has a decaying paintjob. I love when this happens to me and I can bump them away. It's like a very slow, very boring demolition derby that still feels awesome from the inside of the car."},{"body": "Oh, I really ought to read the books. "},{"body": "hwat"},{"body": "Just like your mom. "},{"body": "I'm guessing you were fired since you haven't showed up for 9 months.\n\nhttp://www.reddit.com/r/pics/comments/20ypqj/parked_at_ucla_came_back_to_this_xpost_rlosangeles/"},{"body": "Early bird gets the worm, but the early worm gets a spot in the early bird's stomach and can't escape from it "},{"body": "long haired males are not different"},{"body": "Cat."},{"body": "I'm off the cheeseburgers!"},{"body": "There was a thing on here a month or so ago about this. Apparently people where buying heroin thinking it was some other drug and getting sent to the hospital. Don't buy street drugs in Amsterdam kids. "},{"body": "I imagine those are mildly terrifying at nighttime. "},{"body": "DONT ASK ME HOW IT GOT THE KNIFE JUST RUN"},{"body": "Where's Elon Musk with our rotating cars of the future?"},{"body": "Gimme ur nuts! You gotta have some nuts! CMON LADY COUGH EM UP!"},{"body": "Yeah, two seconds really wouldn't make a difference. "},{"body": "I think what he was trying to say was that if he had been just 2 seconds further along in his travels, he would have been squashed like a bug.\n\nWeird way to say it though."},{"body": "When measuring outside the US, for the most part, no, it's meters. However, when measuring heights, like this 22k feet, that tends to stay in feet, or millibars. This pretty much goes back to Soviet Era where all of the commie countries used meters and the rest of the world stuck with feet, hasn't changed since. Russia and China still use meters and the rest use feet. It's odd seeing as how the ICAO standard unit is a meter. Also, since there are 3ish feet to a meter you can be more accurate with flight level as is written in the community,  eg: this was taken at FL220. Or if you're at a lower altitude it gets more specific, eg: FL015. That being said, instruments do have both measurements on them. "},{"body": "Of course he did, it was his baby!"},{"body": "Comparison unclear, please provide banana for scale!"},{"body": "I've since moved on we have daylight now, didn't last there long.  "},{"body": "Have had rats and honestly chinchillas make better pets they are less scratchy less smelly, cuter and have more personalities"},{"body": "Yeah I agree, probably wouldn't be seeing a family member very much if they did something like that. \n\nJust saying it's ridiculous to sue a family member because their kid scratched your TV. "},{"body": "My sister bought me some off amazon for Christmas. I love them. http://imgur.com/djVWKgh"},{"body": "This is similar to my story! She was in the garden while I was eating a sandwich.  I threw her a bit and she's got closer ever since. "},{"body": "Well yes. Blame them for being an idiot. But a nonidiot could have been killed by an idiot's actions."},{"body": "Your submission was removed as it violates rule VI: Submissions must link directly to a specific image file or to an image hosting website with minimal ads."},{"body": "In Sao Paolo Brasil, the bumpers are *bumpers*.\n\n"},{"body": "One of my rats is in the midst of late life cancer. I'm at work and now my coworkers are asking me if I'm okay. Darn you feels. "},{"body": "So *that's* where rain comes from!"},{"body": "Why do people refer to women as \"females\"?"},{"body": "I dont give a crap about karma I just dont like these post that flood r/pics every other day. I mean there are subs made for op's post but he went here. Do you know how many kids are going into surgery today, a fucking lot, now if all of those parents posted it this sub would be just another form of facebook."},{"body": "The cure is MORE 90s!"},{"body": "uhhhh yeah a metal railing like that is clearly not sufficient."},{"body": "YOU CANT UNDO INTERNET PICTURES HEA IMMORTAL OKAY?"},{"body": "Hey Rizzo!\n"},{"body": "Brace yourselves, the grammar nazis are coming"},{"body": "dogsvidaniya"},{"body": "What exactly did she bring? Just a bunch of clothes? "},{"body": "HULK smash?"},{"body": "The curiosity is killing me....\n\nDoes your fox just *play* Scrabble or does it try to communicate?  and if so,.........**what does the FOX say?!?!?!**\n"},{"body": "It doesn't make OP gay it makes him a faggot."},{"body": "came here to say that."},{"body": "Wife has a Mazda3 just like this one, only not red.  I've made sure to strap everything that might slide back into that window down.\n\nPictures like this would be crazy."},{"body": "Wow such dogecoin. Much thanks!"},{"body": "Thank you was wondering why it didn't work."},{"body": "Oh my! You're doing quite well for yourself. Surely, nepotism has had nothing to do with your successes in life; cum hoc ergo propter hoc."},{"body": "So meta"},{"body": "/r/pimpcats"},{"body": "."},{"body": "Trophies grow over time as more names are etched into the side. The cup itself is pretty standard in size. Even the Stanley cup was quite small originally."},{"body": "&gt; Gothic industrial onesie\n\nNeeds spikes and stompier footie area.  "},{"body": "I see your in adequate barrier and raise you and the guy who somehow needed it. \n\nIn other words... how did this guy just drive off the ledge?"},{"body": "This man looks like a stereotypical British guy you'd see on propaganda. "},{"body": "I was going to say the same damn thing. Obviously, if OP wasn't the first to park, he got right up on someone's bumper/fender and someone did the same to him. Tough luck, but you live and learn."},{"body": "Oh, oh, my bad.  That's the word I was looking for.  OP's a faggot."},{"body": "Looks like a blue Sparrow https://britishfoodhistory.files.wordpress.com/2011/08/sparrow.jpg\n"},{"body": "Dammit guys, I'm trying to sit here giving my kitten the stank face for peeing on the carpet instead of the litter box and you're not making it easy. "},{"body": "There was a cure in the 80s."},{"body": "kinda looks like matt from the vampire diaries, kinda."},{"body": "Last time my son was there, they wheeled a XBox One into his room. Let him have it for most of the time he was there. "},{"body": "I already know, I've watched it on Netflix a couple times already :) It's easier than sticking the DVD in haha."},{"body": "No more than breast implants pop when you squeeze them. ;)"},{"body": "All you need to do is have a stroke and you're set."},{"body": "Jesus you people are weird.\n\nEdit: And I don't specifically mean the person who posted the comment, I mean the hive mind that upvoted it 1592 times. I suppose anyone could notice that and make a comment, but the fact that it became the highest upvoted comment... christ... lemme say it again: Jesus you people are weird."},{"body": "Glad for the good news! And I have no idea how someone could be offended by this post. Just ignore them. They don't matter."},{"body": "\"hey Mike, yeah i fucked up\"\n\n\nedit: on a lighter note, i doubt they'd fire someone over what looks like 100 egg cartons at most. Bulk probably only lost maybe 200 bucks. I'm sure the company can sorta accept a few broken eggs every year :)"},{"body": "I'm surprised he got out."},{"body": ""},{"body": "It's not just look at my dog, I think the picture itself is beatifulwhich is why I put it here"},{"body": "or you can let him do what he pleases with his life"},{"body": "what is life??"},{"body": "hope everything went well, as a new father i can imagine how stressful this is for your family. "},{"body": "Because like me you were looking for why OP would submit this picture. So what was odd there, out of the ordinary? The monkey of course. Until you see one woman wave her arm - literally."},{"body": "That and, you know, onions. "},{"body": "Just makes you want to move"},{"body": "Wow, /u/TechnoAllah even reposted the top comment"},{"body": "OG Tomato Kush"},{"body": "What about a handful of sand?"},{"body": "I guess you could call this a re-post.\n\nI'll be here all week. All year. I ^have^no^friends^bye"},{"body": "Grow up"},{"body": "Might want to talk to someone about that"},{"body": "OP is a karma-whoring bundle of sticks."},{"body": "persepolis is very very biased not at all an accurate reading of history"},{"body": "No you don't. Why on earth would you think that?\nhttp://finance.zacks.com/happen-short-stocks-bankruptcy-8444.html\nhttp://www.investopedia.com/ask/answers/03/082803.asp"},{"body": "I am reminded of the stories of all the people that were sick/late for work at the Towers on 9/11..."},{"body": "Rats are a surprising amount of work. Their bedding has to be changed 2-4 time a day because their own urine destroys their lungs and exasperates myco infection symptoms. I have to give my rat antibiotics 2x per day or else he will suffocate on his own polyphorin and congestion. They can be fantastic pets, but any animal, including fish, ties up a lot of time and resources. Really consider that before getting one. Cats, however, are probably the lowest maintenance animal out there."},{"body": "Back in about 2003 we had a large snow storm on the east coast, almost 3 feet in the D.C. area which is a lot for us. My parents and two of our neighbors had chipped in on a snowblower to share between our families in big snowfall. I had finished doing our 3 driveways, and I had some extra fuel.\n\n\nA new family had moved in across the circle, and had been there a few months without introducing themselves. They were from England, that's about all we knew about them. I went over in an attempt at friendliness and started clearing their driveway for them. They came out of their house and stared at me for a few minutes, went back inside, came back out and asked me what I thought I was doing. I explained that we had a snowblower we all shared on this street, and that I thought they might not feel like clearing almost 3 feet of snow by hand. The guy just went \"HMMPT\", rolled his eyes at his wife with a look on his face like he just smelled a fart and started walking away. So I said alright then, and cut it off completely and walked back across the street. They were out there later struggling for hours trying to shovel it."},{"body": "(So dank!)  So show me all your memes"},{"body": "My grandpa does this for a few houses in his neighborhood. He just really loves his snow thrower."},{"body": "but breast implants don't normally have a chance of most of a person's body-weight sitting on them."},{"body": "\"Yeah, all the bread you can find. Don't forget the cinnamon too.\""},{"body": "I'm on 27 year and hopefully getting out of this place within the next year.  Place is too expensive and the kids are off to college so I'm thinking  somewhere rural or in the woods (wife and I both love nature).\n\nGlad you have daylight and like where you are.\n\n"},{"body": "If he's anything like me, and has a riding tractor with a snowblower, I can't wait to get some seat time on that thing when we get snow."},{"body": "Maybe architect likes neat skateboarding? "},{"body": "That's soft. Surely I've said more abrasive things than that. I'm not subbed to /r/pics but every so often I check /r/all to remind myself of the depravity that is \"the defaults\""},{"body": "Neat!"},{"body": "&gt; Yep, blame it on someone else for being an idiot and running into the rail and over the edge. Murica!\n\npretty obvious you aren't an engineer"},{"body": "So majestic"},{"body": "Interesting- I just did a search for my location- Colorado- can't seem to find anything. A few forums that some random internet folks claim \"I have never heard of that here in CO\" but even on the government sites I'm not turning anything up. "},{"body": "Hopefully you'll learn not to park so close to the vehicle in front of you. Folks should also learn to leave enough distance between you &amp; the car in front of you while driving. Let other cars in and you'll get far better traffic flow (faster travel time) &amp; far fewer accidents. Especially don't pull right up to the vehicle in front of you at a stop light etc to leave room to drive left or right in an emergency. Could save your life (or family)."},{"body": "Do tell me how my comment was childish in any way. Just because you dont agree with it doesnt make it wrong."},{"body": "Herlock Sholmes"},{"body": "I'm surprised he has not been detains, beaten and arrested for not fitting the norm. "},{"body": "I hope he calls it his rattoo. "},{"body": "Your theory requires that Mr Important Businessman drives a tiny red car and not the massive black town car that is hemming it in."},{"body": "It's for the power piss.  You grab on with both hands so the pressure doesn't blow you backwards."},{"body": "Its actually 2-4 years depending on environment and health"},{"body": "Seriously. Just stop and think about this for a while. If he'd have left out the surgery part, this wouldn't have gotten any attention at all. \n\nWhile this is a pic, it's certainly not a noteworthy pic, and therefore, shouldn't be upvoted. "},{"body": "TREECEPTION !!!!!!!"},{"body": "Kinda looks like the candy guy needs to keep his wiener under wraps."},{"body": "It spins. I'm not sure which way is up. Small in size. Kind of beat up, probably not great quality. "},{"body": "Welp, *he* didn't work here long."},{"body": "I've never seen one. Almost every vending machine that I saw when I was in Japan served hot drinks."},{"body": "Yep, heres a photo i took of one a few months ago.\n\nhttps://www.flickr.com/photos/128072713@N07/15761615170/ \n\n"},{"body": "What brought you to google-land?"},{"body": "I've done that in Boston when I got parked in much like OP did. All of the handbrake, full wheel over, dump the clutch. "},{"body": "Friends brother with big truck used to go out and compete with tow trucks when there was a big storm.  He would help you out for 20-50 \"gas money\".  He wasn't there for the love of the game, he was making money."},{"body": "Please try it...the suspense is killing me."},{"body": "Get a sense of my penis in your face. "},{"body": "&gt;It's a short drop, not really that dangerous.\n\nI was only disputing the above statement.  But I completely agree with you - it should be legal to drive cars through any barriers they are capable of breaching."},{"body": "I did take this picture, every once in a while I take a photo that I look at and think, \"wow, that's amazing\". This was one of those photos. Thanks for the kind words, friend!"},{"body": "God damnit..."},{"body": "Good luck little one! We love you!"},{"body": "See that bike that is crashed on top of the fallen railing? OP was the rider of that bike. 2 seconds sooner he and the bike would be under the railing which is itself under the car."},{"body": "Stuart, Stuart, why has thou forsaken me?"},{"body": "Look up Holmes Inspection season 1, episode 8 on Netflix (if available)."},{"body": "Nobody got the joke. I got the joke, bro. "},{"body": "q__q you so nailed it\n\n"},{"body": "You dumb bastard. That's not a schooner, it's a sailboat!"},{"body": "Bullshitting OP"},{"body": "As a former father myself, this is good news to hear! I hope she stays well!"},{"body": "[Kyle?](https://www.youtube.com/user/AwesomeSauceNews)"},{"body": "\nI hope he leaves an aggressive gasoline-soaked necktie in the fuel filler ready to be lit"},{"body": "Your little man is breaking my heart :(\nI'm very sorry for your lost. I can tell he was very loved."},{"body": "My 4 year old got an Appendectomy for christmas.  He is a boy but we were rolling just as deep.  Daddy's laptop bag had my Samsung tablet, his Leappad, my laptop and chargers for all of the things.  I truly don't know what parents did without netflix."},{"body": "Me and Stanley are friends and we always just joke around with each other. But because of the language barrier it gets weird sometimes,  this was one of those times"},{"body": "Came home from work once and found a car parked right behind my wife's car and since there wasn't a lot of parking space in front of my house I parked right behind the other car. I knew my wife would be leaving for work soon so I knew they would be able to get out and frankly I was a little pissed off someone would park there. My wife said when she got in her car there were 4 guys sitting in the other car waiting and none of them would even look at her."},{"body": "Hmm, that is a good point. Honestly I never thought about the matter that way before."},{"body": "That would never work if OP has a penis.  All those guys were hoping they'd get a gang bang reward."},{"body": "Looks like some kind of building violation according to other people in this thread."},{"body": "*his_majesty*"},{"body": "I see what you did there..."},{"body": "being early for work would have also saved your life..."},{"body": "Chandlers make candles. \"Chandeliers.\" "},{"body": "Ha. God damn myself for laughing at a dick joke but there's something creepy about that smile"},{"body": "1st frame: Listening to its heartbeat during their 1st date.\n\n2nd frame: Proposing to marry it.\n\n3rd frame: married and holding it in his arms."},{"body": "Any dice? Hopeful his insurance can cover that."},{"body": "Oh, look at you defending dumb people. It's noble work you're doing."},{"body": "[http://imgur.com/qvbH3Ac](http://imgur.com/qvbH3Ac)"},{"body": "Exactly,  Thank you! "},{"body": "Wow that's impressive. Congrats!!!"},{"body": "He's Hispanic"},{"body": "Should have said that the Nebula was dying of cancer and this is the last time we will see it, then it might get some upvotes"},{"body": "Look like white beef curtains. "},{"body": "That would explain the amount of flies around the plum cherry trees in the backyard"},{"body": "Great news biggy. She is such a brave girl! I hope she has a quick recovery and happy, healthy 2015."},{"body": "Of course. Btw, would he have to use a sword to cut it?"},{"body": "Wet Seal didn't pay severance to a lot of their workers.  Yes, they can sue them for lost wages but when your company is going bankrupt, you will not get anything but a pile of expenses from trying."},{"body": "\"It's time to make like a shepherd, and get the flock out of here.\""},{"body": "Awe, the confusion of tea, iced tea, sweetened iced tea, and nestea...  The struggle is real."},{"body": "I don't expect everybody to get my sense of humour. Sometimes I'm downvoted, sometimes I'm upvoted. It's all in the game. But yeah, downvotes for well wishes is a bit faggoty, even by Reddit standards. "},{"body": "I have a very similar issue with an all black cat and a set of black living room furniture. You have to double check the couch before you sit down, especially if the light is low. She can make herself practically invisible."},{"body": "Looks like upside down hebrew"},{"body": "while houses and floors sag over time, without much weight on it it shouldn't sag significantly.  You should get that checked out to be sure you don't have some kind of damage that could kill you. Even a simple roof leak can slowly cause rot and then symptoms like you are seeing."},{"body": "Or you could have left ten seconds earlier and been fine and on time. "},{"body": "Left hand down...my...steering wheel hand?"},{"body": "Thanks, I'll try that"},{"body": "Very glad then! I can't view images on my home internet (which is like half of reddit and almost all of the front page) so I feel left out often. I usually have to read comments and figure out what the image is in posts"},{"body": "Then you tell him \"yup, ill just weekend at bernie's you\" unfortunately you writes then have to keep him home so he could watch weekend at bernie's to understand the reference"},{"body": "He's still too red to be trusted :-("},{"body": "Bolin is that you?"},{"body": "I bet OP wishes he would have submitted a different title because now everyone is arguing over it. \n\n"},{"body": "[Domestic cats purr both when inhaling and when exhaling.](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr04/4/16/enhanced-5347-1396643152-18.jpg)"},{"body": "You wouldn't happen to live in South Elgin IL, would you? That house layout is exactly like my friends house..."},{"body": "You're right that someone had to sign off on it at some point. However, that point probably predates the spreading cracks."},{"body": "Why did you take a picture of your son crying and post it on here? Thats an intimate moment."},{"body": "I'm inspired to get the plow attachment for our riding mower, but I live in Seattle area, probably will get no snow this year."},{"body": "If scientists look at a star, they can see what's happening to it, just delayed by distance. If they see a star is about 2000 years away from supernova, but it's 5000 light years away, they can assume it blew up 3000 years ago"},{"body": "This is one of the few things I love about winter. The serenity of a quiet night with fresh snow, and the strange surreal brightness that comes with it. Excellent shots."},{"body": "Dude I'm just impressed that you parked it in so small of a space"},{"body": "Maybe they're trying to tell you something."},{"body": "I think most redditors, if they knew about it, do or would care - including me.\n\nGlad she's out and fine and looking forward to recovery and time with dad."},{"body": "Unfortunately it's also a repost, his job must be reddit."},{"body": "He did not. Also the cop let him go without a breathalyzer and the witness said he told her he was in fact drinking. Also under age and no drivers license and insurance. Also had a warrant for arrest. HPD at its finest. "},{"body": "I hate to think what kind of dull dry world you live in where the concept is completely implausible that a person might have in the past worked at a mom and pop hardware store which had 2 cats as store pets."},{"body": "who knws? you might have hit a traffic light, or not? maybe some traffic jam or whatever."},{"body": "Note to self, never move to san fran."},{"body": "Aww, I'm sorry for poor Rizzo and your son. I was eight when my pet rat died, rough time, but also a valuable lesson."},{"body": "I WILL NEVER SHOP AT WET SEAL AGAIN!!!!\n\n\nWhat's Wet Seal? We don't have those around here... "},{"body": "Hey sorry about the jerks. I dont care if you already posted, this was beautiful to see. Unless you've had a baby it's so hard to understand the feelings. I got teary looking at the pics. Congrats!  Enjoy the ride :)"},{"body": "\"One ring to... something something....\""},{"body": "I remember seeing someone's jeep with a 3 foot long steel spike attached to his hitch in the mall parking over here. Didn't have a camera so no pics, but that thing looked like a bucket of amputating fun."},{"body": "I thought after the last time this happened they wouldn't let Tom Cruise drive again?  [Ghost Protocol joke]"},{"body": "[When your cats rubs up against you, she is actually marking you as \"hers\" with her scent. If your cat pushes his face against your head, it is a sign of acceptance and affection.](http://s3-ec.buzzfed.com/static/2014-04/enhanced/webdr03/10/11/enhanced-buzz-2336-1397144925-4.jpg)"},{"body": "pull our your jack, jack up each car and then push it over onto the grass.  You'll have the ass end of one car on the grass and the front end of the other on the grass.  Fuck them.\n\nIf you're really pissed off push them into the street so they block the lane."},{"body": "O.P's. title is the semantic equivalent of a big, red arrow."},{"body": "Yeah its awesome to be carded and inspected by concerned citizens, retail workers and others to use a washroom. "},{"body": "From left to right:\n\nSitting headbanging Ewok, weasel freaking out and jumping upwards, old grumpy pirate being carried away by thin-legged zombie."},{"body": "When did this turn into instagram?"},{"body": "STOP"},{"body": "Pink Freud are a Polish jazz group. \n http://www.discogs.com/artist/155790-Pink-Freud"},{"body": "&gt; 1)Its clean. There is no dust on anything, the fixtures are bright and shiny, and most importantly there are hardly any only stains on the concrete.\n\nParking garage near me is routinely cleaned. Including marks on the floor. It's been there for as long as I can remember and looks as clean every few months (I think they do it twice a year).\n\n&gt; 2) A car drove through a substandard guard rail. That defect was sure to be changed the first time a car drove off the slab and crashed to the floor below which means that this is the first time this has happened which means the parking structure is new because lots of people suck at driving and it probably wouldn't be very long before that happened.\n\nDon't go through life assuming the worst will always inevitably happen (**lots of people suck at driving and it probably wouldn't be very long before that happened**). That's a terrible way to come to a conclusion like this. Would they go into a murder case \"lots of people kill, so it wouldn't be very long before our suspect killed his victim\"?\n\nFurthermore, you're literally seeing **1** area, 1 *very* small area of what could be a huge parking garage.\n\nNot outright saying you're wrong, could be right for all I know, but you're really just guessing here."},{"body": "OP IS A PHONY!\n\n"},{"body": "I already have to use both hands when I piss.\n"},{"body": "None of those things guarantee that the building is new. I could point out that there are black spots where gum has been thrown out of the window or that the turn arrow paint is pretty faded. That doesn't mean it's older either, because it could he a very high traffic garage for all I know. Maybe they used crappy paint that faded quickly. "},{"body": "https://www.youtube.com/watch?v=0jFGNQScRNY\nDmitry Belyaev and Fox Experiments\n"},{"body": "I had a rat named Rizzo... she died from a brain tumor, too. I'm going to find a corner and cry now, thanks reddit. "},{"body": "Same thing happened to me. The worst part is that I was picking up a dresser from my ex boyfriends house. He watched it happen.  \n  \nVery awkward."},{"body": "/r/gaming"},{"body": "op is very punctual"},{"body": "Facebook is that way, I'm not your friend buddy"},{"body": "Look up the \"farm fox experiment\" pretty cool research on the heritability of domestic traits like docility."},{"body": "I work in a children's hospital and about 90% of the girls that come through have something frozen related with them at all times! \n"},{"body": "(•_•)\n\nLooks like this arm...\n\n( •_•)&gt;⌐■-■\n\n... has trouble written all over it.\n\n(⌐■_■)"},{"body": "If that is a European size 13, that pineapple isn't big at all."},{"body": "Ironic part about it is that, I had just replaced that exact door from a previous accident. "},{"body": "I had no idea! That blew my mind. How did I not recognize the voice?!"},{"body": "or just ignore it and drive to work like any other day. That's how we deal in the Northeast anyways. Gotta be at least 3-4 inches to be worth shoveling."},{"body": "That's what you get for buying produce at Walmart."},{"body": "http://i.imgur.com/z46Kxx1.png"},{"body": "How fucking lucky are you too have an orange tree, i'm so envious..."},{"body": "You'd be wearing a beautiful bonnet hat. "},{"body": "That pug penguin...yes."},{"body": "Haha seen that before "},{"body": "Congrats! It's a wild ride!! Enjoy every second. Take pics every day. "},{"body": "no airbags?"},{"body": "/r/adviceanimals"},{"body": "Yes the top comment on that one is better."},{"body": "Thank you! That makes it much clearer. My wussy self appreciates that. I may have to go back and watch the whole thing now."},{"body": "Your kid's sucking up to her, beware!"},{"body": "Is that how it works? They don't have to sign off on the plans or anything to make sure its architecturally sound?"},{"body": "I must have a failjew friend. Showed him this years back. Looked at it and shrugged. "},{"body": "&gt;Unregistered Hypercam 2 watermark\n\nThat is something I have not seen in a long, long time"},{"body": "Just like bone-itis"},{"body": "Holy shit, that was great! Can't believe I haven't heard it until now. I'm loving the resurgence of music influenced by past generations lately."},{"body": "Cool! :•)"},{"body": "Show this picture to a bunch of hens and they will be PISSED."},{"body": "Houses of the holy's in there too"},{"body": "Anyone else sensing final destination?"},{"body": "This song has been stuck in my head for weeks. Somehow, I didn't realize it was called Uptown Funk."},{"body": "Which is weird because the I will contraction is the first contraction most learn in English. Granted contractions in English are hard as shit too "},{"body": "[huh, TIL](http://en.wikipedia.org/wiki/Chandler)"},{"body": "I'll be honest, some of his earlier work really put me off of him to the point where I just avoided his work.  But that was really good.  I'll have to give him another listen."},{"body": "Oh fuck, I haven't laughed that hard in a long time. Bravo."},{"body": "I had a rat named Spot when I was his age. She used to sit on my shoulder &amp; wrap her tail around my neck. I always felt so comforted by that. She was my little companion.\n\nShe had a tumor as well, and the day she was put to sleep I remember my mom taking my to breakfast &amp; telling me I was learning to be grown up. Spot taught me a lot. \n\nThanks for sharing this pic"},{"body": "&gt;  her daughter is taking bags of luggage while on her way to surgery. That is cute/funny\n\nwhat? Why?"},{"body": "Tibetan: Om mani padme hum/སྤྱན་རས་གཟིགས་"},{"body": "Now that you mention it, my doorframe does feel a bit rotted underneath its top."},{"body": "Yeah this is definitely pretty much Ronson's best song, and Bruno's. Mark Ronson has a lot of grooves though.\n\nSome of the others I like:\n\n[Valerie](https://www.youtube.com/watch?v=4HLY1NTe04M)\n\n[Bang Bang Bang](https://www.youtube.com/watch?v=TM6TCGltfHM)\n\n[Kings of Leon - Pistol of Fire Remix](https://www.youtube.com/watch?v=iaJ6dNnhGIo)\n\n[Kaiser Chiefs - Oh My God Remix ft. Lily Allen](https://www.youtube.com/watch?v=qnDo6mR6fp8)\n\n"},{"body": "oh my gosh ... my heart aches for you and your wife. (((hugs)))"},{"body": "If we were talking about an important meeting or interview, yes. Since we are talking about showing up to a regular day at work, on time is on time and 10 minutes late is probably fine."},{"body": "And if you had left home 4 seconds earlier you'd be working. Slacker."},{"body": "Yo dawg, I heard you like wood, so I gave your wood some wood..."},{"body": "This is a great and simple idea"},{"body": "I'm really jealous that Tom Hanks got to meet your wife."},{"body": "That means he's won a tour of the Wal-Mart factory in Arkansas. There's a scary boat ride and singing slave midgets. "},{"body": "Great brows too"},{"body": "He became better known in England by making headlines after escaping his care home to pay his respects in France for the 70th An anniversary D-Day commemorations last summer, http://www.bbc.co.uk/news/uk-england-sussex-30699446 "},{"body": "I guess I'm wrong? sorry. I tried. I said thats my guess. \nand yeah I think Kamloops is cool. "},{"body": "...bind them"},{"body": "So when we saw these in 2014 we were seeing into the FUTURE?\n\nhttp://www.reddit.com/r/funny/comments/2l81r4/lololol_dirds/\nhttp://www.reddit.com/r/HybridAnimals/comments/2ml798/a_collection_of_dirds/\nhttp://www.reddit.com/r/funny/comments/2lflwf/i_present_to_you_dirds/\nhttp://www.reddit.com/r/pics/comments/2ldpfg/i_present_to_you_your_newest_biological_atrocity/\n...etc...\n"},{"body": "Pardner, you've got foundation issues. Good news: your roof will probably not fall on you. Bad news: get out your wallet and I'll show you."},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text."},{"body": "The language appears to be Indian or Devanagari, which is the parent language of Indian. Sorry I couldn't help more. "},{"body": "Dear lord- that's not cool. Sounds like a great submission for /r/shitty_car_mods! "},{"body": "&gt;Is there something about being a dude who likes to fuck dudes that makes you a fantastic neighbor?\n\n\nThis provided my ab workout for the day.  Thanks"},{"body": "Did this come with an instruction manual or a tutorial?\n\nIt looks like a plumber is trolling you."},{"body": "Your submission was removed as it violates rule I: No screenshots \n\nYour submission was removed as it violates rule I: No pictures with added/superimposed text."},{"body": "I saw 85 all over Utah"},{"body": "Not nearly all income is taxed.  As a business a lot of my income isnt taxed.  As a contractor, I also have a lot of income that isnt taxed.  There are tons of very legal ways to \"evade\" tax on income.  I dont see why you would pick those making the least possible amount of money to say those ones are doing it illegally.  "},{"body": "Holmes or homes?"},{"body": "It's obvious he loves his daughter. Your a child for using this as a moment to try and be some moral champion. Either be supportive or keep your mouth shut. He posted a picture because he loves his daughter and wants to share it with the community which sadly you are apart of. Assuming he isn't with her the whole time because of one picture is absurd. There is a reason you are downvoted to the bottom brother. :)"},{"body": "i assume we'll never know since op for some reason decided to create a throwaway account to post this and then abandoned the thread"},{"body": "Sorry, can't hear you over my FREEDOM."},{"body": "/r/TheSouth"},{"body": "Yes, that was the original reason.  By the way, he just died, I found out!  RIP you poor old SOB!\n\nBut in later interviews, he played down the religious aspect and made it more of \"day of rest\" for employees and franchisees.\n\nThe WSJ and others are already speculating what will happen now that the Sr. Cathy has died.  Will there be an IPO?  Will some of the kids wan to cash out?  Will they keep it in the family?\n\nIf they do an IPO, I suspect the \"closed on Sundays\" will likely go away, at least in some stores.\n\nTo me, it seems unfair that a franchise should be granted for a PUBLIC SPACE like an airport or a thruway rest stop, where the public uses the space on Sundays - and allow the franchise to close on Sunday.\n\nHeck close on Fridays for the Islams, Saturdays for the Jews, and give everyone a three-day weekend!"},{"body": "RIP e-brake"},{"body": "[Gaudi] (http://i.imgur.com/tQbw37W.jpg)"},{"body": "You had a chance to get to the front page, all you needed was one banana."},{"body": "[eat it?](http://holeinthedonut.com/2010/06/01/mexico-food-nopal-cactus/)"},{"body": "/r/HistoryPorn   \npretty cool"},{"body": "Poses for picture in paper, stung by a bee a few minutes earlier."},{"body": "The thing is that it's the building inspectors job to make sure things are safe and to code. If they failed to do so then they made a mistake. Just because the inspector would get in trouble doesn't mean the driver is still not at fault for driving through a railing. They are both at fault. MURICA, har har."},{"body": "Lol!!! I love this!!"},{"body": "The Starscream of reddit."},{"body": "Hey, this is my friend's cat and dog. \n\n/u/Logic007"},{"body": "I remember looking my son's surgeon in the eyes right before they gave him the valium equivalent and took him back to the OR.  I've never been so confident that I was ready to kill another human being if the operation went south and it honestly kind of scared me."},{"body": "2 Flash 2 Franks? I feel like I'm getting further away..."},{"body": "I put petrol in my car, not sure what you put in yours"},{"body": "[\"Shut the fuck up and put it on you look SCARY\"](https://www.youtube.com/watch?v=Felz8fwoX4w) "},{"body": "Congratulations! I'm sure she'll make a speedy recovery"},{"body": "Must have been taken in the southern USA."},{"body": "Can we leave the Bill Murray fanaticism in 2014? Along with all of the Keep Calm and whatever bullshit?"},{"body": "Corpse or it didnt happen."},{"body": "[Indian Jewelry](https://www.youtube.com/watch?v=Hwtl0g3ntCk)"},{"body": "It looks fixable."}]