[{"body": "I don't think you have seen Austin powers.", "score": 1},{"body": "It's the fact that his hair keeps getting better and better. His hair on his last late late show was amazing.", "score": 1},{"body": "Indeed. OP enjoy your new car and make sure the intake gaskets are good and it should last until it rots away.", "score": 1},{"body": "I remember going to see Die Hard 2 at the Drive-In when I was probably like, 6 years old. Seems like forever ago, and then Austin Powers seems so recent, but it was a LOT closer to when I was 6 than it is to me as a 30 year old.", "score": 1},{"body": "I'd say your wife is a MILF, but I think that might be improper of me. So I won't, not even a little bit, I wouldn't want you to take it the wrong way. ", "score": 1},{"body": "I could have sworn I saw something like that as you head east on the Burnside bridge, south lane. This was a few years ago and that looks way too new though.", "score": 1},{"body": "Thanks! I thought so too. It was a nice end to my day. ", "score": 1},{"body": "Best an Asian airline picks a color that can be easily seen by search and rescue boats and planes after their flight goes missing. ", "score": 1},{"body": "What better way of getting the word out? Posting in a regional subreddit where people reading it are more likely to be able to help. I understand that OP did that too, but it's a waste in this sub and is a distraction to real posts. Something like this post (and the emotion-baiting title) in a large sub like /r/pics is a waste and a distraction from the rest of the sub.", "score": 1},{"body": "This brings back bad memories... One summer back in highschool I worked at my grandparents used car lot. My job was to clean salvation army buses that had previously been used to transport homeless people. They were all terrible, but one yellow stain in particular smelled like seafood, and death. I scrubbed that motherfucker off and on for three days with an industrial shampooer and the smell WOULD NOT go away! After the third day of dealing with that bus in particular I quit and to this day the smell of old seafood makes me wretch!\n\nTLDR: go to a carwash, these projects are known to scar the human psyche.", "score": 1},{"body": "enjoy that pneumonia ", "score": 1},{"body": "20 years or not, I'd hit it both times. ", "score": 1},{"body": "It could have been good if there were aliens or at least threats. Instead they turned it into a chick flick. They showed awesome aliens on literally only 1 episode.", "score": 1},{"body": "How much of an asshole would you feel like if they actually did use a sperm bank?", "score": 1},{"body": "But I don't see any people with frozen hair. What am I missing? ", "score": 1},{"body": "Okay\\\nSource: okay", "score": 1},{"body": "I can see this going places.", "score": 1},{"body": "No wonder I'm not a huge fan of either movie. I'm 36. GOD-DAMN-IT!", "score": 1},{"body": "I'm so sorry you're going through this.  My family just had to let our 13 year old dog go about 3 weeks ago because of cancer, and even when you know it's time it's still such a hard thing to deal with.  But even with all of the sadness, I'm so thankful we're able to end their suffering when we can't make them feel better anymore.  My baby girl went peacefully in the arms of someone who loves her, and I'm grateful we could give her that one last kindness.  Sending love to you and Chester in this tough time.  He's lucky to have such a caring owner.\n\nPS. I love the sweater.", "score": 1},{"body": "I was thinking Barkerville. Right country at least!", "score": 1},{"body": "Some of the neighborhood associations have a dog lost/found number.\n\nI suggest putting up signs. It's possible that someone picked it up, and doesn't know that it has a loving owner missing it.  You might want to design signs for your dad to print or drive to spring to help him put up signs. \n\nGood luck", "score": 1},{"body": "100%. Those questions were very easy! I was expecting them to be much more difficult, tbh. I really think any American with a high school education of reasonable intelligence could pass. ", "score": 1},{"body": "More of an American than many native born Americans!", "score": 1},{"body": "I thought that it looked familiar.  I actually worked there this summer!  ", "score": 1},{"body": "The French figured out the actuality of 9/11 before many others could.  ", "score": 1},{"body": "I only see 2 kids... Are you insinuating he fucked her dad in the ass to establish dominance before marrying his daughter?", "score": 1},{"body": "not true at all, im 20 and i watch it once every few months", "score": 1},{"body": "Thanks so much for taking the time to respond so thoroughly! The story on your mom's side actually sounds really interesting in how unconventional it is, though also very sad that it was so devastating for your grandmother. It's great in that it allowed your parents to meet though!", "score": 1},{"body": "I'm sorry OP. I recently had to put down my Rotty because his shoulder and hip had just completely deteriorated. His name was Brody. Make sure you hug him and tell him you love him, not because he'll understand you, but so you'll remember that you did. Best wishes.", "score": 1},{"body": "The site posted that picture before you did in your original post where you said you'd just rescued the dog. ", "score": 1},{"body": "Unless you mean the Debenhams building?! ", "score": 1},{"body": "Wait, if he's only good around you, why do you have to be in another room? You should be there holding him when the time comes. Unless I'm misunderstanding something.", "score": 1},{"body": "i just realized 20 years ago was 1995. wtf", "score": 1},{"body": "Beautiful pic.\n- Montreal", "score": 1},{"body": "Attractive wife, adorable children and you OP, you...ah...you got a haircut. That's pretty cool. Seriously though, congrats on the new addition, the family and the 20 years. ", "score": 1},{"body": "haha and the customer proceeds to follow her out of the store", "score": 1},{"body": "Your gun seems to have gone limp after twenty years. ", "score": 1},{"body": "Someone once mentioned that you can read this to the beat of the Fresh Prince theme song and it ruined everything.", "score": 1},{"body": "Which one are you :) lol", "score": 1},{"body": "Old ass repost.\n\n[Source and credit.](http://photocular.com/projector-ring/)", "score": 1},{"body": "\"Oh man, I shot Marvin in the face!  Chill out, man. I told you it was an accident. You probably went over a bump or something.\"", "score": 1},{"body": "Congratulations to your grandfather! What an amazing achievement. We are proud to have him as an American. :) ", "score": 1},{"body": "Is this in New Orleans!?", "score": 1},{"body": "Need to get my eyes checked.  Looks like two fingers pushing a tiny dog.", "score": 1},{"body": "Wonder how theh route the exhaust", "score": 1},{"body": "Y'all? You sure you're not moving to South Carolina?", "score": 1},{"body": "It helps that the walkway to the change rooms is covered...", "score": 1},{"body": "Thanks for the support it's hard when they seem like they still have all their personality but their body just can't push. ", "score": 1},{"body": "If I could afford to eat diamonds I wouldn't eat fried \"food\" on a stick.  \n;)", "score": 1},{"body": "Soccer in this thread, ya cunt", "score": 1},{"body": "I bet you would get more for a diamond than for a ring like this.  ", "score": 1},{"body": "I'm 17 and have never seen Austin Powers. I did bring myself to watch Clerks a month or so ago and I'm damn glad I did.", "score": 1},{"body": "Don't lie OP, you definitely ordered that deep fried dick. ", "score": 1},{"body": "It will keep him alive forever.", "score": 1},{"body": "&gt; Although commonly described as a disorder, it is sufficiently common to be considered a normal variant of foot shape\n\nWho hasn't heard of it?  You guys should move out of your cave and see the world a little more.", "score": 1},{"body": "Ohh, just goin' fer a rip, are ya bud?", "score": 1},{"body": "I feel like people have forgot how amazing So I Married An Ax Murderer is. ", "score": 1},{"body": "F or C?  Where?", "score": 1},{"body": "Because it's misogynistic.", "score": 1},{"body": "I forget things all the time.  Teachers probably do as well.", "score": 1},{"body": "these dudes could not drive in russia", "score": 1},{"body": "Cool, thanks for the insight! I've always lived in just suburban/city areas, so it's nice to get a glimpse at what's going on outside of my scope of experience.", "score": 1},{"body": "OP delivered efficiently, kudos !", "score": 1},{"body": "I worked there only for a few months. I'd recommend trying dog sledding in the winter, there's a place on Fish Lake road that does it. In the summer theres good hiking at Miles Canyon out Carcross way, and good camping pretty much anywhere in the Territory", "score": 1},{"body": "Most time consuming as well. I can't imagine anyone dedicating an entire day for the first date. Who agrees to that itinerary without really knowing the person?! And if it was spontaneous and you're just really meshing/going with the flow, who at some point wouldn't be afraid of going too fast and blowing your wad on the first date? I'm happily resigned to being boring, it's safer.", "score": 1},{"body": "Who said fashion had to be compromised by safety.\n\n", "score": 1},{"body": "Your self-importance is stifling", "score": 1},{"body": "My mom went to new York for work, we skyped on the TV, and my dog instantly knew who it was just couldn't see her.", "score": 1},{"body": "I'm so sorry. My dog is about the same age and I'm dreading the day when we have to put him down.", "score": 1},{"body": "So.. is the left tower supposed to read 2011 while the right tower reads 2001, or did they fuck that up? Was there something that happened on 9/11/11 that I don't remember?", "score": 1},{"body": "Indeed, those fucks only care about themselves!", "score": 1},{"body": "That is very true.  I also believe in general all medium sized dogs are Chris Pratt.", "score": 1},{"body": "What the fuck is it supposed to be if it wasn't shaped like a dong?", "score": 1},{"body": "What about Wayne's World? That still comes to mind before Austin Powers and So I Married an Axe Murderer, for me at least.", "score": 1},{"body": "&gt; Wife is still hot......\n\nHey, hey! ... She might be still hot, but OP is stout hot!  \n\nOP, you're still looking good.   \n\n^signed: ^\"fellow ^beer ^lover\"", "score": 1},{"body": "No need, the rest of the world understood you. :)", "score": 1},{"body": "I'd say late 20s, early 30s, but that's just my opinion. ", "score": 1},{"body": "I'm going to give you the benefit of the doubt, since, you know:\n\nhttp://www.reddit.com/r/aww/comments/2kgngj/\n\nTwo months ago you posted this as your new dog, and it's the longest lasting link of that picture, ever.", "score": 1},{"body": "Don't take this the wrong way but, your wife aged better than you did.", "score": 1},{"body": "How does letting people halfway around the world know about a missing dog help? Should the entire front page be filled with missing dog posts? ", "score": 1},{"body": "Is this in Durango Colorado? ", "score": 1},{"body": "I once had that seat on a 6 hour flight. An older couple decided to use that space in the front to do some yoga stretching. It was incredibly awkward. ", "score": 1},{"body": "So just wondering, if the title was \"I found an upvote in a coffee filter snowflake.\" you wouldn't have downvoted? ", "score": 1},{"body": "MILF! Way hotter in the later pic :) Who are the little people?", "score": 1},{"body": "This is what they did a couple years ago, when my mom had to put down the Golden Retriever we'd had since I was about 14. I live about 1000 miles away from much of my family and I truly wish I could've been there for the dog who'd been my best friend until I moved out. I was able to keep it together until I called my mom and she was sitting in the vet's office with Barney. They'd already given him the medication when I called her and I went into a full melt down after I asked one question, \"Is he scared?\" That's all I wanted and all I want if I have to make the call to euthanize my Blitz (13-15 years old now.) If nothing else, please don't feel lonely or afraid. Time will heal my grief a lot more quickly than it would heal my guilt for leaving her when she needs me most.", "score": 1},{"body": "sometimes they are just too lazy to look or your description is not how they would describe the dog and they don't know what to tell you\n", "score": 1},{"body": "Andthenandthenandthenandthenandthen!", "score": 1},{"body": "/r/smite", "score": 1},{"body": "Those are beautiful pictures and you have a beautiful family.", "score": 1},{"body": "Space travel does that. ", "score": 1},{"body": "It breaks my heart that people do that. I'm lucky in that I've only had to have two dogs euthanized (due to old age) but I stayed with them the entire time, as painful as it was. It's hard enough leaving my current dogs with strangers for boarding (normally we get a family friend that they know to watch the dogs while out of town, but last month we had to board them with a professional, albeit very nice, facility -- they were together in a giant indoor enclosure and went outside at least 5 times a day)....I just can't imagine leaving your dog in its last few minutes all alone, without the person it trusts most in the world.", "score": 1},{"body": "I think we all want to know exactly where it is... :) I need a new profile pic on Facebook.", "score": 1},{"body": "I was naming absurd things.", "score": 1},{"body": "It's because you know it's already been upvoted a lot, so there's gotta be *something* interesting about it. ", "score": 1},{"body": "Actually, if you do a little research, the guys that were murdered were doing Jesus, and every other religious icon that I can think of as well. Does that make you feel better?", "score": 1},{"body": "Hoo boy. My dog was put down almost 4 years ago. He was 15 and in so much pain. As they were giving him the injection I held him in my arms and whispered \"You are such a good boy. You were loved every day of your life.\" Maybe I was seeing things (or not seeing clearly due to how distraught I was) but I swear before he went, he looked up and me and seemed to understand. Then he put his little head down and took his last breath. I hope he knew how loved he was. Not a day goes \n by I don't think about him and how happy he made me. ", "score": 1},{"body": "Then Don't have children. ", "score": 1},{"body": "Seems like a great story, fun first date turning into a life time and an opportunity to hand a young child a firearm. ", "score": 1},{"body": "Perfect seems inappropriate in this context", "score": 1},{"body": "Your wife was hot", "score": 1},{"body": "They want the authority to kill a minority?", "score": 1},{"body": "Oh shut the hell up, they are worried sick about their dog... who gives a shit what sub its in??", "score": 1},{"body": "Was playing Xbox with some kids, I mention halo 2 and they say it's before their time! That's barely 2 generations of console ago!", "score": 1},{"body": "sexy", "score": 1},{"body": "Haven't seen too much action here in New York.", "score": 1},{"body": "I'm not sure, it seems pretty legitimate and factual to me...", "score": 1},{"body": "The whole world needs to know. *THE WHOLE WORLD͵ MAN.*", "score": 1},{"body": "M'safety", "score": 1},{"body": "It got the most exposure possible, sure. Meaning worldwide. Did the whole world need to know about your missing dog? I think only smaller local subs needed to know, even if they may reach fewer people. This simply doesn't belong here and the number of upvotes it has is alarming.\n\nSorry if I'm being rude. I know you're just trying to find your dog and I wish you luck in that but it's difficult to make this point without kind of being a dick.", "score": 1},{"body": "Gentlemen.", "score": 1},{"body": "That's some Twisted Metal shit right there!", "score": 1},{"body": "My SO is a programmer, and will often use foul words as placeholder variables in her code. I'm still waiting for the day she accidentally leaves something in there on release.", "score": 1},{"body": "It's Hardin county dude...  Be glad it is that tame... ", "score": 1},{"body": "She is probably happy running around getting banged and has 8 puppies with her right now.  I see a lot of people have good luck with Facebook.", "score": 1},{"body": "Haha I guess you could say he was a SPERMORON LOL", "score": 1},{"body": "Ah, thanks. I can see myself making a dumb mistake like that if I didn't know better.", "score": 1},{"body": "Somewhere in a previous comment, OP mentioned  having another on the way.", "score": 1},{"body": "Haha, that explains his facial expression.  \"I hope I don't have to stand up soon.\"  ", "score": 1},{"body": "Not often that you see the Eiffel Tower getting Eiffel Towered. ", "score": 1},{"body": "So you used to be Jay and in 20 years you turned into Silent Bob?", "score": 1},{"body": "But Catholicism and Protestantism sects of Christianity and Protestantism is further divided.  The umbrella term wouldn't be Catholics it would be Christians; calling a Protestant a Catholic isn't overly broad, it's incorrect.", "score": 1},{"body": "There were kids in your generation who didn't watch either. I assure you, youth today *as a whole* are very familiar with austin powers and clerks to an extent. If anything more so due to their cult following. However its a different type of relationship, more of a thing you reference than something you relate to.", "score": 1},{"body": "I liked the EMH in all of his asshole-ish glory :( ", "score": 1},{"body": "Nice feet.", "score": 1},{"body": "What is your favourite type of taco shell, and why is it hard?", "score": 1},{"body": "Bullshit they did. I took this picture. I didn't post it to that site. ", "score": 1},{"body": "This needs more upvotes", "score": 1},{"body": "I'm not really sure what you're saying.", "score": 1},{"body": "You chose wisely.", "score": 1},{"body": "Are you all mods from /r/HighClassGourmetFood?", "score": 1},{"body": "I don't know that sounds like a win, he gets to look at his wife all day.", "score": 1},{"body": "Ow. My insides.", "score": 1},{"body": "He just realized he could save a lot of money by switching to Geico.", "score": 1},{"body": "I'm 28 and I've never seen either.  I wasn't allowed to watch Austin Powers when it came out and never got around to it.  I hadn't even heard of Clerks until my husband told me about it (still haven't seen it).  Ironically, I have seen So I Married An Axe Murderer.", "score": 1},{"body": "This needs more visibility, I came here to say the same thing. A lot of times when a pet gets away they become scared and confused because their senses get overwhelmed. By putting a familiar scent in the area the pet has a focus to help calm it and draw it to one area.", "score": 1},{"body": "The reason we have that rule is because years ago /r/pics was filled with everybody's missing dog/cat/grandpa/coat/etc and it got old fast. This is a default sub on an international website.  99.9999% of the people aren't within 50km of Spring Texas.  It'd be great if OP finds their dog, and go ahead and post in /r/texas or /r/houston for sure, it just doesn't belong here.  It's like going to Burger King for a Big Mac.", "score": 1},{"body": "good use of the wrap roll for stability\n", "score": 1},{"body": "Native American here. I'll still be hot well into my sixties. ", "score": 1},{"body": "Moby Dick seems to be the quintessential \"classic\" book. Going for the big one, I like it. ", "score": 1},{"body": "\"My car is my trashcan, and the world is my toilet\"", "score": 1},{"body": "It's the southern style chicken sandwich (which is why it looks so crispy). ", "score": 1},{"body": "In the first picture you look like an outlaw, and in the second you look like a law bringer.", "score": 1},{"body": "People who want this to be a good quality website, for one.", "score": 1},{"body": "Kevin Spacey?", "score": 1},{"body": "Silly Muggle, you can't see Dementors.", "score": 1},{"body": "Lady to lady, you were hot then, and youre hot now. Good job sister! ", "score": 1},{"body": "Pretty much the most Northern anything.", "score": 1},{"body": "Exactly!", "score": 1},{"body": "I'm in the Klein (less than 10 minute drive from Klein high school) area, I'll keep a look out. Can you pm me or post a better description of the area your in? Best wishes.\n\nEdit: went farther down and saw where you posted the area. I'm about to hop in my car and head out to look.", "score": 1},{"body": "Better late than never I guess", "score": 1},{"body": "You both aged well! But you seem to have gotten a bit shorter...", "score": 1},{"body": "This may be the cutest first date idea ever.", "score": 1},{"body": "Adventureland is Iowa does these! They are so much fun.  we did one is 1994-ish (I was 5, yes I am the sassy little shit not smiling) My brother, myself and my littlest sisters did the Flapper era in 2014. So much fun!\nhttp://imgur.com/NCPwgCo,USrzb7u", "score": 1},{"body": "I think it would be a lie to say that most condemn the tragedy.  \n\nThe core tenants of Islam are pretty clear on blasphemy laws.  If they are condemning it, it is due to them not being tried and condemned to the same fate through sharia courts. Most moderate Islamic views are still very barbaric.  Islam needs reform.", "score": 1},{"body": "Well 2 questions...\n\nWhy does this keep getting reposted?\n\nWhere can i purchase this?", "score": 1},{"body": "That's the disaster. ", "score": 1},{"body": "You should buy her some shoes.", "score": 1},{"body": "\"Thank you France\"? Do you think France is a person? I'm always flabergasted by people who buy into nationalism to such a degree that they start conflating relatively calculated bureaucratic decisions with some imagined general will that en entire country is supposed to have. Really weird.  ", "score": 1},{"body": "Fuck you. Way to marginalize gay people and people who agree with gay marriage in those states.", "score": 1},{"body": "Entirely possible they're 18-19 :p", "score": 1},{"body": "That's more of a [Maritime Accent](http://youtu.be/vGylDMu_0TU?t=20s), or at least a Cape Breton one.", "score": 1},{"body": "She's hot, dude. You should marry her.", "score": 1},{"body": "Sorry for your troubles. We had to put our lab mix down right before Thanksgiving. She was just all wore out. Our vet was really good as well.", "score": 1},{"body": "It's definitely one of the cooler looking ones in the collection, can't wait to read it!", "score": 1},{"body": "Well we know what you're doing this weekend...", "score": 1},{"body": "There is a surprising lack of Finding Nemo references in this thread.", "score": 1},{"body": "http://i.minus.com/i6beTy9vvYTe5.gif", "score": 1},{"body": "Hold on there, we only have evidence for two...", "score": 1},{"body": "1980's? Are you sure about that? ", "score": 1},{"body": "http://i.imgur.com/QdFd81h.jpg", "score": 1},{"body": "Did you too notice her left foot flippin' off?", "score": 1},{"body": "happens all the time.", "score": 1},{"body": "/r/im14andthisisdeep\n", "score": 1},{"body": "Thanks!", "score": 1},{"body": "Selena Gomez would be proud", "score": 1},{"body": "I'm naked, aren't I?", "score": 1},{"body": "Nah I was supposed to be plugging in the iPod ", "score": 1},{"body": "God I hope this catches on.", "score": 1},{"body": "hhha, as teenagers [my brother and i did this, but we cross-dressed.](http://imgur.com/JODSftC)  we gave it to our parents as a christmas present.  in an ornate elaborate scrolly thrift-store frame.  they were puzzled and finally burst out, \"who *are* these people??\"  for a long time it was their favorite picture of us", "score": 1},{"body": "I'd rather my pilot be flying the plane than watching movies up front.", "score": 1},{"body": "Cool...", "score": 1},{"body": "Finland? What is this magic place?", "score": 1},{"body": "Living things die twice. First when the body dies, second when the memory dies.\n\nAs we all know, the internet never forgets. Live forever, Chester.", "score": 1},{"body": "I understand. And I have posted it in local subs. ", "score": 1},{"body": "Haha I took this pic of my friends.  They just moved here this fall from Montreal ", "score": 1},{"body": "And that's my niece!", "score": 1},{"body": "I live a few blocks away from where clerks was filmed, the Quick Stop. I wish people like Dante and Randal worked there, the two Indian guys that work there are dicks.", "score": 1},{"body": "You both got better looking with age. ", "score": 1},{"body": "### ZOMBIE RITUAL", "score": 1},{"body": "What an awesome family you've made! You two look great, and I love the other album you posted with your travel pics. You guys are awesome. I'm with a lot of others who want to see the one with the next generation as well. ", "score": 1},{"body": "http://www.todayifoundout.com/index.php/2010/03/napolean-bonaparte-having-been-short-is-a-myth/\n\n[Daily reminder that the French are straight up gangster](http://upload.wikimedia.org/wikipedia/commons/3/31/David_-_Napoleon_crossing_the_Alps_-_Malmaison1.jpg)", "score": 1},{"body": "its cut out paper and flour based glue, super common for street artists these days.\n\nalthough not enough dongs..", "score": 1},{"body": "FREEDOM FRIES!!!!", "score": 1},{"body": "Your kids have your wife's eyes, and your thousand-yard stare.", "score": 1},{"body": "I'm so happy for you and your brood, thanks for sharing. ", "score": 1},{"body": "### \\#SECEDE", "score": 1},{"body": "We are all French now.\n\nWait a sec . . . ", "score": 1},{"body": "Token white guy", "score": 1},{"body": "Yea and in that process a muslim cop was killed defending Charlie. ", "score": 1},{"body": "With two kids and she only got thinner while you got bigger. You did one good first date. ", "score": 1},{"body": "A fair point, although it depends on which evils were being preached about.", "score": 1},{"body": "I hate gay marriage because it's unnecessary and championed by zombies.", "score": 1},{"body": "I never said that bullies cannot be non-physical, I said that they can't be ignored. The internet is a gigantic place, and if you want, you can avoid practically anything.\n\nTo cut a paragraph out of another of my posts: I'll put it out there that I absolutely denounce all the hate directed at the muslim community over this, that's simply unacceptable and wrong. I'm not talking about that, and I will stand with you against the haters who are blaming the peaceful community for the actions of the radicals who pretend to represent you.\n\nMy point and purpose here is to try and add some context to the drawings. They're not an attack on the muslim community, they're an assertion that violence is not going to make this go away. If you try not to take personal offense at this, then your day might be a little brighter. ( Though I can certainly understand how frustrating this must be for you, all the unjustified hate )\n\n( Also, upvoting your posts because people seem to downvote any pro-muslim comment on reddit at the moment )\n\nTo take an example, if some cartoonist was drawing pictures of my aunt in sexually explicit positions, and my cousin decides to go and murder that guy for it, even though I find it offensive, I will understand that the pictures aren't aimed at me, but rather at my cousin.", "score": 1},{"body": "Nope, that has\n\n\"DISASTERD\n\n  SASTERDIS\n\n  STERDISAS\n\n  ~~~~~~~\"\n\nwritten all over it. ", "score": 1},{"body": "I'm an adult, and I talk to imaginary friends all the time while doing things I like doing and eating things I like eating.\n\nMaybe you guys are just doing something wrong.", "score": 1},{"body": "It was interracial too, very appropriate\n\nI feel inspired to begin a street orgy of my own now. Who's in? Any Muslims? I've already got the White guy covered ", "score": 1},{"body": "I meant \"you\" as in the general \"you\".  The point is cops used to shoot minorities more often than they do today, but you'd never know it from the news coverage.\n\nWhich was part of the overall point that all of this is nothing more than battlespace preparation by the Democrats for the 2016 election.  The \"war on women\" nonsense and the idea cops are wandering the streets shooting black guys are just attempts to shore up the coalition after years of abject failure.", "score": 1},{"body": "Your Basset looks so happy.", "score": 1},{"body": "This terrorism is really bringing everyone together isnt it? I mean its terrible that ISIS even exists but fuck if they didnt exist we would still be bickering at each other over something or another. Just sayin", "score": 1},{"body": "Neither of us are wealthy, frankly you just have to throw caution to the wind and do it.  When we moved to the UK we had to prove we had 500GBP in our bank accounts, so she printed a statement, then transferred the 500 to my account and printed it so we could get in. Starting with $500 we built a home for 3 years. I worked for a year in Nepal for 30USD a month, one of the peak experiences of my life.  Everything worthwhile in life is a risk and outside your comfort zone. But money is far less of an obstacle than you think.", "score": 1},{"body": "But then we let our people die of old age...why can't dogs die of old age too ?!", "score": 1},{"body": "----E \n\n----E \n\n----E \n\n----E", "score": 1},{"body": "It was 1980, in Las Vegas. He was a sophomore in high school.", "score": 1},{"body": "Where'd you move the dog, *buddy*?", "score": 1},{"body": "/r/nocontext ", "score": 1},{"body": "The guy in this pic is pretty damned good-looking, and my husband is 47 and looks great. Handsomest man alive and is much more attractive than when he was in his early twenties. \n\nGuys totally stay hot, and often get even better looking! ", "score": 1},{"body": "No marketing bs, is that battery *actually* worth what CT is charging for it? Because it was -25 tonight and I had to get boosted in the co-op parking lot with a trunk full of groceries. I'm not driving every day this winter and it's been four years so the stock battery I've got is basically toast so I'm buying a new battery this weekend. I already had my eye on this before this post, I just want to make sure it's going to hold up to only being started once or twice a week in SK weather.", "score": 1},{"body": "Fair enough haha but when you're in a crowded lot desperately looking for a space you kinda pick up on things like that", "score": 1},{"body": "I posted it to r/aww on Oct. 27, 2014. The link has it in November. ", "score": 1},{"body": "You two seem really happy. I like that. ", "score": 1},{"body": "You look like Rob Schneider in the 1st one. ", "score": 1},{"body": "Im sure the vast majority of readers are NOT from the area, and come to this subreddit to see interesting pictures, not help some dude find his dog. If everyone posts 'garbage' like this people will stop coming here in the first place.", "score": 1},{"body": "Sure, think whatever you want. I don't care for convincing you of anything, this is all for the hundreds of lurkers to see cliche Muslim apologist talking points get demolished. \n\nI did expect more from you though, oh well. Have a good day.", "score": 1},{"body": "Killing Communists is noble work.", "score": 1},{"body": "Chester looks like a pimp!!! I'm sorry for your loss.", "score": 1},{"body": "Well this pretty much sums up my whole existence ", "score": 1},{"body": "Eyes peeled here in Kansas.", "score": 1},{"body": "What more could any couple hope to be. :)", "score": 1},{"body": "That's....really great.  \nI'm only 25 but I'm definitely not 17 either. I hope to find someone that I can really, really experience life with like this but still be young enough to start a family while I'm still still fertile. ", "score": 1},{"body": "Best reply I have ever seen. ", "score": 1},{"body": "Because of this post I let my pup out of his kennel and in the bed with me so he can snuggle up . I can't imagine having to do this one day.. I'm sorry for your loss", "score": 1},{"body": "These should be your fake internet points!", "score": 1},{"body": "What a tool ", "score": 1},{"body": "This has been popping up every now and then. Story of my life. Anyone know where I can get a vinyl of this for a laptop?", "score": 1},{"body": "I've always wondered how you could swallow a live (albeit chewed up) octopus/squid without choking on it, seeing as those cups are pretty damn good at what they do.", "score": 1},{"body": "Give him love while you can. ", "score": 1},{"body": "Why do you miss him.   He still puts out a TON of content you should check out his podcasts if you haven't already.  Smodco", "score": 1},{"body": "Mer Man!!", "score": 1},{"body": "\"Ha Ha....take that!\"\nGood job on living life. I had my first when I was 19. Thankfully it was after my 3 month trip to Europe. I still love to travel, but it's mostly for work or short weekend trips with the kids in tow. ", "score": 1},{"body": "pretty sure you'd die at -40 Celsius", "score": 1},{"body": "Wonder if she can see Sarah Palin from her house?", "score": 1},{"body": "Respect deserved, but adoption deserved too... and keeping idiots from owning pets.", "score": 1},{"body": "Ice Queens. ", "score": 1},{"body": "From Rob Schneider to James Spader.\n\nKinda.", "score": 1},{"body": "Bukkake staring Jack Frost", "score": 1},{"body": "The site has a date on it. Why not post another picture of the dog then? You haven't posted any but this one probably because you have no others.", "score": 1},{"body": "College kids do it", "score": 1},{"body": "&gt;Thats why I never, ever badmouth/trashtalk anybody ~~in the workplace~~.\n\nJust don't at all it keeps your mind much cleaner and improves your overall attitude.", "score": 1},{"body": "prosthetic", "score": 1},{"body": "Nothing you can really prepare for other than buying clothes that actually keep you warm.\n\nOther than that, only time to get accustomed to the weather will help. Lived in cold weather my entire life. I don't wear a jacket, just a hoodie and jeans. \n\nBut, one thing you can do, is try to get used to driving in the snow. Drive in big parking lots to see how your car brakes, drive late at night with less traffic so you can get used to it, etc.\n\nThis is of course in a dream world and probably won't be feasible since you will more than likely need to drive in the snow when traffic is busy. So, just take it slow.", "score": 1},{"body": "So I heard a guy that knows a guy who heard of a guy who named a cow Mohammed and has sex with it.", "score": 1},{"body": "&gt; Shoot on site. \n\nI did, now have to replace a monitor. BRB", "score": 1},{"body": "M'motel", "score": 1},{"body": "If they were such a problem, why haven't they completely destroyed everything. There's been feral cats for as long as they've been domesticated...", "score": 1},{"body": "Post to craigslist too", "score": 1},{"body": "He put an addictive chemical in it that makes you crave it fort nightly SMART ARSE!", "score": 1},{"body": "Hot water heater and a boiler for in floor heating. No furnace in this house most likely. The system pumps hat water throughout the home to warm it up. ", "score": 1},{"body": "It's really special to me that we can still see good people working to become part of this country. ", "score": 1},{"body": "2 hours West of San Diego puts you exactly several miles off shore in the Pacific Ocean. \n\n2 hours North North East however puts you in Big Bear. ", "score": 1},{"body": "He is totally attractive in that second picture. He clearly went through an awkward phase in his twenties, but he's a good-looking man these days. He posted another album with their travel pics, and there is some very cool stuff in there of the two of them. ", "score": 1},{"body": "your wife looks pretty much the same, you look like you turned into a completely different person lol", "score": 1},{"body": "To you little sis, my forever friend...", "score": 1},{"body": "/r/Pic would not allow this post, so please subscribe there if you don't like this post. ", "score": 1},{"body": "When Fahrenheit and Celsius are plotted on a graph, the only time they will ever intersect is at -40. So -40C = -40F. :)", "score": 1},{"body": "http://i.imgur.com/bkRj8GG.jpg\n\nnot ugly at al but not exactly very beautiful as per usual standards", "score": 1},{"body": "Oh man, I live in PA and I know it's a long shot but what town is it in? I've always wanted to go to one.", "score": 1},{"body": "My dog is getting old... 14 now... I fear this so much )':", "score": 1},{"body": "Hate to be that guy.... but thats just an Ice body on a normal fully functional truck...", "score": 1},{"body": "Or was it that nice man that works for the USPS? What was his name, Chad?", "score": 1},{"body": "You go Glen coco!", "score": 1},{"body": "My hope is that the influx will desensitize them to the idea, thus slowly making positive changes to their belief system. Allah knows it needs some modernization.", "score": 1},{"body": "I'm so happy I was brave today", "score": 1},{"body": "Also good to note that if your battery *does* freeze there's a really good chance it's basically fucked since the expanding electrolyte can crack and damage the internal components like the plates.", "score": 1},{"body": "Are you *the* Abe Froman? Sausage king of Chicago?", "score": 1},{"body": "*Such murderous instinct! This is on a whole different level!* \n\n:o\n\n:0\n\n:O\n\n----\n\nSeriously though, an awesome picture.", "score": 1},{"body": "Of course in the city where young people go to retire. ", "score": 1},{"body": "So wait, the hot end of the pool, and the air temperature is separated by 100°C?! Why does this not kill a person or cause explosions?", "score": 1},{"body": "yes.  The very first thing I expected with that title, and why I went to the comments, was an explanation. ", "score": 1},{"body": "DAE SHIT THEMSELVES WHEN THEY TACO BELL", "score": 1},{"body": "What a sweet face! I'm so sorry. It's never easy. Give him his favorite treat and lots of hugs.", "score": 1},{"body": "I somehow have that on one foot but not the other.", "score": 1},{"body": "He's wearing the pants on the sign", "score": 1},{"body": "The one on the right looks really hot! ", "score": 1},{"body": "Nothing special, but I only had 10 minutes to do this.", "score": 1},{"body": "Allentown area?", "score": 1},{"body": "Did you oppose the war?", "score": 1},{"body": "I love labs! And it really sucks putting down dogs because they are such happy animals and you hate to see them go", "score": 1},{"body": "It's still a terrible post\n\nEdit: and no I don't agree with /u/_TOP_KEK_", "score": 1},{"body": "Righteous!! Righteous!!!!", "score": 1},{"body": "I think I see little Danny's homework in the backseat.", "score": 1},{"body": "Us pirates know how to alpha fuck   ", "score": 1},{"body": "It's not weird. I can definitely tell if ketchup has not been refrigerated. ", "score": 1},{"body": "She has long toes in the second photo.", "score": 1},{"body": "i had spare gas, still drove home. just had to stop. no worries, i'd do it again. i'll keep an eye out. anything for a critter. \n", "score": 1},{"body": "You made my day 😁 ", "score": 1},{"body": "We also wouldn't have the Louisiana Territory if Napoleon hadn't taken it back from Spain and been like \"alright listen Jefferson there's a lot going on right now so how much will you give me for this shit.\"", "score": 1},{"body": "There may or may not have been a hammer involved....\n\nBuuuut keep it up!!!", "score": 1},{"body": "[1000 words](http://i.imgur.com/66RdccL.jpg)", "score": 1},{"body": "HUGE CRANIUM!", "score": 1},{"body": "I still haven't read it. It's on my bucket list. It's my white whale.", "score": 1},{"body": "I know, I was agreeing with you, like I said, I'm giving you the benefit of the doubt.", "score": 1},{"body": "Maybe you should check OP's submissions before making such claims.\n\nTL:DR \n\nYou're retarded ", "score": 1},{"body": "the dog is fast though, the title says. Who knows how far she could've traveled. I'll keep my eye out here in Edmonton", "score": 1},{"body": "MOA?", "score": 1},{"body": "You can have the carpet/upholstery dyed.  It makes the interior look almost new.  Dealerships do it all the time because it's not very expensive.", "score": 1},{"body": "The terrorists are already looking for Reddit as it is. \n\nDear Mr. Terrorist, \n\nReddit is *not* in the bay area. \n\nSincerely, \n\nRedditor", "score": 1},{"body": "Use with caution. Tried to recreate ideas from a romantic comedy called 'Saw', there was no second date.", "score": 1},{"body": "You thought you'd seen every repost?", "score": 1},{"body": "Just don't turn it on", "score": 1},{"body": "nah they were running", "score": 1},{"body": "Just look at it\n\nhttps://www.youtube.com/watch?v=EF8GhC-T_Mo", "score": 1},{"body": "Ah the ole hide the civilian shoes behind a crate. ", "score": 1},{"body": "Not really, this isn't a garbage post. It's entirely within the rules.", "score": 1},{"body": "Anyone mentioned that -40°c is -40°f?", "score": 1},{"body": "Momma Nature. \n\nIt's organic.", "score": 1},{"body": "I &lt;3 bad rediquette", "score": 1},{"body": "niceyecicles", "score": 1},{"body": "I think I'll go hug my dog and then chase him until he barks at me.", "score": 1},{"body": "This Redditor agrees with you.", "score": 1},{"body": "We really do have way to many ads about hockey. Its almost like we're all circlejerking about how Canadian Canada is. Really though its probably just advertisers playing with national pride.", "score": 1},{"body": " #bringbackthehair", "score": 1},{"body": "Girl stayed hot.  Dude let himself go.", "score": 1},{"body": "That is a threesome.  4 is a foursome. 5+ is an orgy. Get your shit together OP.", "score": 1},{"body": "There are 100 possible questions, they ask up to 10, as soon as you get 6 right, test ends. They are NOT multiple choice like the practice test though, you have to know the answer. \n\nThe practice test has some stupid choices and you can work through elimination - won't work during real test.", "score": 1},{"body": "&gt; but it comes off a bit scared.\n\nI think that's because she's holding a gun to his head.\n\n", "score": 1},{"body": "Enough already...", "score": 1},{"body": "Aww, this is too cute ", "score": 1},{"body": "\"And then your mom wanted to give your dad, but your dad also wanted to give your mom head so they formed a 69 and your dad came at least 3 times.\"\n\nYoutube isnt working for me so I cant link it :/", "score": 1},{"body": "You do realize he's right here in the thread?!?", "score": 1},{"body": "Obviously he shot his load", "score": 1},{"body": "I live in spring as well. I'll tell everyone I know.", "score": 1},{"body": "Unrelated, but any idea what breed that dog is?", "score": 1},{"body": "\"That's what I like about these Olde West girls... I keep getting fatter, and they stay the same weight.\"", "score": 1},{"body": "Was that night on the marge of Lake laberge, I cremated Sam McGee. ", "score": 1},{"body": "Congrats on the citizenship! Collect your social security! You earned it!", "score": 1},{"body": "One of the great regrets of my life was that I was not able to do this with my dog.  I was away at college and his health went downhill very fast; my family decided to put him down and there was no way for me to come home (8 hour drive) to say goodbye in time.  I don't blame them, it was the right decision, but I really wish I could have gave him a good send off.  I was able to spread his ashes around one of our favorite walking spots (private land in the country).  I know everyone says this, but he was the best dog ever!", "score": 1},{"body": "I'm so sorry OP. I know how that feels, and its never fair. There isn't ever enough time to be with those furry balls of unconditional love. Value every memory, and we will too.", "score": 1},{"body": "I'm sure humans cause MUCH more death, pollution, stress and destruction to our earth and all animals than every cat that ever lived. ", "score": 1},{"body": "As a American, I thank you France. You show honor and respect to those who have lost their lives in the attack. You help us show the evil that exists that we as people on earth are not afraid. As countries and friends, we stand united. God bless you.", "score": 1},{"body": "i felt like most of them were fairly straight forward thats without studying though, should be easy when you are studying for it", "score": 1},{"body": "That's complete idiocy. ", "score": 1},{"body": "Yeah,  that's me. ", "score": 1},{"body": "i dont see an error\n", "score": 1},{"body": "My friends and I actually did this one time with a hot tub.", "score": 1},{"body": "I want to up vote this but don't want to wreck the 666 points ", "score": 1},{"body": "You can have it done at your house you know. It costs a couple hundred bucks but it's a small price to pay for the comfort of a pet that's given you years of love.", "score": 1},{"body": "Wow. That is so cold. When we put our blue heeler down the vet gave us time before and after to be with her and he even shaved some of her fur for us to take home. I could not even imagine letting a pet of mine die alone. What a horrible thought.\nThank you for being awesome and giving them a last meal!", "score": 1},{"body": "or course if she did that, the comments would all be calling out her \"mistake\"", "score": 1},{"body": "No offense to the guy, but he looks like he's sixty in the second picture.", "score": 1},{"body": "Atascocita here...  Probably can't help but our thoughts are with you! \n\n(We're on Treaschwig all the time, either going to Mercer Arboretum OR Carter's!) ", "score": 1},{"body": "Is he teaching them how to Duggy? ", "score": 1},{"body": "Sorry homey. Stay strong, remember the love, the laughs and how your pup made you a better person.", "score": 1},{"body": "Impressed that the editors let the panels be solid black...", "score": 1},{"body": "$5 says the stuff in the basket is there for looks", "score": 1},{"body": "Florida here, doesn't seem she crossed the pond.", "score": 1},{"body": "We've actually been getting a decent amount of rain this year. Supposed to rain more this weekend. That's the awesome thing about this winter. One day it's storming and you're bundled up, the next you're in a sun dress at the beach.", "score": 1},{"body": "That's a huge noggin. That's a virtual planetoid.", "score": 1},{"body": "Only if you let it suck ", "score": 1},{"body": "Nice dude!! I would kill to get that Plato book, I've been trying to find one at estate sales but the bastards want too much cash for it :c enjoy the books and pass them on one day to your grandchildren, my friend!", "score": 1},{"body": "Is there a source for this photo?", "score": 1},{"body": "Think about this, 18 years ago was 1997. Every new 18 year old porn star starting this year was born in the year that\n\n* Hong Kong is returned to China\n* Bill Clinton starts his second term\n* North Hollywood shootout\n* Tony Blair becomes Prime Minister in UK", "score": 1},{"body": "Haven't seen her in Sydney either, just in case anyone was wondering.", "score": 1},{"body": "The dog i grew up with went into a slow decline like your Molly. I was living in another state attending college when my mom srarted discussing the very real probability of putting Moie down, who was old and creaky with the beginnings of incontinence. She had lived a long time and we had formed a special bond. I considered her my best friend. I called my mom one day and she told me they had taken Moie to the vet a couple days before and she was gone and I flipped out. How could she not tell me? I never got to say goodbye. I was inconsolable for two days. What helped me grieve was listening to Damien Rice's song \"The Animals Were Gone\" and working on a school assigned self portrait which showed how broken i was at the time.\n\nI eventually forgave my mom. I realized she was the one living with Moie and could see that she was suffering and that maybe mom forgot to call because she was wrapped up in her own grief.\n\nSix months later i pressured her to adopt the spunky malte-poo we saw at my g-ma's neighbor's yard (she fosters rescues and it's also where we had gotten Moie). She was happy,  i was happy,  and Buster has been an amazing dog to get to know and love for seven years now (wow, that long??).\n\nI'm so glad you got to have that special time with Molly to say goodbye. I'm considering adopting a senior dog and the biggest thing keeping me from pulling the trigger is that painful and inevitable goodbye.", "score": 1},{"body": "God dammit these comments are making me bawl", "score": 1},{"body": "&gt; but the other options are so ridiculous that its hard to get it wrong. Having it in the multiple choice format makes it incredibly easy.\n\nThe real test is NOT multiple choice like the practice test though, you have to know the answer. \n\nThe practice test has some stupid choices like you said and you can work through elimination - won't work during real test - you just get asked for example \"Who becomes the President if the President dies\" and they won't give you 4 selections - you have to answer \"the Vice President\"", "score": 1},{"body": "What and waste your own data", "score": 1},{"body": "Their date nights are fantastic!", "score": 1},{"body": "Was that hair part of the hat choice or was it a life choice?", "score": 1},{"body": "You are so lucky.  You got two kids, one more coming, and your wife only got hotter with time, and all you did was get fatter.", "score": 1},{"body": "Your wife looks like she hasn't aged a day", "score": 1},{"body": "Shrek or Wayne's World. ", "score": 1},{"body": "She looks the same. Good wife choosing skills. ", "score": 1},{"body": "Nobody was claiming it was deep. It was probably upvoted because everyone has thought about this at least once or twice in their adult lives, and if there are that many people who can relate, its probably a thought that lives just below the surface for many adults. Opposite of deep.", "score": 1},{"body": "I wouldn't expect them to remember everything either, but if later somebody asks them about \"Flowers for Algernon,\" and they say \"Hmmm, never heard of it,\" you wasted your time because you didn't teach them shit.", "score": 1},{"body": "McCock", "score": 1},{"body": "I just don't think the people calling others in this sub jerks and assholes because they're telling OP not to post this in here don't understand what /r/pics is for.\n\nYou wouldn't post this in /r/gaming, yet that subreddit has millions of subscribers too. I don't know why people think pics == interesting title + uninteresting picture.\n\nIf you're reading this OP, I wish you the best of luck in finding your dog but this was not the best way to go about doing it and the people calling the rest of us insensitive can go to another website where they don't care about the quality of content.", "score": 1},{"body": "Wow, this accomplishes so much!  Thanks for your healthy contribution to the fight against terrorism and bigotry by catering to the hate-fueled reddit echo chamber and racking up those sweet, sweet karma points!", "score": 1},{"body": "I think I'd rather step on a lego than have anything \"rip into my calf like knives\".", "score": 1},{"body": "It was put up in 2011 for the 10 year anniversary.", "score": 1},{"body": "My dick is math?", "score": 1},{"body": "https://www.youtube.com/watch?v=V1bFr2SWP1I", "score": 1},{"body": "Then you might be Sub-Zero.", "score": 1},{"body": "Your wife is still a whore, cool!", "score": 1},{"body": "So much recycalable stuff", "score": 1},{"body": "What's 40 but 5 years more than 35 etc? Nothing. ", "score": 1},{"body": "Jesus fucking christ, man. Just put up a fucking poster next time. Shit.", "score": 1},{"body": "I'm 23 years old. I study in a university to hopefully become a chemical engineer. I play buttload of video games and watch a whole lot of anime. \n\nI understand that you're trying to do the world a favour. But you're offending people like me because I happen to be a Muslim.\n\n\n\n", "score": 1},{"body": "Seriously. Who downvotes a guy trying to find his dog?", "score": 1},{"body": "About brought me to tears OP. I know the feels and I hope for the best. This is why I don't know if I can get another companion. Maybe when I'm old and it can outlive my life but then I'd feel sad that it would feel sad that I am gone. I Dont even know. Take care, buddy. May he rest in a wonderful place forever.", "score": 1},{"body": "fucking troll.", "score": 1},{"body": "People can be attracted to more than just physical attributes.\n\n[Something like this](http://40.media.tumblr.com/d04471c8919cb66bebe6f71992bf441f/tumblr_nhcz86mEN81siy79jo1_1280.jpg) is attractive even though the guy is clearly over 30.", "score": 1},{"body": "And Colorado! We do that too", "score": 1},{"body": "Your wife forgot to age. ", "score": 1},{"body": "\"...And my foot in his crotch!\"", "score": 1},{"body": "My high school was literally in this neighborhood. We would always drive by to see what they cam up with after the first big snowfall. This is by far the biggest I've seen them do. They had a cool fish one a few years back. It even had a smaller fish inside the fishes mouth. It was really cool!", "score": 1},{"body": "Does it count if I'm dating someone from New Brighton? ", "score": 1},{"body": "Why and how? You didn't answer the question. Why and how does it lack respect? or are you one of those who would try and murder me for suggesting it's okay? ", "score": 1},{"body": "classic example of people with too much time on their hands lol", "score": 1},{"body": "It's thought that he's about 30 years old, and that his condition was the result of a genetic mutation. In this picture, it is clear that he is in musth (a time of heavily increased sexual activity and aggressiveness due to increased testosterone levels) from the secretions of the temporal gland behind the eye.\n\n[Image source](http://www.bbc.com/earth/story/20150107-dwarf-elephant-beats-up-large-rival?ocid=fbert).", "score": 1},{"body": "he may be using an old picture?", "score": 1},{"body": "Spring is a big and dense suburb of Houston; I lived there for over 20 years.   An intersection narrows it down to about 200 or more people; and since this is about a missing dog and not trashy people, I doubt anything but help will come from posting it.\nGL OP.", "score": 1},{"body": "Sometimes I fart in the shower, that's as close as it gets for me.", "score": 1},{"body": "Yeah. This is happening to my husband. He's become like catnip to women now. \n\nWhen I picked him up he was an awkward geeky 21 year old with a stoop and a penchant for XL shapeless sportswear. ", "score": 1},{"body": "Have done this.  Its actually not painful at all.  It was like my body was so shocked by the temperature change that it just didn't believe what was happening for the first ~30 seconds.  ", "score": 1},{"body": "Salty", "score": 1},{"body": "http://www.reddit.com/r/aww/comments/2kgngj/", "score": 1},{"body": "I feel you, my dog was gonna be put down, I didn't know until we were at the vet, I couldn't deal with my emotions the ride home\n\nDamn you, I'm crying like a lil' bitch now ", "score": 1},{"body": "He's black, he can pull it off. ", "score": 1},{"body": "Why does this corny shit still get upvotes?", "score": 1},{"body": "Better sleep with one eye open OP", "score": 1},{"body": "As my best friends dad would say and has said to me many times.  Son, you done outkicked your coverage.", "score": 1},{"body": "We think pit bull and schnauzer. She's a mut for sure", "score": 1},{"body": "Day 2 and this is already old..", "score": 1},{"body": "Now with better gun safety!", "score": 1},{"body": "I came here out of curiosity. I was upset for OP for what was to happen, but I wondered why it was to happen. \n\n..and now I'm just wondering how all this dust got into my eyes..", "score": 1},{"body": "where can i buy one?!?!?!!?!?!?!", "score": 1},{"body": "You kissed her goodnight on her doorstep, then went inside to talk to her parents? Is this some kind of weird Canadian tradition?", "score": 1},{"body": "Feminism hasn't really hit Korea yet.", "score": 1},{"body": "Why aren't you posting more pictures? WHY? How could it possibly hurt??", "score": 1},{"body": "Yeah grandpa Simpsons's warning is wonderfully written.", "score": 1},{"body": "Dang, what she feedin' you, son?", "score": 1},{"body": "Don't misunderestimate the lack of effort involved in self-fattening.", "score": 1},{"body": "Then gams!\n\nSeriously though, looks like you have a nice family that can enjoy being silly. Congrats on that.", "score": 1},{"body": "Robbed a bank together", "score": 1},{"body": "Woah dude. OP, please post to r/woahdude as the ents over yonder will like this", "score": 1},{"body": "It amazes me how creative some people are.", "score": 1},{"body": "Ok, good to know for future reference. Thank you.", "score": 1},{"body": "Yeah I'm going to need proof. For science. ", "score": 1},{"body": "this is fucking awesome.", "score": 1},{"body": "I figured, ya cunt.", "score": 1},{"body": "Theres a fair bit to do really! Mountain biking, camping, hiking, river rafting, rock climbing for the summer. Skiing, snowmobiling, snowshoeing, hot springs in the winter. The music community here is awesome and always open to everyone. Pretty much everything except the -40 weather is great. Also northern lights and the midnight sun (not at the same time of course)!", "score": 1},{"body": "What a cute little dog. Take comfort in knowing he has had an amazing life and that he will be happy in his final moments with you by his side.", "score": 1},{"body": "damnit I hate up voting something only to find out it's a repost. ", "score": 1},{"body": "Helen, GA?\n", "score": 1},{"body": "It might be too emotionally difficult for someone? I'm just guessing", "score": 1},{"body": "I did check OP's submissions and the \"original\" picture was posted two months ago.  Check the date on the site.\n\nTL:DR \n\nYou're a twat", "score": 1},{"body": "THE MORE YOU KNOW, with Mr. Reddit.", "score": 1},{"body": "Gulp... that shit was dope in 1994.", "score": 1},{"body": "I'm sorry. ", "score": 1},{"body": "Me too.  I was a phototypesetter, which at the time was considered a skilled trade.  Haha, jokes on me.\n\n", "score": 1},{"body": "I hate that I have to be nervous about this. :c", "score": 1},{"body": "neat\n\nwell, back to being lonely and watching TV in my unheated room in the dark", "score": 1},{"body": "We had horses in addition to a dog and so we had a close relationship with our vet. \n\nWhen our dog Layla had to be put down, the vet let me determine the time and place by leaving me the syringe that would lay her to rest. \n\nWe laid her out on the back of the truck for the afternoon. She got plenty of sun and was able to see the horses for a last time -- it had been weeks since she had last been near the paddocks. \n\nIt was hard putting her down, but doing it myself made it a little bit easier. \n\nHowever you grieve, however Chester goes down, just remember how he lived!  We all feel ya'!  \n\n", "score": 1},{"body": "Really nice job you did!\n\nHow long did it take to make?", "score": 1},{"body": "Virginia here. Hopefully it doesn't show up here. Poor thing would end up being a dogsickle. But in all seriousness good luck OP! ", "score": 1},{"body": "lol,  the gun pointing at your head seems to say \"You will give me 2.5 children or I will blow you away!\"", "score": 1},{"body": "***NO AND THEN!***", "score": 1},{"body": "Much better.", "score": 1},{"body": "[Relevant video](https://www.youtube.com/watch?v=UfWW8kjmlv0)", "score": 1},{"body": "a lil prayer from me", "score": 1},{"body": "It took me a second to understand how amazing this was.", "score": 1},{"body": "Bet yall are obese", "score": 1},{"body": "Am a redditor.  I am hilarious.", "score": 1},{"body": "I almost upvoted because I thought it was circlejerk", "score": 1},{"body": "I always wondered how to protect the eyes from the \"lash-icles\" when it would either be -27 or -42 back when I was in Alberta. Id be covered from head to toe but my eyes would just be tearing from the cold. \n", "score": 1},{"body": "ITT: horny redditors calling ops wife hot.", "score": 1},{"body": "you over shot your coverage on your wife dude congrats", "score": 1},{"body": "You suck it up for the animal that cares unconditionally around you and hold the damn thing. Seriously, would you rather their last thing being without you or at least have the damn comfort of you being there. I'm being serious. ", "score": 1},{"body": "Almost as flabbergasted as I am by people who buy into an imagined God to such a degree that they would dictate how an entire species should live. I'm glad you understand how silly it is to buy into an imaginary concept. It's important for people like you to continue spreading the word about how ridiculous it is to buy into a concept like nationalism and religion so wholly and blindly. Good for you!", "score": 1},{"body": "you mean obese lazy slob\n\n&gt; but we mostly easy processed garbage\n\nI would say kill your self....but looks like your on your way, have fun :)", "score": 1},{"body": "Good ol white lighting brian", "score": 1},{"body": "That's awesome! Got a good laugh .", "score": 1},{"body": "Good call. Gun to the head and worried expression got me first. ", "score": 1},{"body": "Epic!", "score": 1},{"body": "Seconded", "score": 1},{"body": "First date? Check. Teenager? Check. Pretty girl's foot near crotch? Check. Dude was definitely at chub, fighting hard not to go full tilt", "score": 1},{"body": "Be honest: there was some fingerbang action that night right?", "score": 1},{"body": "Sorry for your loss.", "score": 1},{"body": "I was going to say he got a bit fat, but that would be mean so I decided to keep it to myself. I'm just a stand up guy like that.", "score": 1},{"body": "Is it or white men age terribly, probably the worst among all races", "score": 1},{"body": "Congratulations on being the only person in the whole thread to have something negative to say...  You must be fun at parties.", "score": 1},{"body": "Bruce just wants to feel and live a \"normal\" life. ", "score": 1},{"body": "Try a 9/11 pic next time OP. You'll get the karma. ", "score": 1},{"body": "You're a stand up guy, twilling8.", "score": 1},{"body": "Long toe is looooong.", "score": 1},{"body": "[Andre.](http://selvedgeyard.com/2009/07/22/andre-the-giant-proving-size-matters/)", "score": 1},{"body": "I really hope you get your dog back OP, I never got mine back and I can tell you its horrible. I hope whoever stole my dog is feeding her well. She likes a Mcdouble. ", "score": 1},{"body": "You are a fucking moron", "score": 1},{"body": "So you can't elaborate to me why you assumed he had any intention of changing the world, i wasn't attacking you i was genuinely curious in how you were lead to that interpretation, if you don't know or are unable to answer that is fine this entire conversation is pointless without that detail.\n\nYour assumption about me seeing this as needlessly offending good people is incorrect as well on both counts.\n\nJust to recap you've implied OP is trying to change the world and why i ask why you've felt that way you've dodged the question and insinuating i'm somehow not muslim for asking how you came to that conclusion and assumed this had no bearing on anything that has happened before and was an innocent act.\n\n0/10", "score": 1},{"body": "I know exactly what I want but society won't let me have it.", "score": 1},{"body": "I could give you school texts, but that wouldn't be helpful to you because they can't be read online, I've tried. I've attended Catholic schooling all my life, and the enormous pile of shit the Church made for itself is astounding ", "score": 1},{"body": "Dude, she is way hotter now. Well done.\n", "score": 1},{"body": "http://cdn0.dailydot.com/uploaded/images/original/2012/10/8/dekD4.gif", "score": 1},{"body": "As someone who unloaded trucks for 5 years, I thank you for this. Couldn't count how many times progress was halted because some jackwagon and his crew couldn't stack and wrap a damn pallet with even an ounce of care. Seriously, when a pallet came out square, security stacked, and correctly wrapped it would make my whole night just that much better.", "score": 1},{"body": "Your submission was removed as it violates rule I: No screenshots", "score": 1},{"body": "Yeah def - and it was actually fun studying them since I did not go to high school here - there were new things I learned", "score": 1},{"body": "Brooklyn, near the Brooklyn Bridge. I go to a coffee shop near there. ", "score": 1},{"body": "What a cutie pie.  Give Chester lots of hugs and kisses.  I'm sorry you have to lose him so soon, an eternity wouldn't be enough.", "score": 1},{"body": "&gt; when she was running from office there. \n\nTypo, but still works, or secretly meant to do that?", "score": 1},{"body": "imgur link: http://i.imgur.com/KG8AHTE.jpg\n\n---\n\n^(I'm a bot) ^| [^(flag for glitch)](http://www.reddit.com/message/compose?to=/r/imgurerbot&amp;subject=bot%20glitch&amp;message=%0Acontext:http://www.reddit.com/r/pics/comments/2rtuvm/this_picture_of_elvis_and_nixon_is_the_most/)", "score": 1},{"body": "I'm also getting a hint of \"No Ragrets\" in the first pic. Anyone else?", "score": 1},{"body": "Fuck off", "score": 1},{"body": "Yeah, I thought so too. Glad to be proven wrong though.\n\n-A South Carolinian", "score": 1},{"body": "Yes. Unfortunately the truck has two left feet.", "score": 1},{"body": "This. I have a low-paying job, but otherwise I'm feeling all right. My daughter and I play Legos, Pokemon, video games, I run around outside a few days a week, I act like a fool and dance and make people laugh, I eat cookies, I read comics, I have breakfast twice on weekends... it's not so bad. Yeah bills suck and stress is horrible but it's not like the street art implies. Maybe I'm the wrong person to comment on this. I don't wear a suit to work or have anything to put in a briefcase. ", "score": 1},{"body": "Am I missing something.  'Woozle Wednesday\" date: Nov 05, 2014 10:43am\n\nThe rescue post: \"this post was submitted on 27 Oct 2014\"\n\nHow does that prove OP is a liar?", "score": 1},{"body": "Dude, I'm too drunk to lie down and thinking about how fucking much I'll miss my stupid yellow lab that I love for no reason but goddamn fuck ass shit why wont these tears go away", "score": 1},{"body": "We had to put our Sam down 8 days ago. I cooked him up a steak for breakfast before we left. He also got some of my eggs and yogurt. That dog lived to eat and I would like to think he enjoyed it. All the yummies in the world...", "score": 1},{"body": "Volcano, and seriously I just miss that taco", "score": 1},{"body": "New York here, my eyes are peeled ", "score": 1},{"body": "He totally got you bro... LOL!", "score": 1},{"body": "Sub Safe programs submariners to think about hull and backup valves. They used to just have hull valves. R.I.P. USS Thresher SSN-593. ", "score": 1},{"body": "Your wife is pretty hot dude!", "score": 1},{"body": "And now he's a kid that people shuffle forward for that glorious karma.\n\nGo fuck yourself, OP", "score": 1},{"body": "oh just give it a few years. you will be dicking about with the rest of them.", "score": 1},{"body": "So they're prostitutes? Not sure I'm fully grasping the concept.", "score": 1},{"body": "it's PEX tubing.   http://www.pexuniverse.com/", "score": 1},{"body": "Looks like you took the gun away ", "score": 1},{"body": "Right when I was going to go to sleep?", "score": 1},{"body": "Capitalization!!", "score": 1},{"body": "Godspeed, Chester. May you find peace in rest that you found in life. May the person whose name you never knew find comfort in the release from your pain. Cheers to you for a good life with a good person, for it is a good person who would post something like this. ", "score": 1},{"body": "I'm on the way to a titty bar about to see a midget strip.  Thanks for giving me some perspective.", "score": 1},{"body": "I absolutely hate your opinion on this matter.  Whether or not there's a good reason for the FBI to search anything, they should be required to get a court order to carry out that search per the Fourth Amendment.  If there's a legitimate reason to carry out a search they can articulate that reason to a judge.  I don't have anything worth hiding from the FBI, but I do not support allowing the FBI to trample on my Constitutional rights in the name of \"security.\"  ", "score": 1},{"body": "It's an interesting conundrum we're presented with here, but the answer is substantially less straight-forward than just shoot on site.\n\nFirst, let's establish our goals:\n\n1) Preservation, rehabilitation, and possible expansion of new healthy, productive ecosystems capable of sustaining existing native biodiversity\n\nThat's the big one. That's the one issue that the majority of the environmental movement, academic environmental scientists, and laypeople with an interest is and should remain focused on. Emerging out of that line of thinking is the directive to eliminate feral cats, as they're an introduced, invasive species. Invasive species negatively affect the health and productivity of existing natives species = get rid of the invasives.\n\nBut it's not the only goal. Also:\n\n2) Support the ability for humans and non-human organisms to adapt to existing and upcoming challenges to the local and global environment.\n\n3) Help mitigate the harmful effects of human activity on the productivity, biodiversity, and adaptive capabilities of ecosystems associated with human beings.\n\nThe last two are extremely dependent upon the timescale from which you examine the problem. If you're just concerned with the bird counts this winter you get a totally different answer than if you're thinking thousands, tens of thousands, or more years down the line.\n\nThe fact is, we've moved a fairly large number of species around the world, where they've since become naturalized. Invasive in some cases, but naturalized nonetheless. We're not going to get rid of these (frequently) cosmopolitan species, and many are not going to die out if we died out. Feral cats are one. Sparrows, rats, kudzu, innumerable microorganisms are others. \n\nThe ecosystems that existed perhaps as little as a few decades, and certainly tens of thousands of years ago, is gone. It's gone. Nature doesn't wind back the clock. We're as much a part of nature as the songbirds and wildflowers, so we cannot wind back the clock. We have forever modified the biological skin of this planet.\n\nBut that doesn't mean it's dead, necessarily dying, or has to die. The cosmopolitan species are a seed of a future world. This phenomenon has numerous precedents in evolutionary history.\n\nSo acknowledging that, let's examine what feral cats really do. They're a voracious predator of small birds and mammals almost exclusively (their occasional grass eating habit excepted). They're also usually associated with humans and human modified environments. It's not impossible to find evidence of cats deep in the woods, but they're massively more common in urban and sub-urban areas.\n\nA substantial portion of other introduced birds and mammals share that similar relationship with the human landscape.\n\nIf this was any other set of organisms that I was talking about, say beaves, wolves, and moose, we'd be ooh-ing and aah-ing about the grandeur of nature. Shit man, this is grand too! We've got a whole ecosystem of organisms that, like it or not, hang out with us in pretty much every urban area on the planet.\n\nBy all indications, human population and particularly the proportion of humans living in urban areas is going to keep increasing. Urban areas are expanding in size as well, in terms of total land surface area devoted to them. That is to say, the \"urban ecosystem\" is expanding.\n\nBack to goals 2 and 3. We should be equally focused on making this urban ecosystem resilient against climate change, disease, or other environmental shocks as we are for the green belts and wild areas surrounding the urban areas. And we should be thinking of ways to make the two work well together.\n\nIn some cases, yes, that means the feral cats are really not helping and perhaps we should try to reduce their numbers. But in others, maybe we should be thinking in terms of helping the native songbirds bridge the gap between the long dead or rapidly dying ecosystem of the past, and the nascent new cosmopolitan ecosystem. And sometimes, perhaps we should look at our ecological neighbors and toss 'em a few scraps (literally in some cases, but metaphorically most of the time!).", "score": 1},{"body": "Goddamn how do people afford to adventure like that.", "score": 1},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text. || No comics or infographics", "score": 1},{"body": "RIP his hair", "score": 1},{"body": "Wow. Shiva is real bitch.", "score": 1},{"body": "This makes my heart hurt for you, man.", "score": 1},{"body": "Neyecicles.", "score": 1},{"body": "We know.", "score": 1},{"body": "Physics!", "score": 1},{"body": "\"Error\"", "score": 1},{"body": "I was gonna say Rob Schneider", "score": 1},{"body": "How? I usually only fly international and the first class upgrade is sometimes $1000+", "score": 1},{"body": "Wow that show is a lot different then I thought it was.", "score": 1},{"body": "And then", "score": 1},{"body": "this is reposted at least once a week. quit your bullshit faggot", "score": 1},{"body": "Interesting, thanks!", "score": 1},{"body": "Wait my friend just took his and we were going over the possible questions and one was: what is the governer of Texas. I don't find that common knowledge. Do most people know your the governed of every state? \n\nHowever all the other replies are saying the same thing you did so I'm really confused.", "score": 1},{"body": "Your submission was removed as it violates rule I: No pictures with added/superimposed text. || No comics or infographics", "score": 1},{"body": "A picture of two people", "score": 1},{"body": "Listened to an NPR story on him, apparently he is the only documented animal with dwarfism who reached adulthood in the wild. Its sort of a mystery as to how he has survived with such a natural disadvantage. All we know of him is that for the past 10 years or so he appears during mating season at a wildlife reserve and then he just sort of wanders off and does his own thing.", "score": 1},{"body": "Charlie: Like in the Sixth Sense, you find out that the dude wearing the hair piece, that's Bruce Willis the whole movie!\n\nThe gang: That's not the twist.", "score": 1},{"body": "Well that escalated slowly.", "score": 1},{"body": "Great.. now I can't drink my coffee.\n\n[Ahh fuck it.](http://i.imgur.com/f8Rn2kI.gif)", "score": 1},{"body": "WHAT?! No fucking way!\n*check IMDb*\n\nI'm sad now. ", "score": 1},{"body": "Yeah - me too please!", "score": 1},{"body": "ya, and then, OOH!  those egg rolls look good, I'll grab a couple with some lo mein.  and I should pick up some donuts for work.  and that Parmesan peppercorn italian bread they just took out smells wonderful.  I'll grab a loaf. that sausage pizza just came out of the oven too.  can't pass up a couple fresh slices. Hey, look, tiramisu!  I need a cart.  this hand basket isn't big enough.", "score": 1},{"body": "That's too young to be too old.", "score": 1},{"body": "Look, I'm glad you deleted these. Just because the homeowner's liaison said it was ok to post doesn't mean your boss (or their boss or their boss) wouldn't appreciate this if they got wind of it. Don't get fired over internet points. And I'm sorry for calling you an idiot.", "score": 1},{"body": "Oh, puppy, I am sorry. It is going to hurt your people to say good-bye to you. It won't hurt you, you will be flying and you will never come back down. Your people love you and will not stop, even when you are too far away to see them any more. So please, do not fear, they will be along some day soon, and the time between now and then will be no more than the blink of an eye....", "score": 1},{"body": "Stop trying to make fetch happen. ", "score": 1},{"body": "Who left these onions here?", "score": 1},{"body": "Is it just me or do your kids seem really bored?", "score": 1},{"body": "Your submission was removed as it violates rule VI: Submissions must link directly to a specific image file or to an image hosting website with minimal ads.", "score": 1},{"body": "Thats true for wearing multiple pairs of ski socks but layering is a good thing so long as its not overdone.", "score": 1},{"body": "[You didn't even wait a day]( http://i.imgur.com/wEv22Aj.gif)", "score": 1},{"body": "I've never cried from reddit comments more than now.\n\nEDIT: I've never cried from reddit comments before.", "score": 1},{"body": "Much love to you, Chester!", "score": 1},{"body": "I work for a control intalation business and my boss is building a new house, in his mechanical room there is infloor hear for all of the basement and 1st floor rooms, a boiler system, air handler, and variable air volume boxes for every room. Here is the mechanical room http://imgur.com/487v2Yq,wBhc85a#1\n", "score": 1},{"body": "For example, the Dutch were the [first to salute](https://en.wikipedia.org/wiki/Sint_Eustatius#.22First_Salute.22) the American flag.", "score": 1},{"body": "Some people are built for the job, this kid straight up looks G", "score": 1},{"body": "It's one of the hardest things we have to do. Godspeed Chester.", "score": 1},{"body": "Bro who's the chick in the first pic? Is she single or what?", "score": 1},{"body": "Me too!", "score": 1},{"body": "Nicely done dude, nicely done.", "score": 1},{"body": "I just came out of the toilet feeling proud with the mound I made... and this is coming from someone that is on his way to become a nuclear scientist.", "score": 1},{"body": "It's not the sandwich OP ordered, but it's the sandwich his mom needs right now.", "score": 1},{"body": "Sick reference", "score": 1},{"body": "**Do not google** Can confirm I have this...NOW", "score": 1},{"body": "Oy!", "score": 1},{"body": "i thought this was Skyrim, It looks so real!", "score": 1},{"body": "Small dad is small!", "score": 1},{"body": "You're so lucky to have a wife and children. I'm 46 and I have little hope left.", "score": 1},{"body": "[definitely the best pic in the collection](http://guiltykitchen.com/images/Breast%20small%202.jpg) ", "score": 1},{"body": "Whoa sup 90s teens.", "score": 1},{"body": "First date and she puts her foot in your crotch... You've got moves\n", "score": 1},{"body": "I did this with an explorer. Actually bought one that was clean on the outside but filthy on the inside. Then bought one that was wrecked for the motor. So the outside was smashed but the interior was literally like new. So I did a little switcheroo, and wound up with a terrible cold the next day. I blame nasty explorer. ", "score": 1},{"body": "Sweet dreams Chester❤️", "score": 1},{"body": "WorthIt.jpeg", "score": 1},{"body": "OH I GET IT!", "score": 1},{"body": "C, Ottawa Canada", "score": 1},{"body": "If you want it to be a bicep, it needs more veins!", "score": 1},{"body": "Look Reddit, I'm sorry for upsetting those who don't think this picture belong on this subreddit. I just want to find my dog. I knew posting it to a major subreddit would get it around the quickest. I have posted pics in r/aww, r/Houston, and r/Texas. I really am sorry for upsetting some of you. I love reddit, it is the best thing ever. I am a mobile user and it's convenient. This picture is a couple of months old. I don't have many. And I don't really know how to post pictures onto the comment thread. Thank you to those who had words of encouragement and to those who have offered support during this time. ", "score": 1},{"body": "You really let yourself go", "score": 1},{"body": "I think he's hotter...especially with the long hippie girl hair cut off.  OP, you're hotter now :)", "score": 1},{"body": "Cute pup :)", "score": 1},{"body": "She's still smokin...but you look a little \"weathered,\" bruh...hey, happens to best of us. I'm like Eric Stoltz next to my wife in pictures...so cheers!", "score": 1},{"body": "Mmm deep fried dick, my favorite! ", "score": 1},{"body": "May I say, your wife is a babe. Shwing!", "score": 1},{"body": "Someone working the kitchen just said \"fuck it, I'm done\"", "score": 1},{"body": "Fuck HammerAndTickle. Thank you for your service.", "score": 1},{"body": "Don't tell me what I can't do!", "score": 1},{"body": "Sorry for the loss you will have to endure, but thank you for keeping your friends best interest in mind.  My wife and I had to make that decision the day before we left for vacation last year which was also 2 days before my wife's bday.  I want going to let our dog stay in the vet alone while we were gone with the strong chance of dying while we were away.   It's horrible to go through but I'm sure your dog has giving you some of the best memories you have.   Let it ease your mind you have giving him/her a great life.", "score": 1},{"body": "It's so weird living in manitoba one of the very first places on earth to legalize same sex marriage then an hour and a half south abortions are illegal and same sax marriage  isn't legalized.", "score": 1},{"body": "Gay marriage is exactly as necessary as straight marriage. Either abolish both or allow both. \n\nYou're a much worse type of zombie than the people you oppose are. ", "score": 1},{"body": "Jesus, he's still *alive*?", "score": 1},{"body": "id love to have met chester\n", "score": 1},{"body": "Because they get older and cut all their hair off to fit in to society.", "score": 1},{"body": "I'm super curious what kind of dog he is. Gorgeous. Probably a mutt. I've always been attracted to them. \n", "score": 1},{"body": "Your story just gets better and better!", "score": 1},{"body": "It's a sick world we live in friend.", "score": 1},{"body": "That's the whole idea, man. Getting feedback from receivers was a major highlight for me, because it validated a lot of my pride (in a good way).", "score": 1},{"body": "Hey, get back here!", "score": 1},{"body": "Looks like the Jetsons house ", "score": 1},{"body": "Rip mouse.", "score": 1},{"body": "Awwww I lost my dog about the same time too. They are the greatest.", "score": 1},{"body": "wilf ", "score": 1},{"body": "It's one post out of a million r/pics posts in a day. Get over it. Scroll down. Click another blue link. Life will go on if this one post gets upvotes I promise you. ", "score": 1},{"body": "IT's not a receeding hairline...it's a proceeding forehead ;)  I think you're hotter in the second pic without the long hair.  Lovely family, awesome pic, this made me smile.", "score": 1},{"body": "Sorry to be the bearer of bad news but your dog looks dead in this picture ", "score": 1},{"body": "Yep", "score": 1},{"body": "step one, cut a hole in the box", "score": 1},{"body": "Fuck off OP.", "score": 1},{"body": "who gives a shit? if people feel compelled to help, why do you care?  Fuck.", "score": 1},{"body": "Quick, someone add a Brazzers logo to this picture!!", "score": 1},{"body": "Goddamnit... I read the comments, and I still read it. Why do I this to myself? One of my dog's 12 years old... so, I'm gonna keep this close to my heart.", "score": 1},{"body": "He for sure enjoyed it, sorry for your loss ", "score": 1},{"body": "CCI has gigabit now, I know a few people who have it. ", "score": 1},{"body": "I would have expected the gun positions to be reversed", "score": 1},{"body": "Might be within the rules,  but what do you honestly think is going to happen, once everyone starts crossposting emotional lost pet stories like this? My opinion is that the mods should limit posts like this to regional subreddits, as to not ruin the content of popular subreddits. I certainly did not visit this subreddit to help some dude 7000 miles away find his dog.", "score": 1},{"body": "a moose once bit my sister", "score": 1},{"body": "Do ya like ya own sausage?", "score": 1},{"body": "Tru Dat  Home-Skillet ", "score": 1},{"body": "Wonderful family, and you have both aged incredibly well. As for those concerned with the Mrs. feet in the second photo, that is likely nothing more than an indication that when shod, she is so in an attractive/provocative way (toe configuration is somewhat indicative of long-term wearing of pointed-toe high-heeled footwear that places extra force on the toes, with room to expand toward the center of the foot). Lucky guy, lucky lady... The kids look cool too. My congratulations.", "score": 1},{"body": "I'm pretty sure I got a sun burn today in California I was in a t shirt all day working it was hot ", "score": 1},{"body": "As someone with every characteristic listed including TMJ, all I can say is shitfire.  I never knew my Eagle's talons were the reason for my foot pain.", "score": 1},{"body": "Whoa, whoah, whoah...reddit can't handle a normal, healthy courtship. ", "score": 1},{"body": "Source: http://neopren.tumblr.com/\n\nAlso, relevant article: http://blog.kexp.org/2015/01/08/video-roundup-the-king-the-thin-white-duke/", "score": 1},{"body": "He thought he was one of them. Nothing wrong with that. ", "score": 1},{"body": "Nice!  Now do Andre!", "score": 1},{"body": "There are also 'Gyaku' style ones, where gyaku means reverse. The men are behind a one way mirror with the women watching and deciding if they want to meet you. Both sides have access to similar drink/food/entertainment facilities. I would have taken some pictures of this too but it's a little hard when they can see you haha. A little more cramp than the ladies version and was like a sauna in there.", "score": 1},{"body": "Everytime I see these when teenagers then later photos I think to myself, am I going to change that much too?", "score": 1},{"body": "The usual one is on a red background at on the corner of SE 7th and Salmon. I haven't seen the white version before.", "score": 1},{"body": "Lol", "score": 1},{"body": "[It's Mario](http://upload.wikimedia.org/wikipedia/en/9/99/MarioSMBW.png)", "score": 1},{"body": "Her leg and his arm, well I guess that explains the look on his face... A little closer, a little more... how much further can I go before she blows my head off", "score": 1},{"body": "If you look closely enough, you will see donuts. ", "score": 1},{"body": "Absolutely. ", "score": 1},{"body": "When it's my pups time, I will take her to the park, give her favorite snacks, and pet her until the vet comes to us to say goodbye.  Will be worth every penny.", "score": 1},{"body": "Wow, you're very cultured and intellectual.", "score": 1},{"body": "I couldn't disagree more. The previous thread's top comment argued to \"have Muhammed do ordinary tasks\", and that's exactly how OP followed up. I love it.", "score": 1},{"body": "My dad has a shirt that says \"I'm not losing hair, I'm getting more head\".", "score": 1},{"body": "I remember a backhanded compliment thread on askreddit a while back\n\n&gt;You married up\n\nI think that would fit that nicely lol.", "score": 1},{"body": "She aged well sorry I can't say the same for you. Well besides that awesome pictures!", "score": 1},{"body": "Source?", "score": 1},{"body": "THAT is awesome!  You guys are too adorable, and for a second I thought it was my own mom in the second pic with the cat classes!  ", "score": 1},{"body": "No no no no no no no no no no no no, NO! ", "score": 1},{"body": "We need to interview the dog on why he ran away. There's more to this story...", "score": 1},{"body": "Ice Queen.", "score": 1},{"body": "I was going to upvote this, but your username hit a nerve that I cant quite shake off.", "score": 1},{"body": "I watched a video on him in which he appeared to win a fight with a normal adult male. They're thinking that his small size is actually beneficial because his opponents have to stoop to fight him, and his centre of gravity is lower.", "score": 1},{"body": "Oh great now I have a bonner", "score": 1},{"body": "wed* :)", "score": 1},{"body": "The best way to get over losing the good ol' hound is to get a puppy.", "score": 1},{"body": "I've been told \"eat a dick\" plenty of times, but no one said anything about it being deep fried. This changes things.", "score": 1},{"body": "There's a different one on the corner of SE 7th and Salmon. It's the same image, just somewhere else. It's like a real life repost!", "score": 1},{"body": "I live in merry old england but I'll still keep an eye for her all the same.", "score": 1},{"body": "You guys rock, man, the Statue of Liberty ain't that bad either", "score": 1},{"body": "But you stayed hot", "score": 1},{"body": "I wanted this to be the top comment. It wasn't. I gave you an upvote. Get more upvotes please. K thx.", "score": 1},{"body": "one of the best known faked photos  . nice one", "score": 1},{"body": "Oops, didn't see it.  Thanks.", "score": 1},{"body": "Insert joke about a subreddit featuring monsters that didn't do the math here", "score": 1},{"body": "Where is this? I've always wanted to go someplace to see a sky like this.", "score": 1},{"body": "dadadadadadouche ", "score": 1},{"body": "Calm down dude, snigle means hot. Like \"Q: Did you see the ass on that one? A: Yeah, she's so snigle.\"", "score": 1},{"body": "Looks like one of those triangle ufo's to the right of the moon.", "score": 1},{"body": "I cried after watching this and looking at myself.. : ' (", "score": 1},{"body": "Rob Schneider?", "score": 1},{"body": "Thank you for dropping some knowledge on me. I had no idea they'd done this.", "score": 1},{"body": "Who said they didn't know each other before? They could have been friends for years and that was just their first *date*. And a lot of people like doing fun things with fun people, and don't worry about going to fast or anything. Many people just like doing fun and spontaneous thing, and many don't. To each their own, I guess.", "score": 1},{"body": "it's in walnutport pa just north of allentown.", "score": 1},{"body": "They spent all the salt on salary.", "score": 1},{"body": "Wi tu lo", "score": 1},{"body": "That's what they want you to think!", "score": 1},{"body": "My folks live in the Woodlands and I've linked my mum to this thread.  They'll be on the look out :)", "score": 1},{"body": "Didn't know this had a name.", "score": 1},{"body": "No that's tickle me elmos fire from futurama. ", "score": 1},{"body": "That damn movie man... The family got that not long after our lab was put down, thought it would be a nice, happy movie. Bad idea man.", "score": 1},{"body": "Because it can go bad if you dont.....it clearly says refrigerate after opening on the bottles", "score": 1},{"body": "Are the kids named Jules and Verne?", "score": 1},{"body": "Looks like lightning to me.", "score": 1},{"body": "I'm having trouble with the Burman's v. Hellmann's mayo. ", "score": 1},{"body": "Sweetest thing ever!!!! I love thid", "score": 1},{"body": "Are those pajamas?  If they are I hope this isn't a 4 gulag occurrence or some fat shaming wil be needed", "score": 1},{"body": "He could be the groom", "score": 1},{"body": "I've read all the comments and can't help but wonder why you don't just post another picture of your dog? Not just to dispel those who call you a liar but also so anyone in the area has a better comparison picture. ", "score": 1},{"body": "Your wife looks really familiar...  Maybe she just has one of those (immortal, never-aging) faces.\n\nCute photos!", "score": 1},{"body": "I must say that guy was a real knot head. \n", "score": 1},{"body": "you have won my up vote ITT lol", "score": 1},{"body": "You know how to cut to the core of me Chester.", "score": 1},{"body": "I'll keep my eyes peeled in CA for you!", "score": 1},{"body": "Hipsters.", "score": 1},{"body": "Yeah, being a kid sucks. As an adult you have the freedom to actually do what you want.", "score": 1},{"body": "Yes because op submitted the [original](http://www.reddit.com/r/aww/comments/2kgngj/my_new_rescue_gray_just_stretching_it_out/) photo 2 months ago and they took it and added text to it.\n\n", "score": 1},{"body": "I only saw 2 kids..", "score": 1},{"body": "\"Yeah, I thought it was supposed to be a dick. You know, to be more masculine or whatever.\"\n\n", "score": 1},{"body": "Sounds like a wardrobe malfunction to me.", "score": 1},{"body": "As someone who hates feet, this disturbs me.", "score": 1},{"body": "You have to watch all of Clerks.... This is the best one! ", "score": 1},{"body": "yes - it was very cold. my sleeping bag was just south of $750, rated for -32, though there are bags north of $1k for -40. laying a mat down helped, a down comforter above the bag for extra insulation is necessary, and an insulated tent is damn near required, though i didn't have one. i slept maybe 3 hours that night - between a mix of staying late in the spring and the pain of my hair freezing to the pillow, it was a rough day and a much better sleep the next night (no pillow though, which was a bag of ice after the first night). ", "score": 1},{"body": "I keep thinking this is one of those \"When you see it....\" pics.", "score": 1},{"body": "*her\n\nI thought the otter bag with hearts all over it would give it away.", "score": 1},{"body": "I think that's actually a woman though ", "score": 1},{"body": "https://www.youtube.com/watch?v=7ZmqJQ-nc_s", "score": 1},{"body": "A cynical Redditor? Well now I've seen everything...", "score": 1},{"body": "We will prevail", "score": 1},{"body": "I wish I could find a video link but I remember a scene from american dad where dog heaven is all the dogs chillin on a lake riding boats around and every once in a while they shoot a dragon with an RPG. I'd like to imagine that's what it's like", "score": 1},{"body": "Just wondering out of curiosity, but why does it seem like putting down dogs is so common? I feel hear about it a lot.", "score": 1},{"body": "Wow. I completely disagree. You really think you can name all the short stories you read in your years of education? I sure can't, and I had wonderful teachers. Hell, I can't even remember most of the stories we read in my best teacher's class! But I'm damned glad to have been a part of her class, because she taught me a ton. ", "score": 1},{"body": ":0", "score": 1},{"body": "I give you props for staying with the same woman for 20 years, personally i doubt i could ever do that", "score": 1},{"body": "http://www.reddit.com/r/pics/comments/2rt5xz/graffiti_seen_on_the_streets_of_portland_oregon/cnj1juz", "score": 1},{"body": "This shit is sad man. Very sad, specially when you own a dog.", "score": 1},{"body": "They should just leave that in the middle of a forest somewhere to scare the fuck outta anybody unlucky enough to come across it.", "score": 1},{"body": "My apologies. I was clearly too busy looking at the fried chicken wang.", "score": 1},{"body": "I like how it's placed between two soft buns. Slap some mayo on that and call it the \"Moneyshot.\"", "score": 1},{"body": "...and that's how your mom and I met...", "score": 1},{"body": "Freedom Fries ", "score": 1},{"body": "r/relationshipgoals", "score": 1},{"body": "You bought a lumina? Welcome to the club my brother :) (or sister...)", "score": 1},{"body": "Baristas that want to flip your expectations of the world waaaaaaay on its head in the least rebellious way possible.", "score": 1},{"body": "[You need this book OP.]( http://i.imgur.com/L30WCN7.jpg)", "score": 1},{"body": "I'm not trying to persuade you to like America, or argue that position to you, but seriously, *fuck you* for trying to take away this man's accomplishment because you hate your nation. If it's so much better in Ecuador, go there. You have so many legal rights in America, but you have no reason to degrade the accomplishments of this man. ", "score": 1},{"body": "In our small town newspaper an obit that should have read \" The family of the late Felix Fourflusher...\" (not his real name but he was quite a character) actually ended up being printed as \"The family ate Felix Fourflusher...\". I'm sure Felix was rocking and rolling over that one.", "score": 1},{"body": "Technically New Brighton, but fuck yeah Fridley!", "score": 1},{"body": "This is really cute :)", "score": 1},{"body": "your wife doesn't age", "score": 1},{"body": "/r/lewronggeneration ", "score": 1},{"body": "my heart hurts for you :(\n", "score": 1},{"body": "I didn't even notice that. It totally does.", "score": 1},{"body": "Irondale class of 2001! Go Knights!.....marching band...they're still good right?", "score": 1},{"body": "Consistency with the reverse perhaps, since entering 0.5555556 on a standard calculator isn't as nice as 5÷9=", "score": 1},{"body": "No, but you got a cute picture of their dog, while they're also trying to get help.", "score": 1},{"body": "Queen's U eh? Got a couple friends there right now.", "score": 1},{"body": "Can confirm, own a lumina.", "score": 1},{"body": "Well, Switzerland gave (Canada i guess) Quebec city a clock. It's basically a pocket watch, but on a huge scale worth 2.4m.\n\nhttps://www.ville.quebec.qc.ca/EN/apropos/portrait/hotel_ville/horloge_jura.aspx\n\nAnd France gave Quebec city the \"Fontaine de Tourny\" worth ~4m.\n\nhttp://fr.wikipedia.org/wiki/Fontaine_de_Tourny\n\nThe city receives several other gifts (but most on a temporary level) for its 400th anniversary.", "score": 1},{"body": "Super jealous", "score": 1},{"body": "[I==I](https://38.media.tumblr.com/e7eef8314af182afd4e97db2c120230a/tumblr_mi2yovb2tf1rwp0uyo1_500.jpg)", "score": 1},{"body": "Mr boyfriend and o had a debate. Was it shot in Winnipeg or Regina or neither? ", "score": 1},{"body": "We truly do not have these little fuzzbuckets around long enough. \n\nI have a Labrador, named Nilla, and I can't begin to think about \"the\" day when she has to leave me. We lost our little Papillon in May of last year; she passed away in my dad's arms (whom she loved beyond anything else in the world, so there's some comfort there) three days after a hail mary surgery to clear an infected uterus. It still hurts, thinking about her. \n\nLots of onions being cut in this thread. I'm sorry for your loss. :( ", "score": 1},{"body": "Awww melt my heart. ", "score": 1},{"body": "No, it's a messenger bag. Bungalow 360!", "score": 1},{"body": "Now its just missing Meayo", "score": 1},{"body": "Not too much eh? What a lovely life you've lead so far :)", "score": 1},{"body": "Whaddup from the woodlands, I'll keep an eye out", "score": 1},{"body": "Also put this on Craigslist, Houston, lost and found.", "score": 1},{"body": "I dread the day I have to do this with one of mine.\n\nAbsolutely dread it. It's so odd to think that, you know it's coming, he or she doesn't. And you try to make the best of it and create some memories, one last time, while making sure he or she has the absolute best time. \n\nFeels. So many feels, OP. Godspeed, Chester. May you forever chase squirrels and eat your favourite treats over the rainbow bridge. \n\nDon't leave the room, OP. Stay with Chester until it's over. I don't doubt that you plan on staying but just saying. They look for you if you go. ", "score": 1},{"body": "I had to put one of my dogs down due to cancer and I just couldn't bring myself to be there when it happened. I just couldn't accept the reality that they were going to be \"gone\". I didn't want to see the finality. I was there with him all the way until the injection had to happen - I had to leave before I saw my best friend's lifeless husk.", "score": 1},{"body": "Oh my you are right haha my mistake ", "score": 1},{"body": "He looks like a good boy", "score": 1},{"body": "Yeah I don't know man I just can't seem to muster up the fucks to care if they look at my meaningless text messages and emails or not. Life's easier if you're not so paranoid and angry about things you can't change. I have a friend that tapes over his webcam and kinect because he's worried about the government spying on him. That's a ridiculous way to live. \n\nWe live in a different world. ISP's probably know more about you than the government. There's cameras everywhere. Your privacy is quickly eroding. Accept it, because you're not going to stop it. \n", "score": 1},{"body": "Are they stars? What is that?\n\nEdit: seems really foggy, no other visible stars, wtf man", "score": 1},{"body": "this made my eyes misty", "score": 1},{"body": "Amazon prime has em all of you want. Mexican Netflix has a lot of SG1 but that can be dangerous now.", "score": 1},{"body": "He got fat; she's still hot.", "score": 1},{"body": "Someday I hope to visit. Neptune. ", "score": 1},{"body": "The sun does it too. They are surprisingly called, Sundogs. ", "score": 1},{"body": "\"An old hound in an old sweater.  Both have seen better days.\"", "score": 1},{"body": "The United States does not have an official language. ", "score": 1},{"body": "can you describe it?", "score": 1},{"body": "Yeah I can definitely see the pit in her but at the same time she's definitely not fully a pit bull that's why I was confused. \n\nAnyways, back to the topic. I'm right next to you in Louisiana. It's very unlikely but stranger things have happened so I'll keep an eye out for people selling dogs on craigslist that look like yours, OP.", "score": 1},{"body": "Try Netflix mexico.", "score": 1},{"body": "You got fat boy.", "score": 1},{"body": "Sorry, cat too cute. Must take for myself... Must find first =O", "score": 1},{"body": "Thanks to Google maps, I got the exact place! Here you guys go:\n2606 Nw Vaughn St\nPortland, OR 97210\n\nIt is behind the restaurant in the parking lot. :)", "score": 1},{"body": "We decided to put my black lab down once she stopped eating (in her prime she could eat a damn horse), once her bowl remained full and she couldn't get off her bag, we knew.\n\nIt took about 3 days of watching her eat a little and wag her tail when we pet her before we took her into our lifelong vet,  and when I was carrying her to my moms car, she licked my face furiously. To this day, I will always swear she knew what was happening, and was saying good bye to a great friend.\n\nI will always love our Hannah.", "score": 1},{"body": "Looks like he dropped a *fatwah-n*", "score": 1},{"body": "I'm 18 and I wasn't even supposed to be here today. ", "score": 1},{"body": "Thought this might be [Appropriate](http://i.imgur.com/VLEr2jh.jpg)", "score": 1},{"body": "You sure? I just see a floating jersey. ", "score": 1},{"body": "So it gets easier? I'm only 19 and I already wish I could be in 8th grade again", "score": 1},{"body": "How did that treat your mascara once you defrosted? My girlfriend got to arrive to her first day of work this week and thaw out into crying eyes (she didn't think about the mascara issue beforehand).", "score": 1},{"body": "I'll keep an eye out in San Diego. ", "score": 1},{"body": "You lost your crown! Story time. ", "score": 1},{"body": "That poor battery...", "score": 1},{"body": "This is a picture, not a painting...", "score": 1},{"body": "please OP, PLEASE dip the tip in some ranch sauce.\n\ndeliver\n\ni'm waiting", "score": 1},{"body": "It absolutely does help, thanks a lot. I actually had no idea that it had to do with advertising. (Please don't judge there, any type of professional creative process is completely foreign to me.) \n\nIs copywriter a position one works toward or is it like a category? Example, something I'm familiar with, I could be an electrician by trade but I could be an apprentice, journeyman, or master. I guess the better question is are there different \"ranks\" (military guy here) or is copywriter a very specific position?", "score": 1},{"body": "You find two girls who look like Santa Clause and dig your [beard?](http://www.reddit.com/r/beards/comments/2cm7qo/my_7_month_old_red_ginger_beard/) \n\nWhere do I sign up?\n\n", "score": 1},{"body": "Thanks! Will seriously consider this once PA stops being a frozen windy hag.", "score": 1},{"body": "Your wife started out pretty out of your league and somehow progressed to *even more* out of your league.\n\nWell done sir.", "score": 1},{"body": "too bad they arent gettin buttfcked", "score": 1},{"body": "Fast shipping, Item as described. Would use again. AAAAAA++++++", "score": 1},{"body": "Ask him if she's single. ", "score": 1},{"body": "Sorry about your pup OP, give him a huge kiss for me", "score": 1},{"body": "You're braver than I am, I've been avoiding going outside. \n\n(I just want summer again...)", "score": 1},{"body": "You seem to just be getting older while your wife is getting better.  Also, despite superior technology, it would appear that the 1990s photographer was more skillful--note the thoughtful crop of the Sasquatch feet.", "score": 1},{"body": "I bet your wife is just as beautiful in twenty more years.\n\nCheers.", "score": 1},{"body": "It was hot in my part of Cali. I was sweating so I had to sit by the fan without any pants on this afternoon. The struggle is real.", "score": 1},{"body": "That's so sweet man. ", "score": 1},{"body": "look, i know having kids takes time but you *really* should have slayed the dragon by now. he's terrorizing your city while you pose for a family picture, what kind of king are you?", "score": 1},{"body": "I'll be that guy... I think she does", "score": 1},{"body": "You need that hair back...bro!", "score": 1},{"body": "Sorry to hear about this. You did right by Cookie, even though it hurts a great deal.  Look back fondly at the puppy pictures.", "score": 1},{"body": "Oh please, you're not sorry at all. You want to find your dog. I just wish the mods here at /r/pics cared about this sub more than you do. \n\nFor those of us that prefer a pic sub with better rules, there's /r/pic instead. ", "score": 1},{"body": "Twin Cities the past few days has topped out around zero, but windchill is down to -30 F", "score": 1},{"body": "Old Timey Photo technology really has come a long way in 20 years", "score": 1},{"body": "Dude, you are a lucky man! She looks like she has aged magnificently! Well done!", "score": 1},{"body": "I think Tom Cruise and Brad Pit are getting hotter as they get older. I mean I could could drown a family of Rhinos in my panties looking at them.", "score": 1},{"body": "What a sweet looking pup. Sleep well Chester. ", "score": 1},{"body": "That poem justice me cry in front of my daughter", "score": 1},{"body": "who cares? so what you are saying is your life is that boring and lame that you have nothing better to do then comment on a picture you could car less about?", "score": 1},{"body": "get out of here carlsbad.....", "score": 1},{"body": "Not much of anything I'd wager", "score": 1},{"body": "M'azda", "score": 1},{"body": "I grew up in New Brighton, I live in Eagan now. I lived 5 minutes from these guys, I still go back every winter to see the new sculpture, can't wait to see the turtle! Awesome job guys!", "score": 1},{"body": "You have bathing suits on? Amateurs. ", "score": 1},{"body": "u fkin w0t m8? (๑•̀ㅂ•́)و", "score": 1},{"body": "You didnt order a Cockmeat sandwich?", "score": 1},{"body": "Is that you Billy?", "score": 1},{"body": "It looks like a small clear ornament.", "score": 1},{"body": "They are not open at all in the winter. They'll reopen in the spring.", "score": 1},{"body": "The camera man risked his life for this ", "score": 1},{"body": "the pic is alright, the sob story is generic, but i guess that's all it takes these days", "score": 1},{"body": "Your shotgun in the second picture is surprisingly un-cocked. Did you put the safety up after two successful firings?", "score": 1},{"body": "I'm also [experienced in that](http://a.pomf.se/mbjwio.webm).", "score": 1},{"body": "No it definitely tilted just enough for the movies to fall down", "score": 1},{"body": "Really? Damnit... Guess I don't have much choice now. Although if someone is going to watch it, I would suggest starting out with the revamped version of Children of the Gods.", "score": 1},{"body": "Have kids and it's socially acceptable playtime all over again!", "score": 1},{"body": "Which movie is that from again?", "score": 1},{"body": "Prostitution is illegal in Japan but there are a lot of loop holes and gray areas. The girls don't work for the establishment, what is discussed between the female and male is private, so I think that's why they don't get in trouble with the law. So yes, sex is an option but some people just want companionship, maybe just go on a date.\n\nSo to answer your question, yes some of them are prostitutes.", "score": 1},{"body": "I'm a little late to the party as always, but just stopped by to say cheers. Love these photos and the story it tells. Take care, my friend!", "score": 1},{"body": "I'm a 33 year old man crying because I don't want my dog to die... he's my first dog, such a good boy. I'm sorry for your loss.", "score": 1},{"body": "\"Perfect\"", "score": 1},{"body": "What the fuck OP this makes me so sad. Flash backs to having to put my baby down. I'm really sorry give your pup a kiss and a pet for me.", "score": 1},{"body": "UK signing in, the dog is not in Oxford for sure", "score": 1},{"body": "Sweet Jesus have mercy...", "score": 1},{"body": "Waynes World would like a word", "score": 1},{"body": "Not yet. ", "score": 1},{"body": "And whoa, never expected this to blow up o.O", "score": 1},{"body": "She does a really great bit on photo shoots and Photoshop in her book. Too lazy to look it up now, but the gist is basically that it is fun to be pampered, and everybody knows it gets Photoshopped anyway.", "score": 1},{"body": "wow american girls are gigantic", "score": 1},{"body": "I'm sorry", "score": 1},{"body": "I was wondering if you could please tell me the name of the facebook page. ", "score": 1},{"body": "Bro ", "score": 1},{"body": "TIL OP's father was black.", "score": 1},{"body": "Wow! The very first gay couple!", "score": 1},{"body": "It hurts, but it was right to do. I wish in had put my dog down rather than let him suffer. Theyre our family though and best friends. Maybe cookie is waiting for you now on the other side of the rainbow bridge.", "score": 1},{"body": "being respectful is a pretty damn simple concept. What dont you understand?", "score": 1},{"body": "My first initial thought hahaha. ", "score": 1},{"body": "Crazy to imagine. I watched Clerks over and over on VHS when it came out. \n\nThe other crazy thing to imagine, Dazed and Confused came out around the same time. It took place in 1976, which was about 18 years previous to the release date. Which seemed like a completely different world from the 90's. If a similar movie was released today, it would take place in 1996 or 1997. Which seems like mere moments ago, at least for anyone born in the early 80's. Man, time flies. ", "score": 1},{"body": "first pic looks a lot more antique", "score": 1},{"body": "&gt; Nepal \n\n&gt; Peak  \n\nI see what you did there. ", "score": 1},{"body": "I think there's some symbolism here", "score": 1},{"body": "Quiet down Mark, they'll think it either way.  \n\nBetty says hi. ", "score": 1},{"body": "haha same!", "score": 1},{"body": "Let me guess how.... It's not cold!", "score": 1},{"body": "For those areas that didn't want to come up definitely try some spray degreaser, that stuff works miracles. Its a helluva lot cheap than carpet cleaner as well.", "score": 1},{"body": "Unbreakable", "score": 1},{"body": "Someone told me this like 2 hours ago. Girl I tutor's dad, is that you...", "score": 1},{"body": "No, because it just isn't that interesting.", "score": 1},{"body": "/r/feet please?", "score": 1},{"body": "It's good to see you happy together after 22 years. Great photos!", "score": 1},{"body": "jay before, alex jones after", "score": 1},{"body": "by class you mean 11th grade english?  ", "score": 1},{"body": "She was a stray. She's been fixed, and all the kittens were found permanent homes. All is well.", "score": 1},{"body": "And you are a scumbag.", "score": 1},{"body": "I'm sorry to say this actually happened a few years ago. I was organizing files on my computer and came across it. It never fails to make me laugh so I thought I'd share. \n\nThe best part was the \"shaft\" was even hanging out of the box when I opened the bag and I immediately thought it was some sort of prank. The employee HAD to notice...", "score": 1},{"body": "Saw your post about your dog. I live off spring cypress next to 249. I'll keep an eye out but where was he lost?", "score": 1},{"body": "Knew this was Canada. Anytime I see people doing stupid things either in a frozen tundra or a searing desert using those weird ass measurments I know it's my brothers Canada or Australia.", "score": 1},{"body": "Never seen that in a fridge. Ta\n", "score": 1},{"body": "Tortoise-shell cats. Close.", "score": 1},{"body": "This is sort of weird of me to ask but where is the first photo from?! My parents have a similar photo (like almost exactly the same except for you two obviously) and they took it a few decades(?) ago.", "score": 1},{"body": "Obviously that commenter knew they were wrong. They deleted their entire account.  ", "score": 1},{"body": "They likely had ideas in mind. I feel the second portrait solidifies this theory.", "score": 1},{"body": "YOUR WIFE HAS SHITTY TRIGGER DISCIPLINE.", "score": 1},{"body": "It's safe for now, adorable actually, but beware of edits. ", "score": 1},{"body": "He's Alex Jones ", "score": 1},{"body": "Why did you have to put her down? I'm tearing up just having read this short comment. ", "score": 1},{"body": " Wait. Is the joke that this looks like the Western one? ", "score": 1},{"body": "You'zes hairs gonna break.", "score": 1},{"body": "Go Knights indeed! I graduated in '11 and they were still unsettlingly good so I'm going with yes", "score": 1},{"body": "Cocker spaniel, right? They are the most loveable beings.", "score": 1},{"body": "Most times they are, if they stay in shape.  \n\nI've had some compliments from people at my 10 year high school reunion a few years ago saying that I look a lot better.  Granted, they're comparing the baby-faced awkward puberty falconbox to the grown man falconbox.", "score": 1},{"body": "They are right. Never abandon your buddies. They look up to you and want you there for them even if they may not seem like it. Sometimes animals get forgetful towards the end. They know who you are though by your loving presence in their final hour. Love your pets. It's the least you can do for them. ", "score": 1},{"body": "We had to put down my family's miniature schnauzer about 4 years ago and I'm tearing up reading all the comments here. Jeff would ALWAYS scarf down his food in the morning, but the last morning he didn't rush to eat his food and my mom knew it was that time. :-(", "score": 1},{"body": "I did once to my warehouse stocking job. I was \"too nicely dressed\" so they put me in the office for the day doing paperwork instead.", "score": 1},{"body": "Yea, I think he's talking without wind chill. Because on a non-windy cold day it can be pleasant to walk around with your 3 layers and be all warm. Throw in some windchill and FUCK THAT. Your face freezes off, RIP your hands. The whole shebang. ", "score": 1},{"body": "Hilarious. Made me say care to myself a bunch. ", "score": 1},{"body": "The sad realization that 20 years ago was 1995. ", "score": 1},{"body": "Yeah, the breeze brought in the coastal fog a little early.  Still, shorts and flip flops weather.", "score": 1},{"body": "http://www.independent.co.uk/news/world/europe/cartoonist-promises-to-draw-mohamed-every-day-for-the-rest-of-the-year-in-protest-of-charlie-hebdo-attack-9964703.html\n\nOP gets a story in the independent", "score": 1},{"body": "Sadly the Ice was made in China and melted faster than Canadian Ice.", "score": 1},{"body": "Such a fearsome, regal thing.", "score": 1},{"body": "It's due to time dilation. He did travel a lot.", "score": 1},{"body": "Best of luck finding this beauty!!", "score": 1},{"body": "My wife is a schoolteacher.  I manage an IT department.", "score": 1},{"body": "The next logical step is for all of us to just go mentioning that they exist in hundreds of posts. Really get their name out there", "score": 1},{"body": "Don't be sad. Bill Watterson purposefully left the characters intact and unmolested so that that part of your childhood always exists, and you can always go back to it; its memory will be preserved and even new generations can experience it as you did. It's the hack fraud artist in OP's link that's fucking with characters he shouldn't be fucking with that's manipulating your emotions.", "score": 1},{"body": "If it had been an option your bet your ass I would have (with her permission) had my mother \"put down\" when her kidneys and liver failed completely from the cancer that was ravaging her entire body. But no, we as a society put more importance of quantity of life vs. quality of life.  So instead she got to slip into a coma and scream when people touched her for the last 3 days of her life.   I just hope we follow in the footsteps of some other countries and legalize assisted euthanasia by the time it's time for me to go.   ", "score": 1},{"body": "I don't know. I took it about two hours ago. I'm going to go outside and see if I can find out. \n", "score": 1},{"body": "I'm really sorry about this but I have to ask, only because it just happened to us. Are there coyotes near you or anything that would go after little dogs? A week ago we let out our dog (mutt) and a coyote was waiting underneath our deck, snatched him up and started running away with him. Luckily I caught up with it a block away, he will be coming home tomorrow from the vet, 43 stitches later and being in shock for 3 days.", "score": 1},{"body": "Yes come to Canada fellow redditor. If you find yourself in Medicine Hat Alberta I'd be more than happy to welcome you. ", "score": 1},{"body": "Taking it to a whole new level.  How long before hipsters get a hold of it?", "score": 1},{"body": "Well, we can't know for sure, can we?\n\n", "score": 1},{"body": "He looks like a 25-30 year old powerlifter to me. Look at the baby face.", "score": 1},{"body": "Look at the wife in the first pic.\n\nShitty trigger discipline runs in the family.", "score": 1},{"body": "You can probably sell it for a profit now… :P\nI wonder if there are people making a living out of it, just like those people that buy old houses and make them look nice and resell them.", "score": 1},{"body": "Oh my gosh just thinking of breadsticks made me hungry...", "score": 1},{"body": "I love your eyelashes!! Awesome pic...", "score": 1},{"body": "I'm 22, and I can say that it won't in the next three years... That's depressing.", "score": 1},{"body": "You never put your head in the sleeping bag when it's closed. The humidity from your breath will leave you wet and could.\n\nSource: Boy Scouts", "score": 1},{"body": "Who is the artist?", "score": 1},{"body": "Yes there are vets whose whole practice is pet hospice and home euthanasia. RIP Crystal my sweet girl ", "score": 1},{"body": "i live in sept-iles. Québec, it was -37 this morning without humidy or wind", "score": 1},{"body": "Some foot to crotch action", "score": 1},{"body": "Looks not angry... But more like Sean connery", "score": 1},{"body": "You are hilarious!", "score": 1},{"body": "Books on hand flat, set coffee on top, open door?", "score": 1},{"body": "&gt;Me: Can confirm. Have deepthroated second toe.\n\n[...](http://i1231.photobucket.com/albums/ee509/reebzmuleboon/Community/Changsnap.gif)", "score": 1},{"body": "Yo yo yo... Waddup bitch ", "score": 1},{"body": "That is a cool truck.", "score": 1},{"body": "Oh god... If dogs lived 50-80 years, it would be permanently scarring to lose them. I mean, not that losing your perfectly loving and loyal companion isn't already bad enough, but if you spent *fifty fucking years* building a relationship with a creature that only feels a billion percent love for you, all the time..... ", "score": 1},{"body": "Your wife's toes are unsettling...", "score": 1},{"body": "Pssh, as though anyone in Portland owns a briefcase.", "score": 1},{"body": "You mentioned you live in Alaska, are the prices to heat your rooms expensive and is Fairbanks similar to most other American towns its size?", "score": 1},{"body": "Man, I coulda sworn I rode a gondola up a tower made of eiffels there. ", "score": 1},{"body": "My first time seeing a CA driver's license in portrait layout vs. the traditional landscape... what is the significance? ", "score": 1},{"body": "Why are her shoes off though? ... Is it a feet thing?", "score": 1},{"body": "That's quite a vivid picture you've put into my head... Heh", "score": 1},{"body": "I had the fun of going to a outdoor pool in Omsk Russia, which is in Siberia, in January, on -40c night. Same exact experience, one of the coolest things I've ever done. :)", "score": 1},{"body": "&gt;I was really hard\n\nUh. Uh.\n\n***Uhhhhhhhhhhh.***", "score": 1},{"body": "Sorry to hear about that. I have two shih-tzus who are 13 and 11. They're hangin in there, but I'm still scared shitless of the day when I will have to go through what you're going through. ", "score": 1},{"body": "Out of curiosity, could you link to or give an example of an installation that focuses too much on the process? Because I think I might know what you mean, but I'm not 100% sure.", "score": 1},{"body": "Now sign these contracts. Oh, they are part of the props, don't worry.", "score": 1},{"body": "Hmmm your username has a typo, and your reply.. I would assume the typo in your username is a joke, but now I'm not so sure.\n\nYou said quiet instead of quite... In case you don't know what I'm on about ", "score": 1},{"body": "Couldn't that be said about women who dont stay attractive?", "score": 1},{"body": "The older I get, the happier I am. ", "score": 1},{"body": "Sharia law varies widely between sects, regardless of the source materials' statements regarding blasphemy. Indeed, the Sunni sect itself has 5 major schools of sharia law. \n\nFrom Wikipedia: \n\n&gt;According to Jan Michiel Otto, Professor of Law and Governance in Developing Countries at Leiden University, \"Anthropological research shows that people in local communities often do not distinguish clearly whether and to what extent their norms and practices are based on local tradition, tribal custom, or religion. Those who adhere to a confrontational view of sharia tend to ascribe many undesirable practices to sharia and religion overlooking custom and culture, even if high-ranking religious authorities have stated the opposite.\" Otto's analysis appears in a paper commissioned by the Netherlands Ministry of Foreign Affairs.\n\nI think it's very important to remember that there are approximately 1.6 billion Muslims in the world - and the majority of them are nonviolent. Imams around the world are condemning this attack. \n\nThough I agree that most Muslims do not enjoy seeing their prophet desecrated, I do not agree that most celebrate this tragedy. \n\nI have Muslim neighbors and friends. There are Muslims on Reddit that you can talk with about their beliefs. In my personal experience, and in the news, I hear a unified reaction of horror. \n\nAre there others that celebrate? Of course. Just as Christian fundamentalist nuts celebrate when so called \"abortion clinics\" are firebombed. This type of extremism finds fertile ground in all religions, and in atheists as well (think of nationalist extremism). \n\nI agree - to a point - that reform is needed. I don't think it's Islam that needs reforming; I think it's Sharia law, which is based almost as much on custom as it is on religious source materials. ", "score": 1},{"body": "no one in this thread but you and I realize this?", "score": 1},{"body": "I have to disagree\nhttps://www.google.com/search?q=60+year+old&amp;rlz=1C1CHWA_enUS622US622&amp;es_sm=93&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ei=vG2vVKKHCsXxoASEoYHgBA&amp;ved=0CAgQ_AUoAQ&amp;biw=1304&amp;bih=683#tbm=isch&amp;q=60+year+old+man", "score": 1},{"body": "And your wife's STILL fucking hot.  Despite having 2 kids, I'd still like to spread her beef curtains apart and slap my beefstick around inside her hambox for a few minutes.. If you know what I mean.", "score": 1},{"body": "Do scientists know about this? ", "score": 1},{"body": "How hard is it to: find popular local attraction for daytime activity, find somewhere nice to eat, go see a live show/movie.\n\nI mean, he's not reinventing the wheel here.  ", "score": 1},{"body": "Best picture of muhummed yet.", "score": 1},{"body": "I love this.", "score": 1},{"body": "I saw something like this at the sonoma raceway in northern California a few months ago. Loud as shit!", "score": 1},{"body": "I appreciate how much you care about your pup. Anyone that has a dog or any pet for that matter understands that the line between pet and family member no longer exists when you love something that dearly. I love my dogs no less than I love any of my family members. In fact I love the dogs slightly more than a few of my cousins. ", "score": 1},{"body": "Very cute", "score": 1},{"body": "I'd personally rather leave them than stay and watch. It would he unbearable. ", "score": 1},{"body": "Shooting fish?", "score": 1},{"body": "/r/upvotedbecausegirl", "score": 1},{"body": "Yeah, its horrible.  I had to hike IN PERFECT WEATHER.  Then, went for a drive and damn it, PERFECT WEATHER.  I worked a bit outside today but of course had to plan for the PERFECT WEATHER.\n\nI enjoyed putting on a fireplace blue ray and curling up with some hot cocoa while the open window let in the slight chill that always comes after a day of PERFECT WEATHER.\n\nIts so hard living here.", "score": 1},{"body": "I love a good chainsaw wood carving. ", "score": 1},{"body": "It's like an orange on a tooth-peck.", "score": 1},{"body": "I find it interesting that those who manage to keep their child like imaginations into adulthood are often mocked and discouraged from such things, that it is bad to be \"childish\" in this way. Example: Adults who play Dungeons and Dragons or cosplay.\n\n", "score": 1},{"body": "How do you figure thats the same? You're suggesting that we show indifference to murder, and thats fucked.", "score": 1},{"body": "With all the commotion in the news, lets not forget this chronic repost that re-surfaces once a week.", "score": 1},{"body": "I'm German, currently living in Nigeria though. Well I guess it's a matter of definition when using the word \"casual\", what I meant is that I do read about international politics (I'm working in developing finance, so I need to know what's happening in terms of international relations) but I don't try memorizing any particular US-centric issues. Guess some things just stick better if they are work related.", "score": 1},{"body": "did you two wear that outfit all night?", "score": 1},{"body": "You're a cunt.  Worse, you're a stupid cunt.  The two statements aren't analogous.  The former is childish, petulant dullards getting offended (based on fairy tales, no less) by others exercising their fundamental rights in liberal democracies.  The latter is human beings being physically harmed by others in a violent, immoral crime that denies their agency as individuals and breaks the law in any and all societies worth living in.\n\nSo...you're kind of an asshole for drawing the stupid comparison and should apologize to rape victims everywhere, logic and basic human decency.", "score": 1},{"body": "http://i.imgur.com/KsWcUl2.png", "score": 1},{"body": "FOR WHAT?", "score": 1},{"body": "Me neither...", "score": 1},{"body": "That  might be the saddest thing I ever read =\\ ", "score": 1},{"body": "I've had so many moments out on a river like this, it's a shame here in Michigan we can only kayak half the year.", "score": 1},{"body": "Breaking news: consumption of citrus fruit now thought to cause blindness! ", "score": 1},{"body": "This is hilarious and I'm not sure why", "score": 1},{"body": "Near Kingston was like, -40 a few days ago. So damn cold.\nStay warm! ", "score": 1},{"body": "She aged well... You aged.... Poorly. But good on you for picking a good one.", "score": 1},{"body": "/r/creepy", "score": 1},{"body": "Is there a way to stop them? I wish Reddit had a daily submission limit of like 3 posts", "score": 1},{"body": "Not with that attitude!", "score": 1},{"body": "He seems like a very happy dog. I'm sorry for your loss. Pretty soon I'll have to have my cat put down (cancer) and I'm not looking forward to that day. It hurts when they've been in around for so long and become an inseparable part of the family. Best of luck tomorrow ", "score": 1},{"body": "KFC = Kentucky Fried Cock", "score": 1},{"body": "Where did you get this gif and are there more?!", "score": 1},{"body": "Photoshop - ruler tool - draw along water's edge - click 'straighten' - eye stops twitching.", "score": 1},{"body": "NO AND THEN!!!", "score": 1},{"body": "Try not to suck any dicks on your way across the parking lot!!", "score": 1},{"body": "When they finished, they were like, whoa.  Then their neighbors were like, whoa!  Then reddit was like whoooaaaaa.", "score": 1},{"body": "You're really living it up with that 2% maple syrup, huh?", "score": 1},{"body": "Who needs mascara anyway?", "score": 1},{"body": "It was -35 today and my boyfriends beard turned white like this ", "score": 1},{"body": "Smiling?! In a picture?", "score": 1},{"body": "Speak softly, you jerks! He can hear you", "score": 1},{"body": "Must. Not. Give. Into. Jealousy.", "score": 1},{"body": "French are descended from Gauls. ", "score": 1},{"body": "I'm so sorry for your loss. I had to put my kitty, Nanny, down on Monday. She was two days away from 12 years old and the 10th anniversary of the day I adopted her. She was the best cat ever, no lie. Plus it was sudden. I took her to the vet because she had stopped eating (and this is the cat that used to follow me around meowing ALL THE TIME for food), and they found a large mass on her liver, plus her ears were jaundiced and I hadn't really noticed until they pointed it out. Needless to say, this week has sucked. \n\nAgain, I'm so sorry. I really do know how you feel and it really does suck. They're our babies. I keep coming back to my facebook pictures of her. It's incredibly bittersweet. ", "score": 1},{"body": "\"You can't park your cruiser here, I'm sorry.\"\n\n\"It says I can't park from 8am to 10am, and its 10:01 by my watch. I find your lack of timepiece... disturbing.\"", "score": 1},{"body": "They should do Cthulhu, but with our luck that would summon him.", "score": 1},{"body": "Here ya' go\n\nhttp://www.independent.co.uk/news/secret-saudi-executions-shame-the-west-1576699.html\n\n", "score": 1},{"body": "Yeah, for some reason I thought that first one was from the early 80s...", "score": 1},{"body": "Bunch of white children eating watermelon.\n\nThat's racist.  \n\n", "score": 1},{"body": "MURICAN here. Our thoughts and prayers are with you all.  A threat to liberty anywhere is a threat to liberty everywhere.  We are all brothers and sisters in this struggle.", "score": 1},{"body": "Do a Flip!!!", "score": 1},{"body": "I wouldn't say the French is one of the less liked people.  On the contrary, there is a common sentiment shared by people world over about France and the French. France is commonly associated with all that is beautiful and refined, particularly in its culture. When people think of France they think of Paris, a place full of romance. There is something inherently respectable about France on the world stage. This is one reason this heinous act upsets me so much on a personal level. Everytime I hear about it or read about it I can't help crying.", "score": 1},{"body": "Awesome. ", "score": 1},{"body": "Where in Spring? The woodlands? Spring is massive. ", "score": 1},{"body": "The kind who only buys 2% maple syrup", "score": 1},{"body": "Don't just look at it... eat it!", "score": 1},{"body": "She is a smart and beautiful woman.  But now everytime I see a photo like this I think \"right-side\".  I only realized a month ago about the scar on her face - amazing how you can look right past something like that.", "score": 1},{"body": "Something, something relevant...", "score": 1},{"body": "Honestly, is this a joke?", "score": 1},{"body": "The vinegar component starts to overpower the other flavors. ", "score": 1},{"body": "I feel like this is worthy of many up votes and gold...", "score": 1},{"body": "i heard he's got a massive model train set!! wild!", "score": 1},{"body": "Rodger that Gray-goose. ", "score": 1},{"body": "There you go..", "score": 1},{"body": "Did you ask your mom for confirmation?", "score": 1},{"body": "Afghani, correct?", "score": 1},{"body": "Maybe he's a giraffe and the depths of his throat will never truly be challenged by any mortal being's toe", "score": 1},{"body": "/r/MachinePorn might appreciate this, despite it not being a machine and all =/", "score": 1},{"body": "I'll be in my bunk", "score": 1},{"body": "Good man.", "score": 1},{"body": "And yet I can't find anything online connecting those events to the schism....", "score": 1},{"body": "I thought my toes were normal. I guess I don't look at people's toes often enough. I have the long toe. ", "score": 1},{"body": "read it 4 times and i still don't see a typo", "score": 1},{"body": "/k/", "score": 1},{"body": "That has to be terrible for your hair. ", "score": 1},{"body": "I agree. I've put down a couple dogs, the last one on the way to the vet I bought him 3 cheeseburgers because the same why the hell not. He was overly excited.   After I got back to the car I bawled my eyes out too. The damn vet kept asking me if I was sure I wanted to do it too. Never went back to that vet again. ", "score": 1},{"body": "It made me think it would be interesting to have some kind of café in which you can look at beautiful people on the other side of a window, who can't really look back at you. I mean, just that, nothing sexual. How many times have we seen that stranger on a train who we feel like staring at for minutes except we can't because of social rules and the fear of being thought as a pervert? ", "score": 1},{"body": "Three months since a took a hockey stick to the eye. Was recently told my pupil may permanently stay like this. Protect your face, ALWAYS WEAR A VISOR!  ", "score": 1},{"body": "That's one cool car.", "score": 1},{"body": "That's where I grew up! I'll pass your pic around to my friends and family back home. Hope you find her safe and sound! ", "score": 1},{"body": "She hasn't aged a day. ", "score": 1},{"body": "I thought of that exact place at first (I grew up near there).", "score": 1},{"body": "Fiskebolla lengter etter havet\n\nHavet er fiskebollas hjem\n\nDette var det første verset\n\nNå er det bare 28 igjen\n", "score": 1},{"body": "Take er for a rip", "score": 1},{"body": "I thought Americans hate French", "score": 1},{"body": "No we don't &gt;_&gt;", "score": 1},{"body": "I believe without paint it's just called an ing ", "score": 1},{"body": "That is adorable.", "score": 1},{"body": "Rob Schneider?", "score": 1},{"body": "DAE QUEEN?", "score": 1},{"body": "I want to see your family and the Western picture family dual it out on \"Double Dare\"......God, I miss that show.\n\nOther family in case anyone is wandering:\nhttp://www.reddit.com/r/pics/comments/2rt627/as_teenagers_on_our_first_date_we_took_an_olde/", "score": 1},{"body": "How could we forget when someone posts this exact same thing every week", "score": 1},{"body": "Now comes the golden question for me, now that I know that you took the photo, did you seek to have a deeper meaning or did it just for giggles.\nI like it but honestly this photo will be cooler for me if you just did it for fun.\nPersonally i would have replaced the primers, but that's because I prefer to do as much as I can in camera because I lack the patience for photoshop, though honestly I wouldn't have thought to do that if I wasn't reloading bullets at the time the inspiration hit me.\nI will show your photo to my Uncle, he enjoys both photography and shooting so he may get a kick out of it.\nWhat are the casings to fit the crayons?", "score": 1},{"body": "It's okay to call them fat folds, dad.", "score": 1},{"body": "As a man with a normally cynical outlook on other peoples happines, I actually enjoyed this picture...damn it.", "score": 1},{"body": "The best thing about -40 is that I keep getting colder and they stay the same temp. ", "score": 1},{"body": "Oh yes, you're right of course. I was one of the first questions, so until I finished all 25 I forgot the original phrasing, thanks for the correction!", "score": 1},{"body": "Try not to suck any dicks in the parking lot!", "score": 1},{"body": "&gt;Must of\n\nFtfy", "score": 1},{"body": "Cuff 'em, Lou", "score": 1},{"body": "wow, that first picture is pretty impressive, if you were wearing different pants then i would be surprised if the average person would be able to tell this is a more modern photo.", "score": 1},{"body": "I didn't come here for feels :(", "score": 1},{"body": "Radical hate preacher, Mr anjem chowder ALSO wants THIS picture to be removed from the Internet.", "score": 1},{"body": "&gt;*Men get more \"distinguished\". Read: \"Character\". Read: \"Uglier in a way that somehow comes off as attractive\".*\n\nRead: \"Wealthier\".", "score": 1},{"body": "Geez, I wonder how many questions they had on HIS test (OP said he missed 5 the first time). My mom took the test when I was 17 and I helped her study for it. I created over 150 damn flash-cards and made her study with me for a total of 30+ hours in the span of 2ish months and when she came back she told me that they just asked her ONE question (Who is the president of the US) and then they asked her to write out a paragraph that was dictated to her in English. ", "score": 1},{"body": "I have an Austin Powers bobble head on my desk. My middle school students think it's Justin Bieber. ", "score": 1},{"body": "I hate how digital cameras have totally replaced the traditional film cameras these studios once used.  I mean, I don't know what the older technology they were using was, I'm sure it wasn't an *actual* 1800's method, but when I look at older photos like yours compared to the news ones, they just look so much better!\n\nI was in Gatlinburg a few years ago and asked every old west photo studio I found if they still did film and not a single one did.  Makes sense cost-wise, but the quality feels so much worse because it just looks like a digital photo.", "score": 1},{"body": "Beautiful family bud!", "score": 1},{"body": "I find your lack of authority disturbing", "score": 1},{"body": "Leave.  That's what I would do.  I've been to Paris four times in my life, and I can't think of a nation or city that I detest more.  London is infinitely better, imo.", "score": 1},{"body": "Which part of LA are you in? Clearly north of I-10. It was cold as fuck down here in the 337 today.", "score": 1},{"body": "\"Whose hand is on my ass!\"\n\n\n\"How the hell are *we* supposed to know?\"", "score": 1},{"body": "Fair enough, apparently I have no idea how old people are. I am 35, now I am wondering if I look like that.\n\nhttp://imgur.com/mnG21tN", "score": 1},{"body": "This post absolutely made my day. ", "score": 1},{"body": "OP is also using the same base pic for Muhammad, that's kinda lazy.", "score": 1},{"body": "Well you wouldn't find them in America considering it's only like, what, 300 years old? ", "score": 1},{"body": "A typical situation might go as follows: You go in, find a girl you like and tell the staff. They set up the meeting in a private booth and the girl has a 10 minute timer. You tell them what you want and how much you are willing to pay, negotiate the price and if an agreement is reached you leave together. I say leave together but you go outside and wait nearby, they will come out and join you a few minutes later for the sake of a tiny bit of discretion.", "score": 1},{"body": "I'm Canadian, I could pass it with flying colors and wouldn't even need to study. It's often a language barrier or borderline mental retardation. ", "score": 1},{"body": "The bottle of Jack Daniels has been replaced by two children, connection?", "score": 1},{"body": "Wisconsin reporting in, no sign of her.", "score": 1},{"body": "Dude that makes me cringe so hard. The feeling of slightly *touching* your eye hurts let alone taking a hockey stick. Holy ass. \r\rWhat exactly happened as soon as you got hit?", "score": 1},{"body": "Homeless people", "score": 1},{"body": "I live in one of those states, and I support gay marriage. Way to be an asshole. ", "score": 1},{"body": "I'm like 89 and it's now past my bedtime. ", "score": 1},{"body": "http://imgur.com/ndcubHw\n\nhttp://imgur.com/njDWLgf,zlz3u9h\n\nhttp://imgur.com/njDWLgf,zlz3u9h#1\n\nMor pictures of Grey!!!!!", "score": 1},{"body": "I think you replied at the wrong part, but good point. That is probably why it's 9/5, not 1.8, that is taught. ", "score": 1},{"body": "Looks to me like he turned into a clean shaven silent bob in the second picture.", "score": 1},{"body": "Your a lucky man, she's still thin and you still have your hair😡", "score": 1},{"body": "Can confirm. Went to a sperm bank once and those kids definitely look like me.", "score": 1},{"body": "What doughnuts?", "score": 1},{"body": "Florida here, nothing sighted yet.", "score": 1},{"body": "Recipe ain't right unless you make it right! ", "score": 1},{"body": "Poohammad", "score": 1},{"body": "Came here to confirm it is a shitty lumina. Interior looked so familiar, my head gasket indeed went bad and I scrapped it", "score": 1},{"body": "Good point, I do admit that on a number of occasions I wasn't 100% certain and just ruled the wrong ones out.", "score": 1},{"body": "27. still shitty but at least i got out of the office job rat race. avoid if at all possible.", "score": 1},{"body": "That's it... I may be in my 30's but my next date is going to be at Clifton Hill!", "score": 1},{"body": "You should see how much it's shrunk their penises!", "score": 1},{"body": "winter bags have hoods - when it's really cold and you cinch it tight, most of your head is \"in\" the hood, with pretty much just your nose sticking out.", "score": 1},{"body": "I'm willing to bet your wife's name is Rosemary.", "score": 1},{"body": "No, but I asked yours ;)", "score": 1},{"body": "You should post more photos. All of them. Also if you haven't already, put out things that smell like you/things she is familiar with. I wish you the best of luck, I can't imagine the feeling. ", "score": 1},{"body": "You're right.  [This isn't what you ordered, or what you got.](http://www.reddit.com/r/funny/comments/1qqrst/3_make_her_open_the_boxfrom_mcdonalds/)", "score": 1},{"body": "when im an old wrinkled grandpa in a hospital bed i'm gonna be like \"bring me a fuckin chicken!\" and i'm gonna make my kids and grand kids sit around and watch gumpa eat the whole goddamn thing [like this](http://29.media.tumblr.com/tumblr_lr4kh4y2yy1r2e6r6o1_500.gif)", "score": 1},{"body": "With a username like yours, it makes me think you could be Newfie. Are you?", "score": 1},{"body": "It's really not that difficult if you're smart about money. And even if you're not, you can take a budget airline for 30eur from London to Pisa, no problem.", "score": 1},{"body": "TIL /u/heactuallydoes speaks for the entire United States of America ", "score": 1},{"body": "Big hugs to you &amp; Chester...  I hope I can be as brave for my Lex dog as you are being when the time comes.", "score": 1},{"body": "I just figured out how. I posted 3 imgur links", "score": 1},{"body": "On the other hand, some Chinese parents spoil the hell out of their child, which makes the child act like a complete asshole. ", "score": 1},{"body": "Hows Ur Karma?", "score": 1},{"body": "I dont wanna be one of those people but im 19 and have seen both! I saw a dude impersonating silent bob last week and it made me so happy. ", "score": 1},{"body": "That's so sweet. Where do you live around? I know that most shelters in L.A. are full of herding/bully dogs like that one. The ones in the south are always full of all kinds of mixes, and up in New York is a massive rescue that always has rescue puppies of all breeds that they bring up from the south. The place I adopted my dog from had a few dogs that looked a bit like that if I remember correctly. Just keep looking, the right dog will come.", "score": 1},{"body": "I have this too. And for some reason, on my right foot(and not on my left) I can move that toe independently of all the other ones. Apparently it's weird to be able to do that ", "score": 1},{"body": "I bet nobody reads whats on the bottles :P", "score": 1},{"body": "Glad you stuck it out with the acronyming.", "score": 1},{"body": "I'm also in Wisconsin, haven't seen anything yet.", "score": 1},{"body": "Oh wow..I am haunted by that toe in the second photo.\n\nIt is so long. \n\nLong....like 20 years of love.", "score": 1},{"body": "trolollllol", "score": 1},{"body": "Seventeen here. Seen both and they are classics in my opinion.  . ", "score": 1},{"body": "If the previous owner was a smoker, lock an ozone generator in there overnight, then try some of the more stubborn stains again and revel in the freshness.", "score": 1},{"body": "Exactly.\n\n\"\"Luxenberg tries to show that many obscurities of the Koran disappear if we read certain words as being Syriac and not Arabic. We cannot go into the technical details of his methodology but it allows Luxenberg, to the probable horror of all Muslim males dreaming of sexual bliss in the Muslim hereafter, to conjure away the wide-eyed houris promised to the faithful in suras XLIV.54; LII.20, LV.72, and LVI.22. Luxenberg 's new analysis, leaning on the Hymns of Ephrem the Syrian, yields \"white raisins\" of \"crystal clarity\" rather than doe-eyed, and ever willing virgins—the houris. Luxenberg claims that the context makes it clear that it is food and drink that is being offered, and not unsullied maidens or houris.\"[12]\n\nIn 2003, the Pakistani government banned a 2003 issue of Newsweek's international edition discussing Luxenberg's thesis on grounds that it was offensive to Islam.[13]\n\nMuslim sources have accused Luxenberg of participating in an \"discursive assault on Islam,\"[14] but he has also been called an enabler of interfaith dialogue;[4] a \"dilettante\";[8] and the writer of \"probably the most important book ever written on the Koran\" by Ibn Warraq, an also unknown anonymous writer.[15]\"\n\n\nhttp://en.m.wikipedia.org/wiki/Christoph_Luxenberg\n", "score": 1},{"body": "Bruce Willis look a like he like a to take a da bus-a..", "score": 1},{"body": "Correct. And defending their freedom from what exactly?", "score": 1},{"body": "I almost cried when I saw these pictures.  I think I'm getting my period.  ", "score": 1},{"body": "Wtf? Why should people start having kids instantly ? Fuck I'm turning 30 and my GF is 24 but I may as well be turning 20 and I can't see myself having kids for feckin yeeeeeears. ", "score": 1},{"body": "Nope, he just has a kid so he needs to keep positive hoping a nice world will be here for the next generation.\n\nThings are going to shit, they're only going to get worse", "score": 1},{"body": "May pigs blood be upon him", "score": 1},{"body": "now now! not so soon, this post for earlier says [otherwise] (http://i.imgur.com/Pb3wfLI.jpg)", "score": 1},{"body": "Discovered by the Germans in 1904, they named it San Diego, which, of course, in German means 'a whale's vagina.'", "score": 1},{"body": "They are both great photos but I like the old time camera look of the first one. You can tell on the second one it is probably just a digital camera with a sepia tone filter. ", "score": 1},{"body": "We can't even be certain of that. Artificial insemination and all... All we know is that some guy somewhere nutted a little bit.", "score": 1},{"body": "/r/nocontext", "score": 1},{"body": "That would be one of the most beautiful drives you could take though. \n\nStraight up the entire rocky mountain range.", "score": 1},{"body": "your wife is pretty hot.", "score": 1},{"body": "France is a real homie, we gotta never forget that.", "score": 1},{"body": "Is the quiet refreshing?", "score": 1},{"body": "Explains the facial expression...", "score": 1},{"body": "I guess the people of /r/Dallas would. They threw fits until a new subreddit was created, just for pet-related posts, but *especially* lost pet posts! Some people just have no compassion. ", "score": 1},{"body": "I just figured out how. I posted 3 imgur links. ", "score": 1},{"body": "I would add though, that isn't really explained that much in the anime. Well it might have been, I can't really remember with all of the mindfuck.", "score": 1},{"body": "Stop breaking my heart you fucking monster!", "score": 1},{"body": "You must be a girl. All I can think when I see this is that he must have paid over $200 on this date. ", "score": 1},{"body": "LOL I love how you can't even deny you're a neckbeard with no life. And yes you were trying to sound intellectual by trying to come off as someone with a PhD in psychology..and yes even PhDs can use the word \"dumbfuck\" can you actually be *that* stupid? And the \"HAHAHA\"s at the end pretty much reveals that you're insane. ", "score": 1},{"body": "The problem is getting to Europe in the first place.", "score": 1},{"body": "The seriousness of that comic is /r/cringe worthy.", "score": 1},{"body": "Its always been.", "score": 1},{"body": "cheesey shit, and americans making this tragedy about themselves basically sums up reddit the past few days.", "score": 1},{"body": "When I was five i went to pick out a puppy with my parents. It was a black lab, I named her Molly. She died at age 11 after living a full happy life. I'm 23 now, and your post made me cry like a baby. I loved my molly. \n\nIts hard now. When molly was 8 we got Moose (a brown lab) as a puppy. And now he's not doing so well. He made it to 'dog Christmas' (thanskgiving; he's fanatical about his turkey), but i don't think he is going to make it much long. Its so sad to say goodbye to your friends. I don't even know why i'm typing all this. I think your comment just reminded me of how moose is now. And how much i'll miss him. \n\nGod damn these onions....", "score": 1},{"body": "He drew the hands differently, but yeah, it's nearly identical. I don't mind, though.", "score": 1},{"body": "I'm currently in a white collar Monday through Friday office job. My souls is dying, how do I get out?", "score": 1},{"body": "I wish I could help from Canada. If you haven't already, put out things that smell like you/things she is familiar with. I wish you the best of luck, I can't imagine the feeling. I'll be thinking about you guys. ", "score": 1},{"body": "I'm a Canuck who lives in the UK and I have lost track of how many times someone asks if I know so-and-so from Saskatoon or Cold Lake.\n\nNo. I don't know Dave and Trish in Cold Lake. I lived in Princeton BC.", "score": 1},{"body": "Is there a series of these?! :D", "score": 1},{"body": "Indy", "score": 1},{"body": "You guys are so god damn cute! :D", "score": 1},{"body": "Not that I know of. I don't live there. ", "score": 1},{"body": "For fuck sake is your wife even aging?", "score": 1},{"body": "What is with all the shitposts lately? This, some guy trying to find his dog, some guy's grandpa. Get it together people!", "score": 1},{"body": "I work at the store level and I will second this. There have been many times when the driver and I had to clean up a fallen poorly stacked pallet. So yes OP, a well stacked pallet is much appreciated.", "score": 1},{"body": "That second photo looks like parenting done right! &lt;applause&gt;", "score": 1},{"body": "how big is the ship, is it a dry cargo vessel?", "score": 1},{"body": "Not sure if your styles got better with age or if the photo quality improved...maybe both.", "score": 1},{"body": "Its kind of sad.. But she asked us not to take care of anything like that because she recently sold her house to the Catholic School right next door to be demolished when she passes. ", "score": 1},{"body": "Channel islands here, Hasnt swam over hear either.", "score": 1},{"body": "Google it and could not find. Source? ", "score": 1},{"body": "I did this for my cat as a kid in hopes it would work.  I heard someone had picked him up and dumped him.  I had figured they may have dumped him at a local store so I asked around.  A clerk at 7-11 said there was a cat that had been hanging around matching his description.  I rubbed various spots around the store and in low areas along the path home.  Within 2 days, he was home.  2 weeks had passed and he was cleary not eating well.  I had never seen him do this prior, but he was licking a trail of ants as I was preparing him food.  Poor little guy.  Mr. Kitty and I were very good friends because we respected each other.  ", "score": 1},{"body": "Do you ever sleep? I see you everywhere.", "score": 1},{"body": "Not a fake: [Nixon actually swore Elvis in as an \"honorary\" DEA agent](http://www.smithsonianmag.com/history/when-elvis-met-nixon-69892425/?no-ist). This photo is from that event.", "score": 1},{"body": "Good idea!", "score": 1},{"body": "Not if you have a BRZ!", "score": 1},{"body": "You're currently at +300.. don't you feel silly now?", "score": 1},{"body": "First phrase out of my journalism 101 prof.\n\nActually, the first 3 phrases, because he repeated himself twice for emphasis.", "score": 1},{"body": "Me too actually.. I just noticed that as well", "score": 1},{"body": "Dude, this shit is gold! CONGRATS! ", "score": 1},{"body": "Thank god that's photo shop", "score": 1},{"body": "Fixed it, thanks for the giggle ", "score": 1},{"body": "I wasn't there for my dog when she was put to sleep. We grew up together. We got into so much trouble. There was a bond between us that couldn't be matched by anyone else in the family. But at the end... I was unknowingly dealing with depression at the time. I couldn't think straight. Greatest regret of my life.\n\nYour dog has felt loved, and I can't tell you how good a thing that is.\n\nIt will be painful, but don't regret a thing. You will be there for him. Just as he's been there for you.", "score": 1},{"body": "&gt; Dude was definitely at chub, fighting hard not to go full tilt\n\nJust look at the face", "score": 1},{"body": "9/10 with rice.\n\nThank you for your suggestion.", "score": 1},{"body": "Do you ever miss the hair?", "score": 1},{"body": "Really, I'm 19 and this has been the best year of my life. now dedicating all my time pursuing something I love instead of having to do homework for things that don't interest me. Maybe you should try to find something you are passionate about?", "score": 1},{"body": "Until shedding time comes around.  Grocery bags full!", "score": 1},{"body": "/r/Pic is a thousand better than /r/pics. ", "score": 1},{"body": "can anyone tell me what kind of dog is the black and white one in the lower right corner?", "score": 1},{"body": "Maybe you were subconsciously being drawn to something else when you took this picture.\n\nWhere is this, out of curiosity ", "score": 1},{"body": "Uhm.. No, no you don't. ", "score": 1},{"body": "dammit, this. :( now I'm sad.", "score": 1},{"body": "well you clearly saw Dogma twice..", "score": 1},{"body": "Ehh Clerks 2 was a good deal better", "score": 1},{"body": "You better fucking stay by his side 'til the very end.", "score": 1},{"body": "I made it, and there are more.\n\nhttp://imgur.com/a/VpWjk\n\n", "score": 1},{"body": "ouch those feels ;'( godspeed Chester.", "score": 1},{"body": "Not just dogs either.  15 years on and I still miss my kitty.  I think I always will.\n\nI know it's cliche but even though it might never stop hurting it will hurt less..", "score": 1},{"body": "The picture shows she doesn't wear any type of identification.  Such a shame. So easy to get a dog tag. ", "score": 1},{"body": "https://www.youtube.com/watch?v=n1Ijb0Ndw-g", "score": 1},{"body": "I don't know if anyone has mentioned it yet but you should check your local shelters too.", "score": 1},{"body": "It's like spootnik!", "score": 1},{"body": "I have 2 shih tzus, 10 years each (brothers), its gonna be really hard when any of them goes :( my lil lovable ewoks", "score": 1},{"body": "I think about this kid a lot. It makes me happy that there's people who sacrifice themselves for others. If there is an afterlife, I wish I can meet this kid and shake his hand. ", "score": 1},{"body": "What's her phone number", "score": 1},{"body": "iraq had nothing to do with 9/11 thats why....", "score": 1},{"body": "To be fair I would say it was America that was the real homie in this situation and France was not forgetting it.", "score": 1},{"body": "We need to get his parents back together.", "score": 1},{"body": "&gt; Sulfuric acid depresses the freezing point of water just like salt does, except in this case much more extreme.\n\nSo you're saying next time my driveway is iced over, I should pour sulfuric acid on it instead of salt?", "score": 1},{"body": "He doesn't accept Yeezus as his lord and savior. ", "score": 1},{"body": "Yup haha.", "score": 1},{"body": "This will be an underappreciated comment", "score": 1},{"body": "No and then!", "score": 1},{"body": "Also, you have no idea how much they had to give up after they had you.", "score": 1},{"body": "I mean...it doesn't really stick out with all that other stuff on your porch. Still wrong of them but I think it would've been okay. ", "score": 1},{"body": "Hotter", "score": 1},{"body": "It's okay bud.", "score": 1},{"body": "Forget the great tits, what is that yellowish donut front left.?", "score": 1},{"body": "Mine? Untreatable cancer, they couldn't do anything and she was in a lot of pain ", "score": 1},{"body": "Because you are a good person who loves thier pet.\n\nNo shame man, no shame.", "score": 1},{"body": "**It's all free speech, or none of it is.**", "score": 1},{"body": "I don't think **you** have seen Austin powers.\n\n", "score": 1},{"body": "Because they can't tell us they don't want to feel the pain any more. And they can't talk to us about it. And we can't tell them why it hurts and that it's gonna stop eventually.", "score": 1},{"body": "And why not", "score": 1},{"body": "This was my first car, a 99' Lumina. Water pump failed, head gasket failed, total piece of shit. Cost more to fix than I would have spent on leasing a new car over the time that I drove the Lumina", "score": 1},{"body": "No way chief, these guys are professional dog snatchers there's no tell what they'll do.", "score": 1},{"body": "Dude!! She's like a solid 9 bro! And you're like, well, a SOLID 6 bro, just solid. But 6's and 9's are not suppose to go on dates as teenagers dude, I know, that you know, that we all know this. But duuuude being able to manage taking her out on a second date twenty years later when she's still a solid 9 and you, no offence, dropped to a 5. (I dig'd the shag) you my friend, have got some serious skill with the ladies. ", "score": 1},{"body": "Layers. The day can feel deceptively okay but once the sun goes down you will want more to put on. Extra travel time in the snow. Winterize your windows and choose good insulation for your home to keep bills down.", "score": 1},{"body": "I took a severe cut in pay to do manual labor while I studied something else that didn't involve sitting at a desk for 9 hours a day. I also had help from family.\n\nI have no idea what will work for you.", "score": 1},{"body": "wow.  This is such an approriate post for me to see.  I just now finished watching Deadwood.  Fit the mindset.  Thanks.  \n", "score": 1},{"body": "He said he lived in Britain", "score": 1},{"body": "i heard he's into model train sets , mad!!", "score": 1},{"body": "I am sorry for your loss, but happy you had that kind of love at the same time.", "score": 1},{"body": "It happens...  Not all people want to watch something like that. I remember when my dog got put down I was too young to handle that. I remember having a super emotional family moment very vividly. \n\nIt was sort of a sudden thing with my first dog. He was a beagle mix and apparently they usually have heart problems. One morning just woke up, not moving but still breathing, my dad took him to the vet and I guess made the decision for us. I don't hold it against him and I know my dog had a great life even if I wasn't there for the last 12 hours. ", "score": 1},{"body": "I couldn't imagine playing without a visor. Even a cage, as pansy as it sounds. ", "score": 1},{"body": "Or you could be creative and design something for yourself...then give that design to a jeweler.", "score": 1},{"body": "If I had the money, I'd give you gold... Thank you very much! Hail Caesar!", "score": 1},{"body": "next time add a '/s' at the end of any sarcastic sentences, it helps avoid confusion.", "score": 1},{"body": "I work outside and while its not something that I do there are other guys who wear ski or snowboard goggles all day to keep their faces covered.", "score": 1},{"body": "Haha Lol.", "score": 1},{"body": "It seems you both have eaten each other well.", "score": 1},{"body": "If somehow, these pictures are the only ones that survive, whoever is around at that time is going to think that we were a lot less civilized in 2015 than we really were. ", "score": 1},{"body": "&gt;&gt; something happens in the bathroom\n\n:-O", "score": 1},{"body": "Phone calls are tough for them. ", "score": 1},{"body": "Please make a subreddit, OP.", "score": 1},{"body": "Whoa, that's a paddlin'", "score": 1},{"body": "The cold never bothered you anyway...", "score": 1},{"body": "Folex, an extractor, and time. ", "score": 1},{"body": "Yes.... how did you know haha.", "score": 1},{"body": "The one on the left.", "score": 1},{"body": "I listened to a great sound painting on the radio today! ", "score": 1},{"body": "Something people don't really think of is local pizza places, I've returned five stray dogs to their owners so far while on deliveries! Two of the dogs were the same owner and they escaped together.", "score": 1},{"body": "Has anybody apologized to you since then, now that everybody accepts it was a bad idea?", "score": 1},{"body": "http://i.imgur.com/R1VSJtJ.gif", "score": 1},{"body": "fuck not with", "score": 1},{"body": "☐ Not REKT ☑ REKT", "score": 1},{"body": "That makes one of us. I love my job. I can't believe I get paid to do it sometimes. \n\nJust gotta find something you love.", "score": 1},{"body": "There is no typo.  The \"error\" (I put in quotes because it seems to be deliberate) is in what was written.", "score": 1},{"body": "ha! :)", "score": 1},{"body": "Yup. Also put a note with your contact information. Did this a couple months back and got a call the day after she went missing.", "score": 1},{"body": "Probably not without studying. I did know the answers to maybe 17 questions without looking at the choices, on 6 occasions I was eliminating the wrong answers and on 2 I was just plain wrong. So without answers provided I would have had 17/25 (maybe 18, I usually had at least a vague idea and might have replied correctly to another one). Given that the ratio would be the same it would be 68/100 on the total pool of questions. That's is still above the 60% (based on 10 questions) required to achieve, but just barely so.", "score": 1},{"body": "I'm sure the satirists would have hated that post.", "score": 1},{"body": "No offense to OP, but this is why at age 28, and a male, I watch what I eat REGLIGIOUSLY and have (luckily) managed to maintain my age-17 weight. I hope it lasts over the \"30 hump\". \n\n", "score": 1},{"body": "I was completely confused for a bit.  I assumed you meant one of those old time banking visors (http://3.bp.blogspot.com/-cRx9aCWbZIc/UYLDrisK35I/AAAAAAAAFC8/EtFuqMrQVLc/s1600/Bank+Clerk.jpg) so I was looking all over your face for sunburn and anything I could think of.  I completely missed the fact that you have become David Bowie.", "score": 1},{"body": "Oh shit, I've been there. You should see if they have my copy of Cat's Cradle, I left it in the changing room and didn't realize until I was in Vancouver.", "score": 1},{"body": "I'm 18. I just saw clerks a week or two ago because my brother forced me to. When I told him I hadn't seen it, he seemed pretty distraught. Awesome movie. Def gonna show my kids someday. The porchmonkey part was my favorite", "score": 1},{"body": "I remember that [game...](http://www.newgrounds.com/portal/view/462774)", "score": 1},{"body": "So are we gonna heat this cootch chili or what?", "score": 1},{"body": "Hoarfrost. It gets foggy or even just humid outside and the mpisture in the cold air condenses when it meets your warmth.", "score": 1},{"body": "Photoshop battle?", "score": 1},{"body": "Tell me more?", "score": 1},{"body": "Check out clerks it's a dope movie", "score": 1},{"body": "There, now everyone will get off your back. Good luck finding your dog!", "score": 1},{"body": "Was expecting him to be holding a gun to his own head.", "score": 1},{"body": "Loool. Knew I'd see this kind of comment", "score": 1},{"body": "Spring Texas Lost and found pets", "score": 1},{"body": "My childhood dog took a drastic turn for the worse when I was in high school. She went from being the her usual loveable, lazy Beagle self, to a shell of herself overnight. She had a stroke and was going into renal failure and he said it was wise to end her life. It was a rough decision, but my parents decided we had to. On the day we went to put her down,  my mom told me to give her one of her last pig's ears, which she LOVED. A dog that would not eat, took it from my hand, went to the door and asked to be let out. She walked to our driveway, plopped down and slowly ate away at it. She looked so content in the sun, doing what she loved, eating and laying down. I broke down crying, but at the same time was happy that the dog I grew up with was somewhere in there. ", "score": 1},{"body": "A friend of mine has a SO that actually helped make that. He works in practical effects for television and film. Most of the time his job is to make toast look like its burnt, but sometimes he gets to do cool stuff like this!", "score": 1},{"body": "I made the same comment about a month ago, unfortunately it wasn't in a subreddit with thousands of upvotes. This fucker with this \"fun fact\" got 4284 points and reddit gold. I posted in r/anormaldayinrussia and i got 2 points. ", "score": 1},{"body": "Makes me so sad to hear this, I've been in your position...it was so hard. Chester is a doll. Stay in the moment.", "score": 1},{"body": "10/10 would put breasts in mouth.", "score": 1},{"body": "Ironcly, I think that having a creative occupation, is probably among the most stifling.  Unless you are a demigod like Waterson or Larson, you have very little control over your work.  And by the time they earned it, they were nearly burnt out.  ", "score": 1},{"body": "Oh, alright. Makes more sense then - traveling across the USA is doable on a budget, same as going around Europe.", "score": 1},{"body": "Bill... Strange things are afoot at the CircleK.\nhttp://youtu.be/veaJCc0Z41w\n\nThis is so cool!", "score": 1},{"body": "wow..perfect first date!", "score": 1},{"body": "Most likely - that was my question No. 2 and I didn't really try memorizing the name.", "score": 1},{"body": "/r/Pic is way better than this shithole Randy", "score": 1},{"body": "The oldest wooden house in Europe is 700 years old. Again,  I dont think there are any wooden houses that are \"thousands of years old.\"  Unless you are counting one that was excavated during an archaeological dig.  Which wouldn't count because you said \"houses can STAND for thousands of years if kept up.\"", "score": 1},{"body": "I suspect some of the patrons use these cafes for that exact reason. I've seen a huge range of girls at these places and some of them were a solid 9. You can stay there as long as you want and the girls are just doing 'normal' things like watching tv, using their phone, eating/drinking or reading something.\n\nSome of these places get really busy, where every seat for both men and women are taken. I wasn't able to take pictures of the full ones in fear of getting caught.", "score": 1},{"body": "Reading this thread makes me more emotional than if it were about people. I can't be the only one.", "score": 1},{"body": "Was this taken at a photography studio in WEM by any chance?", "score": 1},{"body": "Burmans is from Aldis. Never heard of it before either.", "score": 1},{"body": "I live in Portland as a software developer...I'm feeling fancy if I don't have a hoodie on at work.", "score": 1},{"body": "I'd love to buy your grandfather w beer! That is look of an accomplished person! ", "score": 1},{"body": "We need to stop having friends. First Canada. Not France.", "score": 1},{"body": "Good boy, Chester! Who's a good boy? YOU! Chester is a good boy! Good boy!\n\n(because hey, it's usually not what you say that matters anyway. it's just the cheeseball-overselling-it-just-like-a-dog-would-for-you way you say it. so tell him he did a good job. it's all i want to hear before i go.)", "score": 1},{"body": "I watched it again a week or so ago. Still holds up. ", "score": 1},{"body": "If it doesn't have any paint, how can it be a painting? How can it be a painting if it doesn't have any paint?? ", "score": 1},{"body": "Unfortunately Texas is huge. I'm in Texas but probably 8 or so hours away. So, that wouldn't help much. But /r/houston would probably be helpful!", "score": 1},{"body": "20 years married this fall.  27 together.  Picture was actually in 2010, we'be been meaning to get another taken.\n", "score": 1},{"body": "What is this fucking shite m8? ", "score": 1},{"body": "Yeah, she's an attractive woman, but she looks her age to me. Almost all my friends are in their mid to late 30s, and she'd fit right in with us.", "score": 1},{"body": "He looks so sweet. Congrats!", "score": 1},{"body": "I'm trying. I just got back from a year in rehab so trying to make friends is even a challenge much less finding a passion. If I'm not social I get depressed and am not productive", "score": 1},{"body": "Yeah your porch is kinda trashy....so if I was walking by I would just think its an empty box you left out with the other trash on your porch that you are to lazy to pick up", "score": 1},{"body": "What would you suggest for a hundred?", "score": 1},{"body": "You have a beautiful family!....Not trying to be too bold but your wife is beautiful. Great catch!", "score": 1},{"body": "He just must've thought your were perchance laid back for numerous reasons lying about. ", "score": 1},{"body": "Most dogs don't know when its time. We tell them to stay... sometimes we need to tell them to go..", "score": 1},{"body": "/r/autodetailing lives for this stuff", "score": 1},{"body": "Error? Everything seems correct to me.", "score": 1},{"body": "I have some alarming news about Monty Python and Jethro Tull for you.", "score": 1},{"body": "Congratulations to your ecuatomarciano grandad teehee", "score": 1},{"body": "Baffin makes some that are good to (-100°C)[http://www.baffin.com/polarseries-s/4.htm]", "score": 1},{"body": "2, put your junk in that box", "score": 1},{"body": "And the guys who shot those cartoonists had nothing to do with 9/11 either, dumbass.  That's not the point.  The point is Islamic extremism.\n", "score": 1},{"body": "Except mystery lotion! ", "score": 1},{"body": "Tom Petty to Tom Arnold in 20 years..", "score": 1},{"body": "-27°C is nothing when you've experienced -50°C", "score": 1},{"body": "Damn", "score": 1},{"body": "It does eventually hurt less, you're right. And rescuing another helps too, I know thats what mine would have wanted because she was a rescue also. you can never replace them but you can make room in your heart for another ", "score": 1},{"body": "After OP steps off Bruce slides the window open and stares OP right in the face......\n\n*Yippee ki yay, mother fucker!*", "score": 1},{"body": "Ugh! Can you see ok?", "score": 1},{"body": "I just thought there would be an uneven number to avoid a standoff, and assumed it's more than ten for a large enough diversification. Oh well.", "score": 1},{"body": "I'm sure your pup would forgive you.  They're good at that.", "score": 1},{"body": "I sleep half a brain at a time so I can keep redditing even with half a brain.\n\n/r/chimichangas", "score": 1},{"body": "Surely you're not Ryan Gosling.", "score": 1},{"body": "Hey OP I can't read your address, but maybe Jack Bauer can.", "score": 1},{"body": "I would be more concerned with how messed up that box is. Its been beaten more than a mike Tyson girl friend. ", "score": 1},{"body": "Does your left eye work better in the dark?", "score": 1},{"body": "Why would I need to deny a retarded accusation from a complete fuck head lol. Seriously you can add arrogant fuck to the list too. ", "score": 1},{"body": "Won't you get hypothermia?", "score": 1},{"body": "One thing hasn't changed, Jack Daniels is still around. And that's a good thing.", "score": 1},{"body": "Honestly I would like to know also.  Was it the last one?  70 years still too soon??", "score": 1},{"body": "\"Here's a fiver and... and can you call me rooster cogburn during the shoot?\"\n\n\n\n\"You got it rooster.\"", "score": 1},{"body": "I always downvote then upvote because the number moves up twice and it makes me feel like I double upvoted.", "score": 1},{"body": "[drifting through the wind](https://www.youtube.com/watch?v=Qssvnjj5Moo)", "score": 1},{"body": "I had to put my 14 year old dog and best friend down this past New Year's day.  I still miss him like crazy and it's incredibly hard to do but you're doing the right thing.     \n     ", "score": 1},{"body": "Yep, I though twilling8 had a great idea, and I could share.", "score": 1},{"body": "Oh god, THANK YOU. I try to explain this all the time, but some journalists just don't get it.\n", "score": 1},{"body": "Oh yeah! Lots of times. They're super easy I've become quite the pro at the whole process too. ", "score": 1},{"body": "I know you already said somewhere else you found it in NW Portland, but [this](http://twistedsifter.com/2014/10/calvin-and-hobbes-street-art-in-portland/) website says it's at SE Salmon and 7th Ave across the river.\n", "score": 1},{"body": "TIL: people are still butthurt over the term \"freedom fries\".", "score": 1},{"body": "My dogs name is Grey too!", "score": 1},{"body": "But can you technically prove that a house could **not** stand for thousands of years if kept up with? ", "score": 1},{"body": "Can you see the infrared illuminators?     I recently put a cam by my 2yr Olds bed... despite being pitch black she kept staring and pointing at it.. I discovered the leds were slightly red", "score": 1},{"body": "Maybe if it takes you a *year* to finish the bottle. Anything that's almost pure sugar doesn't go bad for a very, very long time.", "score": 1},{"body": "You got fat", "score": 1},{"body": "10 blocks...so either tweakerville (Old Town) or rich snob land (Pearl District)...my money is on the Pearl?", "score": 1},{"body": "Where the fuck do you people live??? It's 60 outside right now where I am. ", "score": 1},{"body": "You went from Jay to Bob. ", "score": 1},{"body": "John Wayne to the rescue!", "score": 1},{"body": "Damn, schools here in MN close only for like -30 below", "score": 1},{"body": "Stick the Men's jr Hockey team in front with their gold medals perfect Canadian Moment.... just need some a Double Double from Timmy's.\n", "score": 1},{"body": "you got issues man. im impressed you can tell im an obese lazy slob from the 6 items you saw in my fridge. and im concerned that it bothers you enough to tell me to kill myself.", "score": 1},{"body": "You take the filter out too. The filter itself isn't brown, it's just the paper that surrounds the filter which is brown. Just use a cardboard filter and it'll still look like a cigarette.\n", "score": 1},{"body": "2deep4me", "score": 1},{"body": "he looks like he's had 84 years of love.....a good run", "score": 1},{"body": "We don't need to read what's on the bottle.", "score": 1},{"body": "skate key illuminati", "score": 1},{"body": "Freedom!", "score": 1},{"body": "Clerks2 was pretty crappy.", "score": 1},{"body": "Honestly, for me, it's not the black and white that is off-putting for me with old movies, but rather the dated acting and production methods. That being said, clerks has neither. It comes across like a college theater major's writing, but it's still hilarious. ", "score": 1},{"body": "Now did the photographer tell her to put her foot right next to your crotch or did she do that on her own?", "score": 1},{"body": "Get hit by a truck OP you fucking faggot.\n\nEnjoy those worthless upvotes in the meantime. ", "score": 1},{"body": "Looks mostly red heeler to me. Those are some good lookin' pups!", "score": 1},{"body": "Two and a half years ago I lost Ruby, the Old English Sheepdog I grew up with from age 10. She was 11 years old and she had cancer. Before that, she survived being run over and lived with a metal plate in her back half. She was such a good fucking dog. My parents had to put her down while I was living abroad and it fucking tore me apart. I didn't leave my apartment for two days. I'm bawling right now. Even all this time later, I still miss her so much.\n\nI know you likely won't get a chance to read this, but my heart hurts for you. Losing a pet is the most awful experience. Our other three dogs and two cats are very old and in various phases of declining health. I dread the day I have to face another goodbye. Chester is an absolutely adorable little guy. Aren't we so lucky to experience the love of a pet? ", "score": 1},{"body": "why bother sleeping when you could be karma whoring with shit comments, right?\n\nno no, don't bother, you've already linked me to your hater club", "score": 1},{"body": "Those articulating off road dump trucks. I was told at training that they're dangerous because you can't feel the bed tipping if it does, but no one mentioned the cab part tipping. What's the story, OP? ", "score": 1},{"body": "Might sound weird, but I love your wife's shoulders.  As a female with broad shoulders, I must give a nod to another broad shouldered sista.  She totally rocks them.", "score": 1},{"body": "A good day to ride hard.", "score": 1},{"body": "I want to foster, but I know I\"d be a foster \"failure\"  and there are days, honestly, where I have difficulty taking care of myself.\n\nI hate being responsible sometimes.", "score": 1},{"body": "I remember At The Drive-In", "score": 1},{"body": "You said you are husky and eat processed garbage. Am I wrong for believing you?", "score": 1},{"body": "Hate to be Captain Letdown, but nobody will know him in around 100  years. Kind of turns your perspective. \n\nHow many humans do you know from the 1900s? 1800s? 1700s? Every 100 years you know less and less people. Everyone you know now will be immensely insignificant in the next 200 years unless one of them discovers time travel or something fantastic enough to get into the history books. But, even then, memory of them would be prolonged by around 500 years, maybe more maybe less depending on the magnitude of their work. I digress.\n\nI really am sorry for OP's loss, and I wish him well. As a dog owner myself, I realize how upset OP probably is right now, but it irks me when the word immortal is thrown around, because nothing is immortal. \n\nSorry if I upset/offended anyone.", "score": 1},{"body": "Public defender.", "score": 1},{"body": "ADVENTURELAND!", "score": 1},{"body": "* Change desktop wallpaper to something not involving Mickey Mouse and pornography", "score": 1},{"body": "OP, pls try this tomorrow.", "score": 1},{"body": "Some of it's the bulky costumes, but I was heavy then then I am now.  Feel alot better.", "score": 1},{"body": "Ahh good old subtle advertising from a company from India....", "score": 1},{"body": "It's even easier there. It's also easy if you do a bunch of places in one trip. I knocked out four of his locations in three weeks when I went to Europe and I spent more on getting there and back than I did being there.", "score": 1},{"body": "Definitely not here in Pa. Didn't check outside but take my word for it. It's cold out there. No living thing would choose to run away in this weather.", "score": 1},{"body": "That's lovely :)", "score": 1},{"body": "That's not fair, we don't have giants.", "score": 1},{"body": "It definitely gives the optical illusion that the right eyeball is bigger. ", "score": 1},{"body": "ill take that bet. also you're just being a cynical asshole, because ID bet that you have these items in your kitchen as well. try to be nicer.", "score": 1},{"body": "The only way I would do this would be if the pool was heated, and the entrance to the pool was inside and you had to swim out, so that way when I had to get out I would swim back inside to emerge.", "score": 1},{"body": "Went to an IT job interview in a suit. One interviewer had a hawaiian t-shirt and flip flops, the other one was in a t-shirt and jeans, truly wizards.\n\nThe only professional was the girl, she had a suit but god damn, I could not focus. I just wanted to see her sweater puppies, those things were ridonkulously huge.", "score": 1},{"body": "Is your left eye more light sensitive now?", "score": 1},{"body": "Also are you saying because I used English words I was trying to sound like an intellectual? Seriously how fucking dumb are you? Keep digging that I'm a dumbshit hole.", "score": 1},{"body": "Did anyone else involuntarily shudder looking at these photos?  I mean, did she choose to play the \"hooker\"?  Or is that the only costume for women available?", "score": 1},{"body": "You look very kingly in the second picture.  http://upload.wikimedia.org/wikipedia/commons/0/07/Workshop_of_Hans_Holbein_the_Younger_-_Portrait_of_Henry_VIII_-_Google_Art_Project.jpg", "score": 1},{"body": "Two useless people! !", "score": 1},{"body": "I have to say, that was probably one of the most \"WTF is happening\" films I have ever seen.  ", "score": 1},{"body": "Is it just me or is a slim Kim Jong Un standing behind the lady to OP's left?", "score": 1},{"body": "I don't think ruthless beheadings of innocent people are comparable to eating land shrimps.", "score": 1},{"body": "and those are just the dudes.", "score": 1},{"body": "http://vimeo.com/92071732", "score": 1},{"body": "Has it's tennis ball toy too. Good dog.", "score": 1},{"body": "Nope, he's got eyes on most imminent threat; the person taking picture. Not trying to blend in, trying to make sure threat has to go through him to get to sheep. Dog is doing his job and doing it with calm, steely-eyed determination despite looking adorable. ", "score": 1},{"body": "Most of the thermostats in modern office buildings are placebos.  They pacify the masses.  ", "score": 1},{"body": "\"Marry someone richer than you, and then you will be richer too.\" - Me. ", "score": 1},{"body": "Those jeans were basically sweatpants. ", "score": 1},{"body": "To find out, look at any comment from a guy on a woman's \"became single\" Facebook status.", "score": 1},{"body": "until they run out of booze, then panic sets in. ", "score": 1},{"body": "BECAUSE ICE CREAM. IS A FEELING.", "score": 1},{"body": "Judging by your username, you'll need to get some custom made.", "score": 1},{"body": "How has this not been gilded? Here you go.", "score": 1},{"body": "That's a startup there already. ;)", "score": 1},{"body": "They are not dressed as some kind of pink french maids. They are dressed like little girls in doll like dresses. A lot of the fashion is doll like and cute.", "score": 1},{"body": "This is how I make up names for my dog. It's always gibberish, and has the same syllabic rhythm (not sure that's a term). Goodlebutt Spundercraft for example.", "score": 1},{"body": "Some tiny dude can lie in it and play the worlds tiniest violin, if he can get it away from my mum who plays it non-stop (it's funnier the more you play it I'm guessing). ", "score": 1},{"body": "Fucking let me in cunt", "score": 1},{"body": "/r/upvotedbecausegirl", "score": 1},{"body": "Thank you, I seem to be gathering downvotes for committing the sin of asking a genuine. Between you and Diabolico, it's been really cleared up, thanks :)", "score": 1},{"body": "The guy in the fleece looks like he is having a bad day.", "score": 1},{"body": "...because they are pests to us.", "score": 1},{"body": "I cri ery tme, but really I always feel nostalgic of the time when I grew up in Detroit.", "score": 1},{"body": "Well there's also the difference that in analytical NMR in a lab, you irradiate your sample with EM radiation at specific frequencies. In MRI you don't irradiate patients so which the nuclear part is still technically relevant (still aligning the spin state of nuclei using a magnetic field), you're not using radiation anymore.", "score": 1},{"body": "Space between ever and !", "score": 1},{"body": "Only works if you post it in a sub that allows memes", "score": 1},{"body": "Hummus is not generally eaten in India, it's middle eastern.\n\nMom's curry would have been better. ", "score": 1},{"body": "You should take her to disneyland.. the girl might generate enough karma for \"special purposes\"", "score": 1},{"body": "Think I'm in love, said every guy ITT, but me the mostest! ", "score": 1},{"body": "No gloves were worn in the making of this burger. ", "score": 1},{"body": "That's what the ghost would want you to think. It's literally the perfect crime.", "score": 1},{"body": "So much rich mahogany.  ", "score": 1},{"body": "Read that as pooping a blood vessel ", "score": 1},{"body": "Your (original) pug and I both agree that's the most horrific thing we've seen this year.", "score": 1},{"body": "http://en.wikipedia.org/wiki/Jaguar_warrior\n\n(via Age of Empires II)", "score": 1},{"body": "people really underestimate big magnets huh", "score": 1},{"body": "http://en.wikipedia.org/wiki/Nepomorpha\n\n", "score": 1},{"body": "of course not, we're stuck in front of a computer screen 18 hours a day instead of living, getting outside like 2 hours a day would probably give us more original thoughts than a lifetime of Reddit, just sayin'... (but it's cold out there... that I heard of)", "score": 1},{"body": "Jennifer Lawrence and Emma Watson in the same picture? Get ready for the Karma tidal wave.....", "score": 1},{"body": "No doubt... I'm currently living in Kaohsiung and they definitely do not dress like this. ", "score": 1},{"body": "Probably in pain because of the chlorine in the water :)", "score": 1},{"body": "In fact other cultures do this. An Irish friend of mine was given a plain-looking bracelet by her dad when she left home to go travelling. It was actually solid gold and was for her to use in an emergency.", "score": 1},{"body": "Shoutout to /r/picsoftinyasstrees!", "score": 1},{"body": "But... How?", "score": 1},{"body": "That's the new GE model... that's a 5-million dollar machine.", "score": 1},{"body": "He's probably trying to tell you that he isn't a hipster. Such a hipster thing to do. ", "score": 1},{"body": "Ugh I miss Boulder. I want to move back.", "score": 1},{"body": "Redditors. ", "score": 1},{"body": "I thought the ending was weak as shit. How did it cause everything to suddenly make sense? What reveal are you talking about? \n\n**SPOILERS BELOW**\n\nDo you mean the part where it was explained that old mate at the back of the train and Ed Harris were working together? That shit became fairly obvious pretty early in the film. Nearly as obvious as the fact that the children were being abducted to keep the train running somehow, which became apparent once you saw that guy's kid get taken. Those are the only 'reveals' I can think of, outside of the earth slowly beginning to thaw, which wasn't that interesting.\n\nDon't get me wrong, I still enjoyed the film, in the same way I enjoy other stylised but flawed action romps, but I don't think it's the cult classic that a lot of the film media is trying to spin it as. The fact that it's sitting at 95% on Rotten Tomatoes seems so completely absurd to me.  \n\nI genuinely think that the drama surrounding the film's stunted release due to Weinstein getting his panties in a knot did a lot to help the film's reception once it became more widely available. It's a decent action flick, but it's not the well-crafted classic so many outlets are selling it as.", "score": 1},{"body": "Judging by the kangaroo and mainly the manliness of those women hands, I'm guessing Australia ", "score": 1},{"body": "But who will take care of m'lady?", "score": 1},{"body": "Yup, the ending pretty much made the whole movie meaningless.", "score": 1},{"body": "I thought the ending was weak as shit. How did it cause everything to suddenly make sense? What reveal are you talking about? \n\n**SPOILERS BELOW**\n\nDo you mean the part where it was explained that old mate at the back of the train and Ed Harris were working together? That shit became fairly obvious pretty early in the film. Nearly as obvious as the fact that the children were being abducted to keep the train running somehow, which became apparent once you saw that guy's kid get taken. Those are the only 'reveals' I can think of, outside of the earth slowly beginning to thaw, which wasn't that interesting.\n\nDon't get me wrong, I still enjoyed the film, in the same way I enjoy other stylised action romps, but I don't think it's the cult classic that a lot of the film media is trying to spin it as. The fact that it's sitting at 95% on Rotten Tomatoes seems so completely absurd to me.  \n\nI genuinely think that the drama surrounding the film's stunted release due to Weinstein getting his panties in a knot did a lot to help the film's reception once it became more widely available. It's a decent action flick, but it's not the well-crafted instant classic so many outlets are selling it as.", "score": 1},{"body": "Unless it's your sisters wedding, your sister is the cohost of a podcast about hacking, and she happens to work with your Internet crush.. ", "score": 1},{"body": " But it's not like my wife doesn't do things to make me mad. ", "score": 1},{"body": "What kind of food do you leave for them?\n\nAnd are you able to touch them?\n\nThis whole fox thingy sounds interesting but they are wild animals. :(", "score": 1},{"body": "No they won't! This needs to be posted to /r/marijuanaenthusiasts!", "score": 1},{"body": "Its the 3rd one from the left. ", "score": 1},{"body": "Saw dumb and dumber 2 in this and fell asleep so quickly", "score": 1},{"body": "I feel like I'm supposed to avoid mentioning that OP is attractive and amusing but fuck it, I already started this comment. Well done, OP.\n\nHow's it feel to be a spirit animal?", "score": 1},{"body": "Post your pic to reddit, get a million marriage proposals in your inbox.", "score": 1},{"body": "Anybody else bothered by the mustard spot", "score": 1},{"body": "MURICA-tier cinema", "score": 1},{"body": "\"Not worth the trouble\" - Me", "score": 1},{"body": "ALRIGHT WE GET IT WITH THE FUCKING ALOE", "score": 1},{"body": "I don't think it's a good idea to own a roo... To care for a young or sick one is great. But they'll fuck your shit right up as soon as it's big enough. ", "score": 1},{"body": "Agent Hill? ", "score": 1},{"body": "Na man, that asian guy that was on the front page yesterday that was dressed up like Johnny Depp would star in it.", "score": 1},{"body": "This is something right out of a Douglas Coupland Novel. ", "score": 1},{"body": "I took this picture and posted it a year ago\n\nhttp://www.reddit.com/r/pics/comments/1uhte5/today_i_found_a_machine_that_makes_burritos/", "score": 1},{"body": "Que the rants about machine of death and imperialist America in 3,2,1... But seriously, it is a beautiful bird. I suppose we should thank the Germans for the idea. Thank you, Germans.", "score": 1},{"body": "Goddammit, tendorphin.", "score": 1},{"body": "Always two there are.  A master, and an apprentice.  ", "score": 1},{"body": "no its a repost ", "score": 1},{"body": "Well if it *was* Thailand they might be positive. ", "score": 1},{"body": "Where can I get one of these ?!", "score": 1},{"body": "Nightmare fuel.", "score": 1},{"body": "From one of the comments more up she sounds like an apparent animal keeper. ", "score": 1},{"body": "I have that in T-Shirt form. legit.", "score": 1},{"body": "[In case you wanted to know what the story was about.](http://www.kptv.com/story/27766641/deputy-k-9-find-guns-and-meth-during-salem-traffic-stop)", "score": 1},{"body": "Actually, if it is under a certain age, it may need feeding at very frequent intervals, so it may be necessary to keep it with her all the time. ", "score": 1},{"body": "I'm going to Taiwan 17 of Feb until 1 of March. I shall investigate this claim... ", "score": 1},{"body": "Rochester NY has one. ", "score": 1},{"body": "I see it now...", "score": 1},{"body": "That's one hell of a large kidney stone.  How he passed it I'll never know.", "score": 1},{"body": "Skippy the Bush Kangaroo was a kids show that featured the titular roo \"saving the day\" in the same way Lassie does.", "score": 1},{"body": "Blonde girl next to OP is cute.", "score": 1},{"body": "To the Batmobile!", "score": 1},{"body": "...the signs weren't in Spanish. ", "score": 1},{"body": "Dat EAR doe", "score": 1},{"body": "Ok so that's about 340ml. Roughly the same, but yeah we do pay a lot for beer here. I don't think even the proper cheap shit is priced as low as you are quoting over here.", "score": 1},{"body": "Oh, something about it hoping it was a copy pasta.", "score": 1},{"body": "Call me racist but they look Japanese.", "score": 1},{"body": "You're one beautiful lady.", "score": 1},{"body": "Is it anecdote time? After moving and joining a union my husband and I got health insurance for the first time in years and he actually gets paid what his work is worth now. He works with a few idiots but that's true of any job, paying people less and cutting their benefits doesn't make them more competent.", "score": 1},{"body": "Unless you are caring for a Joey for WIRES - like a friend of mine, who is looking after one that was a road-kill orphan rescued from its dead mother's pouch.", "score": 1},{"body": "Ayy lmao", "score": 1},{"body": "It was such a great surprise! I had no idea she still had it, I just remembered it from pictures. It was extra special because her nickname for me was always \"bear\"", "score": 1},{"body": "It's a great way to impress and I've gotten a lot faster at it too. The best are the girls who doubt they'll like them and the moment they take a little nibble and their eyes widen as they shove the entire thing in their mouths and do the muffled \"omg so good!\" ", "score": 1},{"body": "These old time photos have become our family pictures through the years. It all started when my parents dated and had continued every few years, especially on the years people have been added to the family. I think there are close to 20 some pictures up on the wall at my parent's place.", "score": 1},{"body": "[It's just some trash blowing in the wind, do you know how complicated your circulatory system is?](https://www.youtube.com/watch?v=7tPnALg_nJs)", "score": 1},{"body": "Hokaaaaay! ", "score": 1},{"body": "Wow the karma hunt lol!", "score": 1},{"body": "Then Clerks was pretty crappier", "score": 1},{"body": "On the contrary, I only watched an Austin Powwers film for the first time when I was 17 ( and hated it) after my then girlfriend insisted it was a must see. I should add that only a year later my church youth group leader invited us to watch a movie, and it was So I Married an Axe Murderer, which I found fun to watch. I do not recall anything about the film, to this day.\n\nTLDR,  raised to 17 without watching Mike Myers", "score": 1},{"body": "Modernization.  Rings show the power now!", "score": 1},{"body": "I only have a few base items in my fridge. I cook daily with fresh veggies, fruits and meat....\n", "score": 1},{"body": "Yes, she knows it's a multipass! Anyways, we're in love.", "score": 1},{"body": "Wrong order, gotta subtract 32 then multiply by 5/9.", "score": 1},{"body": "Block heater and jack up them CCA's problem solved, Bro Rogan", "score": 1},{"body": "Good. Now edit your top comment and post them there so people see them!", "score": 1},{"body": "Ha, its no excuse, but you cant see the trash from the street, its strategically placed so the sides hide it, but i see your point.", "score": 1},{"body": "Fuck me for my opinion? So be it. \n\n&gt;If it's so much better in Ecuador, go there. \n\nDon't put words in my mouth.\n\n&gt;You have so many legal rights in America\n\nThey're a joke. They will be infringed upon if the American government sees fit.", "score": 1},{"body": "I have major back/hip issues and I'm only 32. I wonder if this is part of the reason why? I'm gonna ask my doctor, although he usually just blows me off when I bring things up.", "score": 1},{"body": "Well that turned out looking absolutely fantastic.", "score": 1},{"body": "http://i.imgur.com/jNLYBPY.png", "score": 1},{"body": "my great grandmother before she passed loved to blaze one and watch stupid stoner movies at age 92. totally her kind of movie", "score": 1},{"body": "The Dragon's nice.  Helps with the tourism too.", "score": 1},{"body": "Good job, OP's grandpa!\n", "score": 1},{"body": "Want", "score": 1},{"body": "Phrasing", "score": 1},{"body": "you should do some awesome photos of them in ewok costume, doing everyday things turned into adventures. ", "score": 1},{"body": "Who said anything about eye for an eye?\n\nAnd Nazi's did start out as basically street thugs harassing Jews. Or did you think The Nazi party went from 0 members to running the country overnight?", "score": 1},{"body": "We fancy huh?", "score": 1},{"body": "You could literally read the \"Vizio 50 inch\" from the street, but fair point.", "score": 1},{"body": "If I were a dog, I'd be scared to eat from the bowl ... where the string breaks and a concrete block falls on my head", "score": 1},{"body": "I guess comics aren't allowed in /r/pics so I'm reposting this in /r/funny.", "score": 1},{"body": "Copywriter is both a general term for the trade of crafting words for advertising and a specific job title at an agency, a job that generally hovers around entry level to 2 - 3 years of experience.\n\nAs you get promoted you usually move into a hierarchy of \"Creative Director\" positions, often Assistant, Associate, Group, indicating how much staff and how many clients you oversee.  Same path for Art Directors.\n\nThe top job at the agency is often Executive Creative Director or, more common at larger agencies, Chief Creative Officer.\n\nSo as perspective, I started out as a copywriter, my actual job title.  Over ten years I got to Executive Creative Director of an agency in New York, but everyone knew I came up through the copywriter ranks, not art.\n\nNow I'm a consulting executive to agencies but I still think of myself as a copywriter much as, I would guess, the President of Roto-Rooter still thinks of himself as a plumber.  It's just in your bones, and you tend to think a certain way about problems because that's how you came up.", "score": 1},{"body": "/r/badpuns", "score": 1},{"body": "I'd bang her at either age", "score": 1},{"body": "I'm pretty sure he's going to murder you in your sleep.", "score": 1},{"body": "Now he knows what his dad felt like! ", "score": 1},{"body": "Well at least the last thing you see will be pretty.", "score": 1},{"body": "So when your family does the same thing with you and rejects spending the last few minutes of your entire life on this Earth because it will make them feel bad seeing your body, you'll just be okay with making that transition into the unknown all alone? ", "score": 1},{"body": "Pupil dilation says it all", "score": 1},{"body": "Man I want him to be interviewed by O'Reilly. I can just see them both yelling and over-talking each other and getting nothing across.  It would be glorious.", "score": 1},{"body": "Too much work. Just give me the damn time! (Yes, I realize the orientation of the arrows will take care of that whole thing.)", "score": 1},{"body": "You aged, she didn't.\n\nI think your wife is hiding the elixir of youth or some shit.", "score": 1},{"body": "I did too...", "score": 1},{"body": "I dunno. everyone else is saying its bad but i dont use the syrup that much. not enough to buy the fancy kind.", "score": 1},{"body": "I never understood the Wild West picture phenom, but it is a cool memory for them.\n", "score": 1},{"body": "Still lookin ( ͡° ͜ʖ ͡°)", "score": 1},{"body": "The sequel to The Omen.", "score": 1},{"body": "Why is this on the front page?? Who the hell cares? Oh you look older then you did 20 years ago and now have children, cool fucking story so did everyone else!", "score": 1},{"body": "The ass was too fatwah!", "score": 1},{"body": "It's already on sale at urban outfitters", "score": 1},{"body": "Yup \nSource: Canadian whose been in hot tubs when its about -30. ", "score": 1},{"body": "Sorry to hear. Remember how she lived not how she died. Much love ", "score": 1},{"body": "I actually live very close to Portland and I can in fact confirm weird shit happens there ", "score": 1},{"body": "I've felt -35'f wind chill before and it's pretty scary. The cold quickly seeps into your skin the moment you step outside. You feel it like ice cracking into each and every  nerve, it's unsettling.", "score": 1},{"body": "Damn, why you gotta be so salty man? Like a peanut butter pretzel in the ocean shit is so salty.", "score": 1},{"body": "And you won't until you give it all up.", "score": 1},{"body": "That's actually illegal. Same law prevents company's from being able to demand items back that they accidentally send.Company's were sending people items and then billing them for it. ", "score": 1},{"body": "Good systems. Not cheap to install, but extremely comfortable and pretty efficient. ", "score": 1},{"body": "Look at both pics, OP must definitely have something footy-sexy going on in their head.", "score": 1},{"body": "Well screw her if she doesn't like playing games", "score": 1},{"body": "this is bullshit; Ukranian Tire is literally THE WORST place to take your vehicle for maintenance... ice sculptor hired by contract", "score": 1},{"body": "SEE! No crown and still a King! ;)", "score": 1},{"body": "Yeah, I've seen this a number of times on here.", "score": 1},{"body": "Y'all have aged well", "score": 1},{"body": "I don't live too far. I'll be looking.", "score": 1},{"body": "viral marketing campaign of fedex", "score": 1},{"body": "sorry to hear ! hope they find her soon :) xo \n- Ben , Ontario, Canada", "score": 1},{"body": "Let's never forget anyone. ", "score": 1},{"body": "Congratulations to your grandfather!!!", "score": 1},{"body": "try /r/dong", "score": 1},{"body": "Wayne's World ", "score": 1},{"body": "Hey now, lets not forget about our old friend the Rankine scale.", "score": 1},{"body": "Your daughter is frickin adorable - kudos dude. ", "score": 1},{"body": "Allegations proven to be false. \n\nTry again. ", "score": 1},{"body": "I wish we lived in a perfect world where dogs were immortal.  \nI can't imagine being without my dog, and it hurts to even think about it.  \nSorry for your loss OP. ", "score": 1},{"body": "Yes! On my thumb :D ", "score": 1},{"body": "Such a great picture! ", "score": 1},{"body": "IF Peyton Manning's any indication, you should to try out for QB of your local NFL team.", "score": 1},{"body": "NH here , dog is not in my bed , which is sad cause no one is in my bed. ", "score": 1},{"body": "That's so expensive though. ", "score": 1},{"body": "PLOT TWIST:  The dad said this.", "score": 1},{"body": "i would say 3/10.", "score": 1},{"body": "pic", "score": 1},{"body": "I don't know but I'm going to through my support behind this ", "score": 1},{"body": "Testic... oh fuck this", "score": 1},{"body": "Jesus…Have you watched the whole show?", "score": 1},{"body": "You look 34 1/2.", "score": 1},{"body": "I've never been to a Mosque where the Friday prayer speaker was anyone but a regular of the mosque, not even a guest.  If there were guests present for some lecture, it would take place after prayer.", "score": 1},{"body": "Never had anyone call me on the username before.  No, I am not a newfoundlander, but when our first son was born we [tented across Newfoundland] (https://www.youtube.com/watch?v=7fjDarTVUjs) and we visited Twillingate to see icebergs and whales.  I loved the name.", "score": 1},{"body": "We love you too\n\nTo our southern pals, Mexico ", "score": 1},{"body": "Yeah, I have nothing against muslims like you, in fact among my closest friends, is this lovely girl who is an ardent follower of Islam, in a land dominated by an other religion.\n\nReligion shouldn't be a base for judgement at all, but then when so much negativity( in the media )surrounds a particular sect, it's hard not to let it influence your thoughts too much.\n\nI know I am wrong when I say fuck Islam, and when I generalize stuff for more than a billion people, but my point is that, there is so much fervor and dedication, that it almost turns destructive.\n\nLiving as we are in a age of science, technology and advancements, I'd say Islam inhibits the growth of it's followers.\n\nAnd honestly, I don't understand how the promise of something in your afterlife, can deter you off the track in the actual life. ", "score": 1},{"body": "The Mrs kept herself in shape. Mr has enjoyed a few too many beers and Big Macs ", "score": 1},{"body": "This is pretty much a drunk driving ad in Canada. How much have you had to drink, OP!?", "score": 1},{"body": "Wait you mean America isn't 2015 years old?!?!?!", "score": 1},{"body": "24, and I'm the opposite.", "score": 1},{"body": "Lol not likely. ", "score": 1},{"body": "he is a precious little thing! im sorry to hear about this.\n", "score": 1},{"body": "I am going to assume we are still talking about wooden houses. And I know nothing about building houses so I am guessing here.   In order for it to last thousands of years, you would have to replace each piece of wood over time, including the frame.  So basically, wouldn't you be tearing down the house and re-building it?  Assuming the foundation had been built of stones, cement or whatever other kind of material that isn't wood, technically the house would not last but the foundation might.  I have to admit it was fun researching old houses, so thanks for that.  ", "score": 1},{"body": "Mascara game on point ", "score": 1},{"body": "/r/AutoDetailing ", "score": 1},{"body": "Funny enough, I just watched Clerks.", "score": 1},{"body": "Let that be a lesson to all the girls that think those geeky 21 year old guys aren't hot. ~~We~~ They become the silver foxes of our generation.", "score": 1},{"body": "That's one of the best sub rules I've heard of", "score": 1},{"body": "Beam! Definately the beam!", "score": 1},{"body": "Dude we can kinda make out the shipping address and name. Don't you care ?", "score": 1},{"body": "Nah, last time i ordered Fed Ex, they marked the package as \"failed delivery,  business closed\".  My house is not a business address!", "score": 1},{"body": "Well, I haven't seen her in Pennsylvania.  I'll be sure to keep you all updated.", "score": 1},{"body": "These are very easy and go over well at work functions.", "score": 1},{"body": "I'm sitting here with tears rolling down my face from this goddamned thread and now I'm doing this weird laugh/sob noise because of you. ", "score": 1},{"body": "The signature required is up to the shipper.", "score": 1},{"body": "I see the McDick is increasing profits.", "score": 1},{"body": "The world disagrees with you. You have bad taste, and you should feel bad about yourself for it.", "score": 1},{"body": "Butt think about all the attachments!", "score": 1},{"body": "Don't worry you can get it when it's reposted. I'll get the one after. ", "score": 1},{"body": "Alex, what is a Canadian?!", "score": 1},{"body": "Great a handful of people. \n\nhttp://www.merriam-webster.com/dictionary/racism\n\nI'll just leave this here. At most it's a belief. Religion is an organization of beliefs. \n\nAh fuck it, we both know you been trolling. You'll just nitpick more. Go bomb a church or something I guess. \n", "score": 1},{"body": "Vfd on the fan?  ", "score": 1},{"body": "Yup. That would be why I didn't say \"*op* met...\" ;)", "score": 1},{"body": "i'm only 21 and i grew up watching clerks and austin powers....", "score": 1},{"body": "Dude I've had problems with overpronation of the feet, constant joint pain, flatfoot and other problems due to my Morton's toe. I'm due to get surgery for it this year. Our talons are definetely not good for us no matter how \"badass\" they look.", "score": 1},{"body": "Her face is covered, so what's the big deal?", "score": 1},{"body": "Never had anyone call me on the username before. No, I am not a Newfoundlander, but when our first son was born we tented across Newfoundland and we visited Twillingate to see icebergs and whales. I loved the name.", "score": 1},{"body": "something's gone terribly wrong", "score": 1},{"body": "What's a dead pool", "score": 1},{"body": "Well that makes me feel a little better.  Thank you.", "score": 1},{"body": "I figured this would be in the area. I thought it was the place at Wonderland that did these kinds of photos, though.", "score": 1},{"body": "Icelashes?  \n\n(Actually, that sounds like it could be a form of punishment...)", "score": 1},{"body": "oh\n\n/r/deadpoolhatersclub", "score": 1},{"body": "Can you still make it to the hockey game?", "score": 1},{"body": "You also looked a LOT like Nicko McBrain,  drummer of Iron Maiden.", "score": 1},{"body": "Thanks, I think I'm going to be in trouble when she's older.", "score": 1},{"body": "Haha thanks man needed the balance since I had just gotten off a youtube comment chain. ", "score": 1},{"body": "I do want one of those tvs though. If you don't mind me asking, how much did you pay? ", "score": 1},{"body": "From the 1900s? I'm from then.\n\nTo be perfectly serious, though, many of those people didn't have access to Internet. Everything we do is now recorded, from menial things like breakfast, to other large things. The Internet is like a gigantic museum that collects everything we've ever put into it, and nothing will disappear forever.\n\nMaybe no one will go looking for this picture of this dog in the next 100 years, but we don't know. Someone may find the picture 300 years from now and go, \"Hey, cool.\"", "score": 1},{"body": "The anamal is going to be dead after a few minutes and you're going to live another 50 or so years. A lot of people can't stomach watching their best friend dying. It's their choice.", "score": 1},{"body": "Thanks :D", "score": 1},{"body": "Being an American makes me proud to have him as a grandpa...wait, that's not how citizenship works! Too late; he's America's grandpa, now.\n\nNone of you bastards tell him he's adopted!", "score": 1},{"body": "This will happen when Hannity finally gets waterboarded.\n\nBonus: [Here's both interviewing each other, somehow.](https://www.youtube.com/watch?v=hM-36_1IwYg)", "score": 1},{"body": "Not to be a Negative Nancy, but does anyone else think that this phrase is much more glib than clever?\n\nI mean, a perfectly reasonable interpretation--from the terrorists POV--would be \"I am also target for execution\".\n\nI know it's *supposed* to be expressing solidarity with the cartoonists...but it's *literally* saying \"kill me too\".\n\nI'd prefer that the message be something more along the lines of \"I'm going to kill you before you kill me, assholes\".", "score": 1},{"body": "It's a pool that's been shot to death.", "score": 1},{"body": "You do not want this toe problem. I've had so much foot and bodily pain over the years due to Morton's toe. ", "score": 1},{"body": "Eww.", "score": 1},{"body": "That's depressing as fuck.", "score": 1},{"body": "Did this once every winter with my high school swim team. We raced one lap around the snow covered baseball field, made 2 snow angels each, then jumped back in. I can confirm, the water felt like it was boiling ", "score": 1},{"body": "Really ", "score": 1},{"body": "I just got a puppy man, wrong fucking thread", "score": 1},{"body": "Kevin Spacey???", "score": 1},{"body": "When I Googled it, there was an article titled \"No, you twat, America is not 2015 years old.\" ", "score": 1},{"body": "Guy ages 20 years. Woman ages 1. ", "score": 1},{"body": "That took an unexpected turn.", "score": 1},{"body": "I think he was more pointing out the 'old timey' thing his older relatives did was probably slavery. ", "score": 1},{"body": "His name is Les, and he is the most beautiful thing i have ever seen. \n\n*Clears Throat* \n\n[And so is his bag](https://www.youtube.com/watch?v=4YFNJViFfHo)", "score": 1},{"body": "Would the engine melt the hood or something?", "score": 1},{"body": "The weather is nice and refreshing. Also, since you asked, Lake Superior is still very cold.", "score": 1},{"body": "Yeah with money, a brain, an education and a respect for women not formed in a frat house. \n\n", "score": 1},{"body": "You know in his mind, this is a brilliant solution.\n\nSource: am male.", "score": 1},{"body": "i never said islamic extremism wasnt the point, i just meant that iraq was all for money and oil not for legitamte reasons, in the wake of the charlie attack, i believe europe should go to total war with all islamic states ", "score": 1},{"body": "Aw that's so sad but nice that you were able to do something for her that she loved. Makes them happy, gives you a good memory of the dog you always knew. And you made the right decision. When they are in that much pain it's the right thing to do for them. Mine got bad really quick too, they diagnosed the cancer on a Friday after her not acting like herself for only a day or so, just laying around and having issues moving, we could tell she was in pain and we had to put her down Saturday morning. They said she would only have a couple days at most and she would hurt the whole time so we had to. It sucked but it was the right decision for her. I'm sorry for your loss though. It sucks losing your best buddy. ", "score": 1},{"body": "I'm Henry the VIII, I am.  Henry the VIII I am, I am.  I got married to the widow next door...", "score": 1},{"body": "You're totally Canadians, you just live on the wrong side of the border.", "score": 1},{"body": "Beginner copywriters are referred to as \"junior\" copywriters and will work lower profile projects.\n\nNon-junior positions typically require 3-5 years experience and a portfolio of published works showcasing your skills. \n\n", "score": 1},{"body": "iiiiiiit'ss GGRREEEEEAAAAT!", "score": 1},{"body": "Yeah! It should read \"an unique...\", geez people!", "score": 1},{"body": "India here. Only cowdung and strays..", "score": 1},{"body": "They are the same date, but they differ in the order they are said in French and English. Not a typo.", "score": 1},{"body": "You could have left out the Celsius in the caption. -40 degrees is -40 degrees. That's where the two systems match. And it obviously isn't Kelvin since there is no negative on the Kelvin scale", "score": 1},{"body": "Not really sure if this comment was needed..", "score": 1},{"body": "&gt; You're suggesting that we show indifference to murder\n\nIf that's what you're getting, you're either arguing in bad faith or you're really stupid. Either way, I think we're done here.", "score": 1},{"body": "*ShireIt", "score": 1},{"body": "If you're that dumb, you kinda deserve to get hurt.", "score": 1},{"body": "He threw the water up. ", "score": 1},{"body": "$798 shipped.  So far, not worth it.  The 4K content available looks phenomenal, but there's not much right now.  I would recommemd getting a 65 inch 1080p TV for less money.", "score": 1},{"body": "_ok_", "score": 1},{"body": "That's unfortunate :( at least she had one hell of a last day, and one hell of a friend! ", "score": 1},{"body": "Fuck those people, when they lose their dog they can talk.", "score": 1},{"body": "I like to share.", "score": 1},{"body": "I think you look more like Bud from Salute your shorts 20 years ago", "score": 1},{"body": "*I'll be in your bunk, too.*", "score": 1},{"body": "No he's a bigot because... well, look at the definition:\n\n&gt;Bigot: a person who strongly and unfairly dislikes other people, ideas, etc.  A bigoted person; especially : a person who hates or refuses to accept the members of a particular group.\n\nDoes that definition not fit him?\n\n(I won't get into it, as this is an old thread but you might want to google where some the profits from his company go.   Ever heard of \"pray away the gay\" camps? How about organizations that depict gay folks as pedophiles?  I guess I classify those as discrimination and refusal to accept someone different than yourself)", "score": 1},{"body": "Hm. Maybe. Could I slowly replace every part of my body and still be me? What makes me actually me? Like what if I could put my brain in a new body, or slowly put a new body around my brain. ", "score": 1},{"body": "Thats some serious antartic boredom that led to that shit", "score": 1},{"body": "Thank you so very much for posting the links to Ai Weiwei and Thomas Thwaites. Both were fascinating videos.  You seem to know a bit about art. So is Jeff Koons an example of a contemporary artist that highlights the process? Is he the one that started the trend of highlighting the process over meaning?", "score": 1},{"body": "Who should I recognize? ", "score": 1},{"body": "Idk man haha how many movies do you know came out in a specific year? I was born in 92 and always thought Jurassic park came out after that till I watched it on tv this year.  I've seen a lot of movies though I'd guess it's pretty high. ", "score": 1},{"body": "My fiancé is a saint, he rubs my feet almost every night, I was just starting to look into treatment.  I got a tattoo on my foot to take away from the toes. ", "score": 1},{"body": "It amazes me that the whole process of immigration is so difficult that people end up doing it illegally but the test itself is simple enough that I could have passed it before I hit high school. \n", "score": 1},{"body": "This happened in Kentucky I just seen this on the news. ", "score": 1},{"body": "Wow. Now thats one boring ass picture of a boring ass town.\n", "score": 1},{"body": "It was -18 Celsius here in North Carolina last night.", "score": 1},{"body": "Or maybe it was capitalism and consumers didn't want to pay more to be served by models.", "score": 1},{"body": "\"Naked, Came I\".", "score": 1},{"body": "Beaten more than Jenna Jameson", "score": 1},{"body": "Tank water heater is for domestic hot water. Tankless is for the floor heat. See the plastic tubes? Circulate hot water through the floors and you can hit Temps extremely consistently. It's pretty handy and nice, especially since you never have to step on the cold floor with bare feet again. ", "score": 1},{"body": "Yea we have our rescue who I love but I'd like to foster in addition to that because there are so many that need homes but I'd end up trying to adopt them all. ", "score": 1},{"body": "[Karma decay search](http://karmadecay.com/results/u4491828)\n\n[Google image search.](https://www.google.com/search?tbs=sbi:AMhZZivxKVlaow6Ja7miHv46thCPDWYSV878lW7SRxJivInaiz2lK6y01WDZ6dIrS9Z2QFk8B3qiB2MzSJP2rGqzQxmBt5gr8zR5u16wVILfiF2fTEb-757TFbTy1Y5B3-Gx6CNMknYsiZ9uSo3qOrZ4sq1_1LS4t26i30WfHATwgB3pGbVPd5fBpEBnmUn1kO7Fj_1vg65agN2VjaWyvTpJm_1mqxagLYKXUqCk9MvREdiQgRXFprmola2wziOTEX_1oUi0tcDu8eaGy6EpZmwE71eRLYHGjaSaLpNV0n_1CAcoP0fyLWIZAB7gCHnVbv8gCF92CjqPNwywzaJbiNi8uH-m5-IdtHzrJSm6eLGMhpz3a687Yh0m3i_1kjwMcFn0Yc1lOa01gWPBeFltxMRF9TuKcPOan-tYhcZ56xhAflkR5iu8jHJtbvX_1OCP1ZwyoLCT1wXuZNbmNFhAGZ80hY2sJt98TRfZ08J-EI2k5RBbRVuCrOIRt5s7R0XEdS-djbmX03Q8BABnfYPwPCL1k3io3g0I-QRx9_1ZoPBr19voPobWEo_1nMeYEn1yktcFfvTOdVdohyAep2oMLBbqgL8RtGnid8AUa6I_1T9we4jWcqgqP_1OlpZyA0JUI9wZhEnlxU8FZs9OH72OVNbnwx2duh8I74vypRkugfBb5DrhXQNByiHhnxACx_1sQSua-u5se1YfPEqt80oc3zZlsW0a4T1ZTrHCrcVYaaMSbE2vnTuAaSquBMjMaP8fV3r5piBYQPeUt1yjJJ-UV0YnEElU5MWY9Qmgxn80QIarkVdT10droDmZM1ct2B65TcDqagGpz-WNdawH17e1b33rZtPNg3bYgNbWdMMJjsf0RjEkq-6K6T6fnT1H5s4hOJSTJfAnCQL_1FrcEOOm8TmHZOG3iwqMQ6Y97IQKf6ja_1XJKdoU0AXasAyEuJKruoAGrD3SEFMsLYEi83LfWFkOLT-YNGzTO9agQBRw5ocdOn9terpjB8ZHrC7awk1DKBVm0Z6mhEp5rJHwysIr0nV5UnXt_1NIpRI9x8JTf8OpQjBIcp7FfbO100bXnZQC3TIH9-X447wtHii4VtAdwNXsK0VNASU3BWxwfdjA-RvXjUtQnTMHeLdAQ66fmdExdk1l2yheHVPZvN31N7yEBu1cOHhLgH4mU0EXV9IACsq-tBLnRzn9vUyYraIdibroixgfmPJ4gkb1jU7gHrkSnJMaWH-S9NfbN0STUpApu7NU46j15-qGVgUCN_12QsfgopF3zPCCydBowIKeIodvaCOLYVaArl2u3TJmodbz40t5GFYLJSvRF4eF2nnoCA0OyujH8-_1-5XHF05UAVIfoVYRNUAb7Pi9oKa5pXBB3ymIWu0bUsLP6MR3NakwlV9EAdKIu_11gN3K2UZoticfIqC7_1myMOzPihQQJePmu7qUPhboUgiDZFikXLx2poPTB2T0rzMTAs)\n\nI hadn't seen it either. I don't know why he's calling it a repost.  ", "score": 1},{"body": "I'm drunk. And crying. I remember my dof Buster and putting him down.", "score": 1},{"body": "This is from a TVad that first aired christmas 2013, they aired it again this year too.", "score": 1},{"body": "tons of things have been solved via reddit and I'm sure you've clicked on a few articles ud wish you hadn't. so either offer some kind  of encouragement, forward it around, up vote it or shut the fuck up and move on to the next post. bitching about the meaninglessness of someone's lost dog post is only going to waste more of your apparently precious time. have some empathy ", "score": 1},{"body": "that's pretty hot", "score": 1},{"body": "That's good writing and performing, then!", "score": 1},{"body": "I actually went looking, and I found this: ⸮ it's the irony mark. Upgrade your fonts if you just see a box.", "score": 1},{"body": "If you feel safe doing it go out late at night when everything is quiet and walk around the neighborhood calling her.  If she's trapped somewhere (like a garage) you should be able to hear her meow.  This has worked for me in the past searching for missing cats.  Put up signs asking neighbors to check garages, sheds, etc.  Most of the time they are surprisingly near by.\n\n\n", "score": 1},{"body": "listen im not gonna argue with you but you dont know everything. husky doesnt mean fat as fuck, fat as fuck means fat as fuck. stop trying to be cool.", "score": 1},{"body": "We share the same name. I'm sure he was pretty awesome. ", "score": 1},{"body": "So sorry.  Parents lost their Bichon Sunday. murph was a good dog", "score": 1},{"body": "http://webtrax.hu/myfacewhen/faces/lineart-memes/mother-of-god.jpg", "score": 1},{"body": "So your source on your claim that \"The vast majority of Muslims approve of beheading in Mecca\" is a 20 year old article about the Saudi Arabian government that says nothing at all about your claim?\n\nOkay then.", "score": 1},{"body": "Sucks to suck.", "score": 1},{"body": "I wish you the best, I know how terrifying going through this is. ", "score": 1},{"body": "Get in mah belly!", "score": 1},{"body": "There will be good days and tough days ahead for you but just know that Chester has always and will always love you unconditionally love you. \n\nI just lost my dog. She was only 3, it was very sudden and unexpected", "score": 1},{"body": "Well, Iceman, pleasure to meet an X-Man.", "score": 1},{"body": "I hope she's warmly dressed if she shows up here in Canada!\n\nBut seriously, good luck - I hope you find her safe. ", "score": 1},{"body": "/r/cringepics", "score": 1},{"body": "m'rabbi", "score": 1},{"body": "The other side of letting everyone carry is that many situations that escalate to verbal or physical (hand to hand) confrontations under the current set up may end up escalating to shoot outs.  So you may kill a few terrorists but you will also have random high tempered morons killing (or involving) random passerbys in unecessary shoot outs.  ", "score": 1},{"body": "They don't look like police, more like people in costume.", "score": 1},{"body": "No, drink a normal amount of water slowly and steadily. try for 2 cups within an hour with some salty foods or even better, an [ORS](http://en.wikipedia.org/wiki/Oral_rehydration_therapy#Preparation)", "score": 1},{"body": "How do you feel about Ryan Reynolds trying to make a movie about you?", "score": 1},{"body": "that doesn't even make sense. ", "score": 1},{"body": "I been wandering for hours", "score": 1},{"body": "I live in Spring, Texas! I'll keep my eyes open. What area in Spring do you live?", "score": 1},{"body": "Efforts should be made to tag his name in Arabic next to all these pictures.", "score": 1},{"body": "Got Milk?", "score": 1},{"body": "I would also suggest a post in /r/thewoodlands as well since that's close proximity to Spring.", "score": 1},{"body": "Lol that's awesome! You should seal it forever with some clear epoxy or something!", "score": 1},{"body": "It could be she figured out you are the type of turd that would post this on reddit expecting sympathy, so, like she said, it was easy for her", "score": 1},{"body": "wow... just... wow...", "score": 1},{"body": "This boy is more of a man than I can ever hope to be. If I have one goal in life, its to do half the good he did. ", "score": 1},{"body": "Enhance!", "score": 1},{"body": "Hope your recovery is going well ", "score": 1},{"body": "Try breaking you hair apart for a haircut.", "score": 1},{"body": "Fuck her right in the pussy!", "score": 1},{"body": "But all the snow up in Tahoe will help, once it melts. ", "score": 1},{"body": "Right?! I'm laying down next to my dog buster and now I can't sleep because I'm all sad. We rescued him about 4 months after we had to put my other dog down. I should say he rescued me though, that's really how that worked out. ", "score": 1},{"body": "Is that from Dick-filet?  ", "score": 1},{"body": "It's common for the plastic. Yeah, copper is better, but it's way more expensive, and as long as the inside of the pipe is kept at a basically constant temp, then the thermal conductivity doesn't matter as much. ", "score": 1},{"body": "I second this statement....Did a bang up job there señor!", "score": 1},{"body": "Fuck you for your elitist attitude, man. That's all I have to say to you. ", "score": 1},{"body": "I look at the sky every night to see if the Northern lights are out. The only reason I noticed it was because the Sun version of this has been out for the last couple of days. I went outside to see if I could see anything to explain the \"star\" looking things. I didn't get anything. Maybe Planets? I was facing the East when I tool the picture. I took it around 11:00 pm CST. I live in North Western Minnesota. \n", "score": 1},{"body": "Look at where her foot is...", "score": 1},{"body": "Not his fault that he's short and needs to sit to look taller.", "score": 1},{"body": "Was she supposed to stay with you just to make you happy, even though she wasn't? What kind of person expects that?", "score": 1},{"body": "What doughnuts? ", "score": 1},{"body": "This is so sick!\n", "score": 1},{"body": "The quote is saying to not judge the sheriff based on what was misquoted. Your quote is relaying that because we shouldn't scrutinize him, he is better than others. It's obvious you are taking this out of context and inserting your own anti-cop sentiments. I'm suggesting that you take things one case at time instead of collapsing all of sector into the same group.", "score": 1},{"body": "I used to go camping in Big Sur every summer with my best friend and her family. Did you guys stay at the campgrounds, or just randomly find a place?", "score": 1},{"body": "Can I call you Freudian Sorcerer?", "score": 1},{"body": "Ik kom altijd het laatst.", "score": 1},{"body": "My baby's turning 12 next month, I can't imagine :( \nI'm sorry man, much love to you", "score": 1},{"body": "If you don't have kids, this is great news!", "score": 1},{"body": "Classic sign of a retard baby... best put it down. ", "score": 1},{"body": "The year anniversary had him top of front page, I mean what he did was commendable but karma whoring over his death isn't.", "score": 1},{"body": "aaaand if that was a picture of Deckard from the novel, you wouldn't be being downvoted.", "score": 1},{"body": "10/10 would bang and get frostbite", "score": 1},{"body": "Floridian here. It's below 32 outside. Not here. Nor am I outside. ", "score": 1},{"body": "Why is their year different from ours?", "score": 1},{"body": "Damn yall were so much better looking as teenagers... I need to take better care of myself. ", "score": 1},{"body": "84%", "score": 1},{"body": "Be prepared. Pretend you are in the military and someone says that you have to be okay for a few days. I know a few people in the northern part of the state (the UP) who have a minimum of 8 weeks of food, gasoline, and water because if it gets cold enough and it snows enough the only form of transportation that you have is a snowmobile. That being said it is an extreme location. \n\nYou can learn from it though. Basically, keep up on your winter gear, extra supplies, and other resources. Getting stuck in the winter is a lot like getting stuck in the desert. You need to stay hydrated, you need to eat, and you need to be able to deal with the temperatures until you can be saved. ", "score": 1},{"body": "I'm sorry for your loss.", "score": 1},{"body": "Fuck yeah! \n\nWay to bag a hot wife, bro!  Glad it still works out for some people, congrats and I hope your next 20 years are even better.", "score": 1},{"body": "I'm a Dave. There's never been an error.", "score": 1},{"body": "mmm boo... donuts... aaagggghh.", "score": 1},{"body": "There might actually be a slight improvement going on. Maybe it's even market-driven. Ten years ago, every single flight I took was staffed by actual hags. Lately, it's more like: 50% hags, 25% gay guys, and 25% menopausal but reasonably attractive women.", "score": 1},{"body": "Bruhhhh. Internet daps to you. 👊", "score": 1},{"body": "It's unbearable ", "score": 1},{"body": "Cypress area, hope you find her. ", "score": 1},{"body": "[OMG...](http://www.youtube.com/watch?v=_wQTVIPlZEk)", "score": 1},{"body": "I'm sorry to read this... I know its not easy but if you want to be happy just realize that it wouldn't be true happiness with someone who would just walk away. In time things will be better. Keep your chin up and be thankful that it several years into a marriage with children involved. It will get better when you are ready to move on.", "score": 1},{"body": "Lucky. I love the beach since Michigan is basically a water state, but I just wish I had more time in a year to enjoy it.", "score": 1},{"body": "I've just gone through a similar thing.\n\nMy 18 yeard old rottie lost function in her back half  and was going to the toilet on herself so I had to accept it was her time, as much as it hurt to see her being fully aware and still happy ( when her legs didnt hurt)\n\n The days before were agony, I felt like I had a lead weight on my chest.\n\nWhe had chocolate bars galore, dinner and breakfast were a dozen sausages and more chocolate.\n\nHer appointment was at 2 pm, that day, after her hearty breakfast I gave her a sppnge bath, brushed her,  I made sure she was pretty for her last day. But most importantly I was with her, tickling her, making her laugh. She was happy.\n\nI also held her until the last breath left her body.  \n\nThat was the 18th of Dec, I still cry every day when I get home and shes not there, I look for her just in case its all been a nightnare and shes still there.\n\nI know what you went through, man its tough. Real tough.", "score": 1},{"body": "People do it a lot from what a friend of mine said. Drop the dog off, euthanize, cremate and they come and pick up the ashes. Yup, pretty fucked.", "score": 1},{"body": "I think the point I (and the person who designed this ring in the first place) are making is that you should create your own unique ring. It doesn't matter if you design it then have a jeweler make it, I never said it did. Just snagging the idea of this guy is a little less creative. Try harder. ", "score": 1},{"body": "Their beer collection grew.", "score": 1},{"body": "I don't know if you know his breed or not but I just had to put my dog of 14 years down in June (pneumonia) and we asked if they could do a DNA test on him I'm so happy we did I always wanted to know what the little mutt was and turned out we were guessing the wrong breeds", "score": 1},{"body": "I feel like I could assign each person in my group of buddies to to the different dogs.", "score": 1},{"body": "I had to put my 17 year old dog down a while ago, so I totally understand how you're feeling. I am sending good vibes your way. ", "score": 1},{"body": "That's really touching and really depressing. ", "score": 1},{"body": "No tray table.", "score": 1},{"body": "Then you must know Chuck and Susan.", "score": 1},{"body": "Oregon and Alaska legalized it. ", "score": 1},{"body": "Absolutely adorable!", "score": 1},{"body": "Fat whore", "score": 1},{"body": "A horrible time for anyone who loves and is loved unconditionally.  I wish strength for you, and peace for your sweet baby.😢🌻", "score": 1},{"body": "this dude makes boss ross and Mr. rogers want to slap him up side his head, then take a shit in his mouth", "score": 1},{"body": "Cool, appreciate you taking the time to clear all that up for me. I'm trying to figure out what to go to college for so I'm trying to learn about as many areas of work as I can.", "score": 1},{"body": "Yea she was my buddy, I still think she's the one who picked out my current dog buster. He's got a very similar personality to her and is a rescue just like she was. ", "score": 1},{"body": "Interesting. she is virtually unchanged. looks slightly older but overall the same.\n\nHis face on the other hand is COMPLETELY different. young him has a elongated slightly elvish face while old him has the typical round style face.\n\nfascinating the change.", "score": 1},{"body": "Haha Cute", "score": 1},{"body": "Noicicles", "score": 1},{"body": "Every nation has owned others and done terrible things at some point, just enjoy the story. It's not making the commentary that you might read into it.", "score": 1},{"body": "boioioioioioioing", "score": 1},{"body": "\"I durn't wont no sprinkles on mah yo'gret beeeyotch!\"", "score": 1},{"body": "From Old School Cool to Unoffensive Facebook wall photo", "score": 1},{"body": "Dyamb.", "score": 1},{"body": "As long as you had your brain it wouldn't matter what body you had, it would still be you.  And speaking of brains, you are hurting mine.", "score": 1},{"body": "\"Your cat\"\ncopy a post or steal a pic \n*reddit police", "score": 1},{"body": "Call the local police and ask where they take the stray animals they find. Then call that shelter. ", "score": 1},{"body": "Is it me or does she have armpit hair? ", "score": 1},{"body": "🎵🎵 *'bout a week and a half ago, week and a half ago* 🎵🎵", "score": 1},{"body": "Who is tipping fedoras?", "score": 1},{"body": "That wasn't the twist? .... there were a lot of twists in there.", "score": 1},{"body": "Would you like us to throw you a pity party? We have blackjack and hookers.", "score": 1},{"body": "You married a prostitute?", "score": 1},{"body": "Spoiler alert!", "score": 1},{"body": "Nooooo!", "score": 1},{"body": "I had to put my childhood golden of 13 years down in August and this is the one thing I regret not doing. I wish I had her paw print, even it if was just printed on paper.", "score": 1},{"body": "Not really. That trip through alberta is not very interesting. Not even near the foothills. Your traveling through calgary-edmonton-grande prairie, its all shitty snow covered farmland.", "score": 1},{"body": "Its better than waiting for them to die on their own when they've reached a point of no return. I had to put one of my dogs down a few years ago, and I didn't want to. So I waited a week to see if maybe he would make it or go out on his own, all it served was for him to suffer and lose a lot of weight. I regret not doing it sooner", "score": 1},{"body": "Couldn't just say door, could you?", "score": 1},{"body": "It can if you continue to seek it. The only thing that changes is your worldview and you. Moreover you. Running outside in a field is no longer an adventure. Moving out on your own, exploring a new city, finding a new bar, being able to afford a nice vacation somewhere new? Those are my adventures.", "score": 1},{"body": "Roku is so full of shit for making those the 4 buttons on their remote, but you can get the premium remote without them if you pay for it.", "score": 1},{"body": "So Ferris Bueller takes medieval pictures on his days off?", "score": 1},{"body": "It's a fun business. Long hours, but fun.", "score": 1},{"body": "Last week we had to put down Aspen, my 15 year old schnauzer. I got her for my fifth birthday and she was my best friend. She was the constant in my life. Through my uncle's suicide, my parents divorce, she was always there with her big brown eyes and adorable mustache. I didn't get the time I needed with her before I said bye (like we ever could have enough time together) , but I was able to give her a bath and just hold and calm her down. Anyway, I loved finding this post and finding so many other people whom I can relate with. I love reddit.\n\nAlso, screw anyone who says dogs don't understand emotions.\n\nSCREW THEM.", "score": 1},{"body": "We all know the last state that will join and that's.\nCough cough!\nMississippi \nCough", "score": 1},{"body": "That's nothing. Who knows what would have happened if it was -40°F", "score": 1},{"body": "Then leave. Us San Diegans will be fine talking about our perfect weather without you. ", "score": 1},{"body": "I thought it said \"2 years\" at first, and I was very curious as to where those children came from.", "score": 1},{"body": "I used to design all kinds of commercial plumbing systems in 3d in AutoCAD. [Here's a pretty intense mechanical room for a daycare center.](http://i.imgur.com/gD61igJ.jpg)\n\nThat's not even 1/3rd of it. The architects had underestimated how much space we'd need, so there was no ceiling and the walls were short. It took months of designing to figure out how to fit it all in.\n\nUsually, the plumbers would only use my designs as a guide. They followed this one almost exactly.", "score": 1},{"body": "I don't know any foster family that isn't a proud \"foster failure.\"  :D\n\nI'm just glad our local shelter is no kill.. so I feel no pressure to do it until the time is right/", "score": 1},{"body": "Americans give France a lot of shit for how the World Wars went, but when shit like 9/11 or Charlie Hebdo happens, I swear we are closer to France than we are to the rest of the anglosphere.\n\nThanks for the Statue by the way. It's pretty badass.", "score": 1},{"body": "The marking in the top right hand corner was a plane passing by, if you were curious.\n", "score": 1},{"body": "The turtle's laughing at three guys who aren't getting laid tonight.", "score": 1},{"body": "No more.", "score": 1},{"body": "Who made the video? So I can try and find it that sounds amazing.", "score": 1},{"body": "[Make it yourself](http://www.papilio.com/inkjet%20waterproof%20adhesive%20film%20media.html)", "score": 1},{"body": "How do I have an elitist attitude because I don't like my country and I am against nationalism?", "score": 1},{"body": "You da real mvp. That's far as fuck from voodoo though, for the record.", "score": 1},{"body": "Have you tried /r/texas or other local subs? This isn't gonna do much since 99.999% of the people seeing this are no where near Corpus Christie.", "score": 1},{"body": "First rate analysis padre.", "score": 1},{"body": "Where did you get this taken?", "score": 1},{"body": "King bane has spoken", "score": 1},{"body": "The dream of the 90's is alive in Portland!", "score": 1},{"body": "In the craze over your eyelashes I don't think anyone has mentioned your flawless skin! You're glowy. ", "score": 1},{"body": "But you can't find anything saying it isn't, either... Funny how that works. Read Luther's list that he nailed to the church doors, that should clear it up for you.", "score": 1},{"body": "wow you got fat", "score": 1},{"body": "- Michael Scott", "score": 1},{"body": "Plus you can flash it back to clean after you are done... I need to do this asap at work.", "score": 1},{"body": "♫♫ Who can take a rainbow??? ♫ ♫", "score": 1},{"body": "Makes a lot more sense than the address OP gave..", "score": 1},{"body": "Chester loves you and nothing will change that fact.", "score": 1},{"body": "Wait where do you live? I know a Susan Werner... ", "score": 1},{"body": "Pretty much. I quit pursuing a career in music simply because there are 1,000,000 people and only 10,000 jobs in it. You are forced to compose and play music that you don't love. Obviously there are a select few but for the most part this is the case.\n\nWorking as an engineer now and can safely say I made the right decision. I play music for fun on my own and am so happy with that.", "score": 1},{"body": "Living in Austin, TX is actually kind of a goal for me after college, so... me? Fuck you.", "score": 1},{"body": "where's the doughnuts???", "score": 1},{"body": "I am so sorry for your loss. You made the right choice for her though. And even though I know it was ridiculously hard for you holding her when in happened, you will always know that you were there for her until the very end. She deserved to be in your arms when she went and not scared and alone. ", "score": 1},{"body": "I've been dumped by girls before and it seriously felt like the end of the world.  Now it's years later, I'm married to my best friend in the world, and we're expecting our first child.  Nasty, unfortunate shit happens, but do your best to confront tomorrow head-on and things will get better.", "score": 1},{"body": "Idk, I think its ok to mourn your lost pet. Not just run out and find another to distract yourself. Its healthy", "score": 1},{"body": "I know right. Don't let being perceptive and astute get in the way of common courtesy, you know?\n", "score": 1},{"body": "no. Freud was a freak. I fuck other people's mothers.", "score": 1},{"body": "I work in an office and I am home by 5pm I could take a wagon out down the hill by 505pm if I (and I imagine most people) really wanted to!!", "score": 1},{"body": "Shrek? ", "score": 1},{"body": "Have a beautiful dream Chester!! W", "score": 1},{"body": "We have/had German Shepherds, 3 of them right now with one with only a few weeks to go.  The last 2 that passed within the last 5 years, we were in the room when they went.   I cried and held them; the last time I barely restrained myself from grabbing the vet's hand, it felt like my heart was being ripped out.  This time I'm genuinely questioning my ability to stay in the room.  I know I should.  She deserves for us to be with her, she is such a good girl and we love her so much. I know that.  But I swear I just don't know how I'm going to do it this time.", "score": 1},{"body": "Nine times out of ten it's an electric razor. But every once in a while.. it's a dildo.", "score": 1},{"body": "Im in corpus christi.", "score": 1},{"body": "Maya", "score": 1},{"body": "so what are you doing for a living ?", "score": 1},{"body": "Fuck. Fuck you. I'm old. Shit I didn't realize this until your post.", "score": 1},{"body": "Congratulations", "score": 1},{"body": "The day my grandmas basset hound that I found on Christmas Day when I was like 5, got put down when I was about 15-16.and it forever scarred me 😔. She lived a long and lovely 10 years or so and I held her head when they put her down so I was her last voice and image. I cried my eyes out. What made it even worse was the fact that the vet missed her vein so she was pretty much just paralyzed instead of going to sleep. Still breathing. It devastated me. I'm crying just writing this thinking about that day and that amazing dog. I have a mutt now and I don't think of the day he has to pass. Dogs are some noble creatures, fuck man. 😔. Sorry for your loss and everyone else who have had to go through such a thing and I hope no one goes through what I had to go through. ", "score": 1},{"body": "I mistakenly watched it on TV a year after Maggie, my 8 year old golden, was put down. I thought I'd be alright but I'd basically cry the whole time, then compose myself during commercials just in time to start crying again when the movie came back on. That movie is now on my \"never watching again\" list,  as I don't like volunteering myself for that kind of torture. \n\nI miss you every day Maggerz!!!", "score": 1},{"body": "That's weird. You don't look like him at all, but your husband does.", "score": 1},{"body": "What?", "score": 1},{"body": "3, make her open the box\nAnd that's the way you do it", "score": 1},{"body": "&gt; A few degrees below freezing and it literally starts to hurt.\n\nI'm also from SoCal.  Sounds like you're describing 60 degrees.", "score": 1},{"body": "I'm sure everyone has already said this to you in every way: But you're giving him/her the best damn gift you can.\n\nLook, what's so bad about death? Absolutely nothing. You don't have a conscience to experience it. If we're reincarnated, that time passes in the blink of an eye. What sucks about death is the \"dying\" part, and what you're giving your buddy is a reprieve from suffering through it.\n\nWe (humans) fear death because we're worried about _how_ we're going to go, we're worried that we're not going to get everything done that we need to get done. We're also worried about the pain we're going to feel on the way out.\n\nYour dog has gotten done what he/she needs to get done - and that's give you x years of unconditional love, which, no matter the length of time, is a pretty damn good life. Best job in the world. Now give them their reward for doing such a good job. A pat on the head, and a relief from any pain they're feeling.", "score": 1},{"body": "More.", "score": 1},{"body": "Oh brother...at this point you're wasting your time basically SPAMMING sites. I know it feels like you are doing something constructive. You're not.\n\nGo. Outside. And. Look. For. Your. Dog. \n\nYou are wasting your time here. ", "score": 1},{"body": "I remember hearing that the burka was a cultural thing of the region and NOT Islamic. I thought it was \"Aghani\" (you've corrected me that the correct term is \"Afghan\") but now you say it's actually also Pakistani? \n\nI'm curious is the burka a Pashtun thing then?", "score": 1},{"body": "Or ride a wagon down a hill on Saturdays. Nothing is stopping you!", "score": 1},{"body": "Her hat looks like it should be a picture on r/trees", "score": 1},{"body": "Voldemort should have just done this isn't of making a bunch of Horcruxes", "score": 1},{"body": "yep! lets have some of those freedom fries.", "score": 1},{"body": "Thanks for sharing this! I immediately loved Chester. ", "score": 1},{"body": "Alternate way of reading your name then:\n\nMoth: A Fucking Sorcerer.\n\n", "score": 1},{"body": "This is one of the most depressing things I've seen on reddit today", "score": 1},{"body": "I actually got this for my grandma. I'm sure she'll love an escort feature!", "score": 1},{"body": "[Owwww yeah] (http://giphy.com/gifs/comedy-seinfeld-7ZptkGfCfFOaA)", "score": 1},{"body": "You have to think, not all pets are treated with love and care that someone like yourself most likely showed. Nothing anyone says will ever stop the pain of losing an amazing friend/family member, but the positive memories and bond shared by you two will last forever. Truly sad for this, but know that we humans who care weep for your loss.", "score": 1},{"body": "I think you got it backwards, or you Americans are living in hades.\n\n90F = 212C...", "score": 1},{"body": "Of course, you can see it on the first picture on the very left side, kind of cut out of the picture, its an ABB drive.", "score": 1},{"body": "&gt;, Next thing you'll tell me is that Stephen Colbert is not an upstanding, god-loving, republican.\n\nExcept he *does* teach Sunday school, so I think \"god-loving\" is definitely in there.  He's also presumably upstanding.  So the only thing you're inaccurate on is the \"republican\" part.  I actually thought he was in fact a republican, but when I looked more closely, it seems he described himself in 2004 as a democrat.", "score": 1},{"body": "Always? Even to bed?", "score": 1},{"body": "Fuck eye mold! ", "score": 1},{"body": "*...again.*", "score": 1},{"body": "Dude looks good rockin' a kilt.", "score": 1},{"body": "Buhbye chester!", "score": 1},{"body": "Is that you Chicken George?", "score": 1},{"body": "you could fall", "score": 1},{"body": "I want all of them.", "score": 1},{"body": "+1 for Humphrey fucking bogart. ", "score": 1},{"body": "You got fat and her feet are gross.\n\n2/10", "score": 1},{"body": "https://whymore18.imgur.com/all/\n\nhttps://whymore18.imgur.com/all/\n\nhttps://whymore18.imgur.com/all/\n\nMore pictures of Grey!! Thanks", "score": 1},{"body": "photos or I don't believe you.", "score": 1},{"body": "Cunt yerself, Its the FFA - Football Federation of Australia, officially named Football in Australia and has started to permeate mainstream media covering sport. Cunt.", "score": 1},{"body": "Congrats, you are the .001% ", "score": 1},{"body": "Booooo", "score": 1},{"body": "They reach a point where they are just in pain and the end is close. Better to do it peacefully. Dogs have a habit of walking off to die. My families 18 year old poodle did that. We should have taken her in to be put down long before she left. It breaks my heart to think about her dying alone, scared in the bush. Dammit. Onions. ", "score": 1},{"body": "I remember *walking ten miles in the snow* to the drive-in, when the writers were still working on the Austin Powers SCRIPT!", "score": 1},{"body": "Mr. Plow, that's the name.  That name again is Mr. Plow. ", "score": 1},{"body": "I wouldn't really call it a problem.  My second toes are clearly longer than my big toes, but I've never had any problems with my feet.", "score": 1},{"body": "Well.  I won't be able to see that scene any other way now.", "score": 1},{"body": "Do you think that's possible for everybody?", "score": 1},{"body": "God dammit.", "score": 1},{"body": "No, it was more than just three House cafeterias. It happened at lots of places, especially in the South (where it started, at a restaurant called Cubbie's in North Carolina). Hell, as of June 1013 there were [still places](http://blogs.ocweekly.com/stickaforkinit/2013/06/bagel_me_villa_park_freedom_fries_french.php) doing it.\n\nThe hostility toward France has ebbed since 2003 but not completely, and the stupidity behind it remains. It was never a majority sentiment, from what I saw, but large enough to make you shake your head.", "score": 1},{"body": "Putting out Beagle down was the hardest thing I had ever gone through at that point. It also remains the only time I had ever seen my dad cry. I know full well I am going to go through it again with my family's current dog. I don't get to see her as much, but you would think she had gone years without seeing me every time I stop over. It took a few years for my family's heart to mend before we let another dog in and that alone took my sister pulling off one of the greatest guilt trips of all time. Like I said, I know it's coming in probably 7-8 years with our current dog, but I will continue to have to have one to try to fill the previous one's place.", "score": 1},{"body": "Go fuck yourself. ", "score": 1},{"body": "I've actually been working on trying to be able to post again. Finally got a post up in r/Texas. Any other suggestions?", "score": 1},{"body": "I hope I'm not the only one who can't stop staring at that toe.", "score": 1},{"body": "Have a beautiful dream Chester!! ", "score": 1},{"body": "Advice from my vet: It is _never_ too early to start glucosamine. Start them as a puppy, and you'll get longer lasting joints.", "score": 1},{"body": "I love the names they used to give the teams on that Show.  The Bon Jovi Babes vs. the leached love boils.", "score": 1},{"body": "You know what is an even stranger thing that happens to find lost things more frequently than wasting time posting here?\n\nGoing around town and doing the hard work of looking for the dog instead of posting pictures here hoping for an Internet miracle.\n\n", "score": 1},{"body": "It's dick in a bun in a box", "score": 1},{"body": "We are Canada lite. ", "score": 1},{"body": "Theres so many redditors in spring... It's like I've walked into a club in this thread that i didn't know existed.", "score": 1},{"body": "[What about it?](https://www.youtube.com/watch?v=Az86iKhWAjk)", "score": 1},{"body": "Omg lol! Because he looks like Jay! Amirite!?", "score": 1},{"body": "Copy and Pasted \"graffiti\" - a lot like Reddit", "score": 1},{"body": "I don't want to be that guy, but i have to. \n\nMan, your wife is vampire.", "score": 1},{"body": "I was gonna say Stephen Stills ", "score": 1},{"body": "I'd rather play video games after work, and then go to a bar.", "score": 1},{"body": "I swear, that's the worst attempt at repost karma i've ever seen.\n\nA: That's not your cat, so fuck off.\n\nB: That was not posted 30 days ago, so fuck off.\n\nC: You didn't even bother to change the title, so fuck off.\n", "score": 1},{"body": "Some stuff does.\n\n\nBeing an adult opens up so many doors and opportunities, it just sucks that being an adult makes it harder to take advantage of those opportunities.\n\n\nI love being an adult, I like dealing with my own stuff, for better or worse.", "score": 1},{"body": "U just had to say retard baby", "score": 1},{"body": "Framing my basement in December 2005 and was trying to toenail a nail into what was one of the very last studs. It ricocheted and I expected to hear a \"ding\" on the floor where it fell. I looked around for it and found it... sticking through my right hand. \n\nHere's [a photo](http://i.imgur.com/RDhQ3kp.jpg) of it. My wife was too freaked out to take the pic, so I had to take it myself. ", "score": 1},{"body": "It's about solidarity. It's a modern day for me of Remember Pearl Harbor or 9/11 Never Forget. It was a tragedy. It was an attack on freedom of speech and that is universal. ", "score": 1},{"body": "They've had two children since the last time they took this photo.", "score": 1},{"body": "Is anyone else bothered by that one toe?", "score": 1},{"body": "We've done that for a couple of nights and posters have been put up everywhere. She's micro chipped, too, but for some reason our stupid city marked her as a dog on accident.", "score": 1},{"body": "We need to talk about Kelvin", "score": 1},{"body": "Lone =/= lonely", "score": 1},{"body": "I'm in Sweden. Haven't seen her today.", "score": 1},{"body": "I swear to God I went to high school with you.", "score": 1},{"body": "Bang bros", "score": 1},{"body": "Why is this nsfw?? ", "score": 1},{"body": "And you will know when it's the right time and it will be awesome for you and your foster, until you can you should see if the shelter needs any help. I know the ones by me always need volunteers and the animals would love you for it. ", "score": 1},{"body": "Who appointed you the foul-crier of reddit?  If you don't like it, downvote it and move on.  You could also unsubscribe from the sub.  There are many options and you chose the most acerbic one?", "score": 1},{"body": "Is that a 16 penny nail?! Glad you missed your bone. How long did your project remain incomplete? ", "score": 1},{"body": "Some people enjoy their jobs, growing older, having experiences, freedom, respect, and not being man-children that look to a fucking children's cartoon for ideology.", "score": 1},{"body": "Clever! This photo recreation thing....This may catch on!", "score": 1},{"body": "Sounds about right...\n\nBloody Hash smokers.", "score": 1},{"body": "Wow. Why would anyone bother to make an \"I hate an internet stranger subreddit?\"", "score": 1},{"body": "&gt;*lone stranger *", "score": 1},{"body": "You have the U captioned picture? Should post it on /r/illusionporn !", "score": 1},{"body": "Badass", "score": 1},{"body": "\"Bueller, we are in public and I need you to calm down.\"", "score": 1},{"body": "Id like to believe this too but these days I wouldn't be surprised if it was actually serious", "score": 1},{"body": "If you want eternal life, have him stuffed and make him into a quadcopter and then post the video online", "score": 1},{"body": "I'm not fat i'm big boned!!", "score": 1},{"body": "Why would they need one?", "score": 1},{"body": "I thought it was a gutter of cockroaches before I read the title.", "score": 1},{"body": "He better not cock it up again.", "score": 1},{"body": "this is like my worst nightmare, being stuck in some frozen wasteland with a hot shower, once you get in, you can never get back out or else you'll freeze.", "score": 1},{"body": "Awesome work , Gallowboob!", "score": 1},{"body": "Adorable.", "score": 1},{"body": "He is a hero in every sense of the word. It brings tears to my eyes knowing that he will never get to grow old and watch his own children become amazing human beings like he was.\n\nRest in peace hero ", "score": 1},{"body": "That last sentence was haunting, I can't stop crying throughout this entire thread. I'm so sorry fr your loss. I lost my shadow about nine years ago. The funny thing is, every time I've come through my front door since then I still expect to hear her nails on the linoleum floor to this day. I'm pretty sure I still do, every day.\n\nThe worst part is, even if you are the master in the relationship, they control everything you do. Yes, you house train them and people train them but past that all they do is train you. ", "score": 1},{"body": "We get quite a lot of rain but personally I'd take that over the terrible snow they get and heatwaves where you can barely go outside.  \nAlso since you complained about the weather it leads me to believe you are destined to stay British.", "score": 1},{"body": "How cold is that in American? ", "score": 1},{"body": "The gun to his head might've had something to do with that...", "score": 1},{"body": "So you joined a gang.", "score": 1},{"body": "sry, it's not going to work out, someone got store brand mayo.", "score": 1},{"body": "Are you really hating on a guys way of coping with loss? Everyone has their own ways but to hate on someone because of it makes you a more shitty person than he could ever be. ", "score": 1},{"body": "oh noooo a guy on the internet doesn't believe me", "score": 1},{"body": "WHY ARE WE YELLING", "score": 1},{"body": "Funniest thing I've read today.", "score": 1},{"body": "Sprinkle in \"like a minority\" after every verb as a speech enhancer.\n\nC'mon, lets bail (like a minority)!", "score": 1},{"body": "Dante and Randall going to the wake and it immediately cutting to them bailing - and both car scenes before and after - will forever be my favourite.", "score": 1},{"body": "The first one looks way more authentic.", "score": 1},{"body": "Oh yeah, sorry. ", "score": 1},{"body": "This is really immature and is accomplishing nothing. Why do you do it?", "score": 1},{"body": "I can't exactly take your cop-out reasoning for not responding too seriously, given that your own statements continue to be littered with grammatical, structural, and logical errors. However, if you would like me to excuse your laziness or your unwillingness to go through the trouble of making an actual argument, I am fine doing that because this is not a rigorous environment and the bar is thus very low for you. We can both move on.", "score": 1},{"body": "Why dont you eyebrows freeze?\n", "score": 1},{"body": "Im from ottawa but in Cali vacationing until Sunday. .. I do not want to go back home", "score": 1},{"body": "Word up", "score": 1},{"body": "Funny. I just looked at a Forester at a police impound yard and it had blood in it. ", "score": 1},{"body": "My head...  \"Holy shit!  wait...  this can be what I think it is..  wait for it wait for it found it.  Upvote\"", "score": 1},{"body": "Nice. I like ABB. ", "score": 1},{"body": "Why not let the Germans finish their song? Rude...", "score": 1},{"body": "Every time I go to rave I hope that one day I will see a group of women at a rave in full burkas rolling balls. The closest I've ever seen is a woman wearing a headscarf skateboarding :/", "score": 1},{"body": "Well done. Very convincing hooves!", "score": 1},{"body": "The real question is why is she holding a gun to his head?", "score": 1},{"body": "Quite and get another job, its honestly the only way.\n\n\nOffice jobs are shitty, not because they're super boring but because your days fly by and before you know it its the end of the week and you're dead inside. Weeks fly by, you have to keep putting off important things because of work, put off bank meetings, doctors appointments, life style changes, you want to get a new job and change your life but you have work so you'll do it on Saturday. Saturday comes by, nope, I'm going to sleep in because I have work next week and I'm behind on sleep.\n\n\nYears go by, you're in your 30's and you hate your job, cant change it, now you have to deal with the anxiety of \"is it too late?\"\n\n\n", "score": 1},{"body": "God damn it Banksy.", "score": 1},{"body": "Why am I still up?\n\n...\n\nIn Spain, these vegetarian flans are made in low, round, small oven bowls. The edge isn't too high, so the dish cooks quicker than in a taller bowl with the same content. Of course you can also use a bigger oven dish. If you do, make sure to adjust the cooking time to 45 minutes.\n\n**ingredients**\n\n- 250g mushrooms\n- 2 spring onions\n- a dash of olive oil\n- 5 eggs\n- 300ml milk\n- 200ml whipping cream\n- half a bunch of parsley\n- salt\n- cayenne pepper\n\nPreheat the oven to 200°C.\n\nClean the mushrooms and cut them in 4.\n\nClean the spring onions and cut them in small rings.\n\nHeat the oil and fry the mushrooms on high. Add salt and pepper to taste.\n\nGrease the bowls with olive oil and divide the mushrooms between them.\n\nWhisk the eggs with the milk and the cream.\n\nChop the parsley and mix into the egg mixture, adding salt, pepper and nutmeg (*WTF why is nutmeg not in the list of ingredients?*).\n\nPour this mixture into the oven bowls, over the mushrooms.\n\nPlace the bowls on an oven tray, covered with a small layer of water. Place this tray in the oven and cook in 25 - 30 minutes.", "score": 1},{"body": "Well obviously he would need to go slightly west \n", "score": 1},{"body": "An axe? I must have missed something", "score": 1},{"body": "The mom got hotter as she got older. Impressive. \n", "score": 1},{"body": "Look into the surgery where they either extend the metatarsal? of the first toe or cut the length of second toe. The recovery time is about three weeks to a month before you can walk without crutches again but it's supposedly worth it. Also, good on your fiancé as I'd like to have someone rub my feet every night too. ", "score": 1},{"body": "If only I knew what this meant...", "score": 1},{"body": "Wow. This should be posted on /r/GetUnmotivated. ", "score": 1},{"body": "Where do you live?", "score": 1},{"body": "MISSOURI!", "score": 1},{"body": "It's Cenk Uygur from The Young Turks. Check out Tytnetwork.com and wolf-PAC.com. He also has a YouTube channel with 2.4 million members and 2 billion views.\nOne of the few newscasters left with real integrity. I hope he and his team succeed, they have a lot of tough times ahead of them. ", "score": 1},{"body": "&gt; It was 65 and sunny in Cali today. Although there was a slight breeze so I kept my hoody on.\n\nShitty. I think it would be boring to have the same weather 12 months a year. Nothing like 4 seasons", "score": 1},{"body": "Your dog got lost last spring? That was a year ago!", "score": 1},{"body": "There goes the whole \"gay fashion sense\" argument. \n\nbut they do look happy. Congrats.", "score": 1},{"body": "You shouldn't care because you're Australian, but the Supreme Court is a big deal in America.", "score": 1},{"body": "That's what I'm saying. I love the things you do outside of work. Not many people are hiring for \"video game player\" or \"work out guy\". ", "score": 1},{"body": "Consistency with the reverse perhaps, since entering 0.5555556 on a standard calculator isn't as nice as 5÷9=\n\n(now replying to the right comment...) ", "score": 1},{"body": "It's so sick that \"rescue\" needs to be a thing, but it's awesome that people like yourself exist. ", "score": 1},{"body": "Maybe don't do that.", "score": 1},{"body": "it's gotta be so hard.", "score": 1},{"body": "I saw bergs in Twillingate too! I'm from the Rock on the west coast, though. ", "score": 1},{"body": "I'm a 6'5 240 lb oil refinery operator on night shift and I'm about to start crying in this room full of dudes and all I want to do is go home and cuddle with my 2 pups.  3 more hours till shift change... ", "score": 1},{"body": "Reminds me of the leader of the Huns from Mulan for some reason..", "score": 1},{"body": "Not necessarily. I have ones that date from the mid 1700s in my town and they're hardly much more than stone rectangles.", "score": 1},{"body": "Didn't know they sold Jameson in the west. Would have made it much easier for horsemen at the time.", "score": 1},{"body": "I'm a grown man crying my eyes out right now. My grandpas funeral was last week and I didn't cry this much.", "score": 1},{"body": "He looks like Andy Milonakis with a hat.", "score": 1},{"body": "It's not a two way system but trust me she *sees* you.", "score": 1},{"body": "What a jon", "score": 1},{"body": "The oldest continuously inhabited towns in America are about a thousand years old.  They just weren't founded by Europeans and their descendants.", "score": 1},{"body": "Same here, the company I work for has a section that sells ABB so that is was we work with most but they seem to be the best, and easiest to work with, in my opinion.", "score": 1},{"body": "I'm really into this.", "score": 1},{"body": "&gt;enjoys the silence of death and -35^o weather\n\nAre you a lich?", "score": 1},{"body": "It's expensive.", "score": 1},{"body": "I'd say this gentleman filled out nicely. ", "score": 1},{"body": "Burning man does not sound fun.", "score": 1},{"body": "I'm pretty sure that's a young Kim-Jung-il. The glasses give it away. ", "score": 1},{"body": "i couldn't even imagine being in that kind of cold. ", "score": 1},{"body": "No, it doesn't. Choosing to live a shitty life as an adult sucks.", "score": 1},{"body": "schizophrenia", "score": 1},{"body": "Shhhh", "score": 1},{"body": "I bet you would spend a lot more to get a diamond then a ring like this.", "score": 1},{"body": "Wow, 20 years later and you guys look great!", "score": 1},{"body": "For those of you wondering what FTFMG means it means \"For The Fucking Massive Grapes\"", "score": 1},{"body": "Chester \n\nOh, hey for those years gone past,\nWhen Chester sat for me an' lass!\nTail did flitter upon our turn,\nTo scratch behind an ear upturned!\n\nHe pawed the new-mown sward unsure,\nAnd gained his stride with courage earned.\nPlayed heartily in the seasons past,\nOn summer eve, his shadow cast'd.\n\nTho many mile did paws much roam,\nEr'day he loving knew his home.\nSnuggled deep into our hearts,\nYet laughing we did blame our farts!\n\nAs sun doth set and breeze be still,\nChester no more climbs life's weary hill.\nOur hearts do ache, tears streaming down,\nOur lad's moved on, another dawn.\n\nChester, our lad, is sadly gone.\nForget we not our dear ol' boy,\nOr the dusty corner that bears a toy.\nFor here once sat a loyal lad-\n\nAnd I once was dear Chester's dad!", "score": 1},{"body": "Sorry for your loss OP.  My little lady had to be put to sleep yesterday morning.  I am so profoundly sad.  Here's her at her cutest.  Goodbye [Scooter](http://imgur.com/qicqRVR).  ", "score": 1},{"body": "Is it weird that all I could think about while looking at that picture was how terrifying it would be to be waist deep in the Amazon River?", "score": 1},{"body": "15 yogurts ", "score": 1},{"body": "Attempting to click on these images leads to this error for me and likely everyone else. Best of luck in finding your dog.\n\nWhyMore18's images are not publicly available.\n", "score": 1},{"body": "Tried? But he's too sexy!", "score": 1},{"body": "The number of people who have seen clerks is a non-negative number.", "score": 1},{"body": "What error?", "score": 1},{"body": "While probably not the right thing to do, I'd give it a 50/50 of me removing it myself if that happened to me. ", "score": 1},{"body": "We saw Aliens at a drive in. Spilled tequila all over the dash. God--and Heavy Metal. We taped it on cassette tape. On a boom box. **What year is this**?", "score": 1},{"body": "Perfectly carved wooden Altmer* skull.", "score": 1},{"body": "When you have too many haters and would like to document your encounter with them so that people know how much hatred there is up in here up in here.", "score": 1},{"body": "And very superior", "score": 1},{"body": "Cheap, moderately simple and only a slight chance of certain death. Brilliant!", "score": 1}]